{"data":{"updated":"2/12/2026, 4:05:05 AM","entries":[{"time":"17:38","ticker":"ALMU","headline":"Aeluma Announces Second Quarter Fiscal 2026 Financial Results","body":"GOLETA, Calif., Feb. 11, 2026 (GLOBE NEWSWIRE) -- Aeluma, Inc. (NASDAQ: ALMU) (\"Aeluma\" or the \"Company\"), a transformative semiconductor company specializing in high-performance and scalable technologies, today reported financial results for its second quarter of fiscal 2026 ended December 31, 2025.Click here for full release."},{"time":"17:37","ticker":"VNDA","headline":"Vanda Pharmaceuticals Reports Fourth Quarter and Full Year 2025 Financial Results","body":"WASHINGTON, Feb. 11, 2026 /PRNewswire/ -- Vanda Pharmaceuticals Inc. (Vanda) (Nasdaq: VNDA) today announced financial and operational results for the fourth quarter and full year ended December 31, 2025.Click here for full release."},{"time":"17:33","ticker":"NVCR","headline":"NovoCure confirms FDA approval of Optune Pax for the treatment of locally advanced pancreatic cancer","body":"• Optune Pax concomitant with gemcitabine and nab-paclitaxel is the first treatment to be FDA approved in nearly 30 years for locally advanced pancreatic cancer\n• Phase 3 PANOVA-3 trial showed a statistically significant improvement in overall survival (OS) and significantly extended time to pain progression in patients treated with Optune Pax\n• Optune Pax is a wearable medical device that delivers Tumor Treating Fields (TTFields), alternating electric fields that disrupt cancer cell replication to cause cell death, providing a new treatment approach for pancreatic tumors"},{"time":"17:33","ticker":"MELI","headline":"MercadoLibre forms commercial partnership with Assa to sell, store and deliver products beginning in March, according to Reuters","body":"Reuters"},{"time":"17:33","ticker":"PLUG","headline":"Plug Power accelerates reconvened session of special meeting of stockholders to Thursday, February 12, 2026","body":"Stockholders attending the virtual meeting will be able to vote and submit questions in real time. Participants should have their 16-digit control number from their proxy materials to access the meeting.Click here for full release."},{"time":"17:20","ticker":"GRAB","headline":"Grab reports Q4 results; authroizes new $500 mln share repurchase program","body":"• Reports Q4 EPS net of breakeven vs. the FactSet Consensus of $0.01. Revenue increased 19% yr/yr to $906 mln vs. the FactSet Consensus of $936.59 mln.\n• Q4 2025 On-Demand GMV grew 21% year-over-year to a record of $6.1 billion; Adjusted EBITDA grew 54% year-over-year to $148 million.\n• Cos Board of Directors has authorized a share repurchase program, under which Grab may repurchase up to $500 million worth of its outstanding Class A ordinary shares."},{"time":"17:17","ticker":"GRAB","headline":"Grab accelerates financial services roadmap with acquisition Stash Financial","body":"• Co announces that it had signed definitive agreements to acquire 100% of the equity interest in Stash Financial, Inc, a U.S. digital financial services company, with the payment for 50.1% equity interest to be made at Closing at an enterprise value of US$425 million and payments for the remaining interest to be made at the fair market value over three years post-Closing.\n• Acquiring Stash offers Grab access to talent and technology to accelerate its Financial Services roadmap, as well as high-margin subscription-based revenue. Based on current performance, Stash is expected to generate over $60 million in Adjusted EBITDA in the 2028 calendar year. Stash will continue operating as an independent brand in the U.S. post-Closing.\n• The transaction is subject to regulatory approvals and other customary closing conditions and is expected to close in the third quarter of 2026 . The payment at Closing will be made in a combination of cash and stock, and subsequent payments will be made in cash and/or stock at Grab's discretion."},{"time":"17:13","ticker":"CGNX","headline":"Cognex approves a $500 mln increase to its existing share repurchase authorization","body":""},{"time":"17:12","ticker":"CSCO","headline":"Cisco -6.3% following Q2 results and guidance; not seeing much reaction in other networking equipment names","body":"• Notable movers: Arista Networks (ANET -0.8%), Lumentum (LITE -0.3%), Nokia (NOK -0.3%), Ciena (CIEN -0.1%).\n• Broadcom (AVGO), a key supplier to Cisco, is roughly flat after hours. Currently trading at $342.71 (-0.01%)."},{"time":"17:10","ticker":"BMM","headline":"Blue Moon Metals advances four core assets with comprehensive 40,000 meter 2026 infill and step-out drilling programs","body":""},{"time":"17:08","ticker":"BIIB","headline":"Biogen announces that the Board of Directors has elected Dr. Maria C. Freire as Chair of the Board of Directors, effective immediately following the Company's 2026 Annual Meeting of Stockholders, scheduled to take place on June 9","body":"• Dr. Freire will succeed Caroline Dorsa who has decided to retire from the Biogen Board of Directors and not to stand for reelection at the Annual Meeting.\n• Dr. Freire joined the Biogen Board in 2021 and serves on the Corporate Governance Committee and on the Compensation and Management Development Committee."},{"time":"17:06","ticker":"MFC","headline":"Manulife Financial increases quarterly cash dividend 10.2% to $0.485/share from $0.44/share","body":""},{"time":"17:04","ticker":"MFC","headline":"Manulife Financial beats by $0.35; Also announces a 10.2% increase to quarterly dividend and new Normal Course Issuer Bid program that permits repurchase of up to approximately 2.5% of outstanding common shares","body":"• Reports Q4 (Dec) earnings of $1.12 per share, excluding non-recurring items, $0.35 better than the FactSet Consensus of $0.77.\n• Core ROE of 16.5% in 2025 and 17.1% in 4Q25, and ROE of 12.0% in 2025 and 12.7% in 4Q25.\n• Also announced today: A 10.2% increase in the quarterly dividend per common share, and a new Normal Course Issuer Bid program that permits repurchase of up to approximately 2.5% of outstanding common shares, expected to commence in late February 2026."},{"time":"16:59","ticker":"ASTS","headline":"AST SpaceMobile announces proposed private offering of $1 bln of convertible notes due 2036; also announces proposed repurchases of up to $300 mln convertible notes","body":"• Co announces proposed cash repurchases of up to $50.0 million of its 4.25% convertible senior notes due 2032 and up to $250.0 million of its 2.375% convertible senior notes due 2032 and its intention to offer, subject to market and other conditions, shares of its Class A common stock to holders of Existing Notes participating in the Repurchases in two separate direct placements registered under the Securities Act of 1933, as amended."},{"time":"16:51","ticker":"MPB","headline":"Mid Penn Bancorp and 1st Colonial Bancorp (OTC: FCOB) announce that shareholders from 1st Colonial overwhelmingly approved Mid Penn's proposed acquisition","body":"Over 80% of the outstanding shares of 1st Colonial common stock were represented at the 1st Colonial special meeting, constituting a quorum."},{"time":"16:49","ticker":"ENTA","headline":"Enanta Pharmaceuticals files for $150 mln mixed securities shelf offering","body":""},{"time":"16:48","ticker":"MSA","headline":"MSA Safety beats by $0.12, reports revs in-line; Sees mid-single-digit organic sales growth in 2026","body":"• Reports Q4 (Dec) earnings of $2.38 per share, excluding non-recurring items, $0.12 better than the FactSet Consensus of $2.26; revenues rose 2.3% year/year to $511 mln vs the $508.1 mln FactSet Consensus.\n• 2026 Net Sales Outlook: The company is expecting mid-single digit full-year organic sales growth in 2026.\n• While macroeconomic conditions presented challenges, MSA delivered organic sales growth within our low-single digit 2025 Outlook range, free cash flow conversion that surpassed our annual target range and higher capital returns to shareholders,\" commented Julie Beck, MSA Safety Senior Vice President and Chief Financial Officer."},{"time":"16:48","ticker":"PPC","headline":"Pilgrim's Pride misses by $0.07, beats on revs","body":"• Reports Q4 (Dec) earnings of $0.68 per share, excluding non-recurring items, $0.07 worse than the FactSet Consensus of $0.75; revenues rose 3.3% year/year to $4.52 bln vs the $4.38 bln FactSet Consensus."},{"time":"16:47","ticker":"DAR","headline":"Darling Ingredients misses by $0.05, beats on revs","body":"• Reports Q4 (Dec) earnings of $0.35 per share, $0.05 worse than the FactSet Consensus of $0.40; revenues rose 20.6% year/year to $1.71 bln vs the $1.53 bln FactSet Consensus.\n• For first quarter 2026, the company estimates core ingredients business adjusted EBITDA to be approximately $240-$250 million."},{"time":"16:47","ticker":"LPTH","headline":"LightPath Technologies reports fiscal 2026 second quarter financial results","body":"ORLANDO, Fla., Feb. 11, 2026 /PRNewswire/ -- LightPath Technologies, Inc. (NASDAQ: LPTH) (\"LightPath,\" the \"Company,\" \"we,\" or \"our\"), a leading provider of next-generation optics and imaging systems for both defense and commercial applications, today announced financial results for its fiscal second quarter ended December 31, 2025.Click here for full release."},{"time":"16:46","ticker":"PTLO","headline":"Portillo's announces the appointment of Brett Patterson as President and Chief Executive Officer, effective Monday, February 23, 2026","body":"Patterson will also join the Company's Board of Directors."},{"time":"16:46","ticker":"LUV","headline":"Southwest Air brings Starlink ultra-fast wifi onboard; Starlink will deliver next-generation WiFi across Southwest's network of 11 countries, allowing Customers to stream, share, and scroll in the sky at lightning-fast speeds","body":""},{"time":"16:44","ticker":"SCANX","headline":"Notable earnings/guidance movers: FSLY +29.5%, CGNX +19.7%, MH +16.1%, PRCH +12.5% on upside; ROL -16.5%, PAYC -7.9%, CSCO -6.2%, APP -5.5% on downside","body":"• Earnings/guidance gainers: FSLY +29.5%, CGNX +19.7%, MH +16.1%, PRCH +12.5%, EQIX +9.5%, VKTX +8.6%, CXW +5.4%, PLMR +4.8%, AR +3.8%, CW +3.7%, PRI +3.6%, MSI +2.4%, RYN +2.2%, WTS +1.8%, CPA +1.6%\n• Earnings/guidance losers: ROL -16.5%, NRGV -16.3%, INSP -8.7%, TYL -8.3%, PAYC -7.9%, NBR -6.5%, CSCO -6.2%, APP -5.5%, NBIX -5%, AUR -5%, QTWO -4%, FBRT -3.9%, WCN -3.2%, ALB -3.1%, SCI -2.9%, NE -2.9%, CRK -2.8%, QS -2.7%, HUBS -2.5%, CXT -1.4%, IFF -1.3%"},{"time":"16:44","ticker":"PFSI","headline":"PennyMac enters into a definitive agreement to acquire the subservicing business of Cenlar Capital Corporation, in an all-cash transaction for an upfront purchase price of $172.5 million and up to $85 million of contingent consideration payable over three years","body":"• Based on Cenlar's current portfolio, Pennymac is expected to add up to $740 billion in unpaid principal balance of mortgage loan subservicing and 2 million loans to its servicing portfolio. This expansion will bring Pennymac's total portfolio to over $1 trillion in UPB.\n• The transaction is expected to close in the second half of 2026, subject to customary closing conditions, including required regulatory approvals. Concurrently with closing, Cenlar will surrender its bank charter.\n• Pennymac will acquire Cenlar's subservicing business as a non-bank entity focused exclusively on mortgage subservicing and will methodically transition approximately 100 institutional clients while delivering enhanced levels of customer service and care to their borrowers."},{"time":"16:38","ticker":"GLUE","headline":"Monte Rosa Therapeutics files mixed securities shelf offering","body":""},{"time":"16:38","ticker":"CMS","headline":"CMS Energy files mixed securities shelf offering","body":""},{"time":"16:38","ticker":"PRCH","headline":"Porch Group Reports Fourth Quarter 2025 Results","body":"Porch Group, Inc (PRCH), a new kind of homeowners insurance company, today reported fourth quarter and full-year results through December 31, 2025, that exceeded our expectations.Click here for full release."},{"time":"16:35","ticker":"WRN","headline":"Western Copper announces C$50 Million bought deal financing","body":"VANCOUVER, BC, Feb. 11, 2026 /PRNewswire/ - Western Copper and Gold Corporation (TSX: WRN) (NYSE: WRN) (the \"Company\") is pleased to announce it has entered into an agreement with Stifel Canada, on its own behalf and on behalf of a syndicate of underwriters (the \"Underwriters\"), pursuant to which the Underwriters have agreed to purchase, on a bought deal basis, 12,048,400 common shares of the Company (the \"Common Shares\") at a price of C$4.15 per Common Share (the \"Offering Price\") for gross proceeds to the Company of approximately C$50,000,860 (the \"Offering\").Click here for full release."},{"time":"16:34","ticker":"FBRT","headline":"Franklin BSP Realty Trust, Inc. Announces Fourth Quarter and Full Year 2025 Results","body":"Franklin BSP Realty Trust, Inc. (NYSE: FBRT) (\"FBRT\" or the \"Company\") today announced financial results for the quarter and full year ended December 31, 2025.Click here for full release."},{"time":"16:34","ticker":"FLR","headline":"Fluor awarded a multi-year contract by Centrus Energy's (LEU) subsidiary, American Centrifuge Operating","body":"Fluor will serve as the integrated engineering, procurement and construction partner to expand its low-enriched uranium and high-assay low-enriched uranium enrichment facility in Piketon, Ohio."},{"time":"16:34","ticker":"WRAPX","headline":"Closing Market Summary: Market drifts sidways after January jobs report prompts early choppiness","body":"• S&P Mid Cap 400: +8.4% YTD\n• Russell 2000: +7.6% YTD\n• DJIA: +4.3% YTD\n• S&P 500: +1.4% YTD\n• Nasdaq Composite: -0.8% YTD\n• Weekly MBA Mortgage Applications Index -0.3%; Prior -8.9%\n• January Nonfarm Payrolls 130K (Briefing.com consensus 68K); Prior was revised to 48K from 50K, January Nonfarm Private Payrolls 172K (Briefing.com consensus 60K); Prior was revised to 64K from 37K, January Unemployment Rate 4.3% (Briefing.com consensus 4.4%); Prior 4.4%, January Average Hourly Earnings 0.4% (Briefing.com consensus 0.3%); Prior was revised to 0.1% from 0.3%, January Average Workweek 34.3 (Briefing.com consensus 34.2); Prior 34.2The key takeaway from the report is that it is a positive sign for the U.S. growth outlook, yet it may come with the cost of foregoing an additional rate cut by the Fed, at least in the near future.\n• The key takeaway from the report is that it is a positive sign for the U.S. growth outlook, yet it may come with the cost of foregoing an additional rate cut by the Fed, at least in the near future.\n• The Treasury's budget deficit was $94.6 billion in January (Briefing.com consensus: -$190.0B), which was much narrower than expected and a notable improvement from the same period a year ago when it was $128.6 billion. Receipts totaled $559.9 billion, while outlays summed to $654.6 billion. The key takeaway from the report is that it shows the benefits of collecting customs duties as a means of reducing the deficit. At the same time, it also reflects the onerous interest costs stemming from the high amount of debt issuance needed to fund government operations. Weekly crude oil inventories increased by 8.53 million barrels after decreasing by 3.46 million barrels a week ago.\n• The key takeaway from the report is that it shows the benefits of collecting customs duties as a means of reducing the deficit. At the same time, it also reflects the onerous interest costs stemming from the high amount of debt issuance needed to fund government operations. Weekly crude oil inventories increased by 8.53 million barrels after decreasing by 3.46 million barrels a week ago."},{"time":"16:34","ticker":"NE","headline":"Noble Corporation misses by $0.08, beats on revs; guides FY26 revs in-line","body":"• Reports Q4 (Dec) earnings of $0.09 per share, excluding non-recurring items, $0.08 worse than the FactSet Consensus of $0.17; revenues fell 17.6% year/year to $764.41 mln vs the $731.1 mln FactSet Consensus.\n• Co issues in-line guidance for FY26, sees FY26 revs of $2.8-$3.0 bln vs. $2.97 bln FactSet Consensus.Also sees Adjusted EBITDA in the range of $940 to $1,020 million, and Capital Expenditures between $590 to $640 million. This range of Capital Expenditures includes 50% of the estimated $160 million project capital for the Noble GreatWhite, as well as approximately $25 million of reimbursable capital.\n• Also sees Adjusted EBITDA in the range of $940 to $1,020 million, and Capital Expenditures between $590 to $640 million. This range of Capital Expenditures includes 50% of the estimated $160 million project capital for the Noble GreatWhite, as well as approximately $25 million of reimbursable capital."},{"time":"16:33","ticker":"WTS","headline":"Watts Water Tech. beats by $0.28, beats on revs; provides FY26 outlook","body":"• Reports Q4 (Dec) earnings of $2.62 per share, excluding non-recurring items, $0.28 better than the FactSet Consensus of $2.34; revenues rose 15.7% year/year to $625.1 mln vs the $610.04 mln FactSet Consensus.\n• Guidance: The Company anticipates full year 2026 sales growth to range from up 8% to up 12% on a reported basis and up 2% to up 6% on an organic basis. Full year operating margin is expected to be between 18.8% and 19.4%, or up 40 basis points to up 100 basis points, and adjusted operating margin is expected to be between 19.1% and 19.7%, or down 50 basis points to up 10 basis points."},{"time":"16:33","ticker":"CPA","headline":"Copa Holdings beats by $0.07, reports revs in-line","body":"• Reports Q4 (Dec) earnings of $4.46 per share, excluding non-recurring items, $0.07 better than the FactSet Consensus of $4.39; revenues rose 9.6% year/year to $962.9 mln vs the $959.06 mln FactSet Consensus.Revenue per available seat mile (RASM) of 11.3 cents in 4Q25, a decrease of 0.3% compared to 4Q24.\n• Revenue per available seat mile (RASM) of 11.3 cents in 4Q25, a decrease of 0.3% compared to 4Q24.\n• On February 11, 2026, the Board of Directors of Copa Holdings approved a 2026 quarterly dividend payment of US$1.71 per share. Dividends will be distributed in March, June, September, and December. The first quarterly dividend of US$1.71 per share will be paid on March 13, 2026, to shareholders on record as of February 27, 2026."},{"time":"16:33","ticker":"AIR","headline":"AAR Corp has appointed Dylan Wolin as the Company's Chief Financial Officer, effective February 23, 2026","body":"• Wolin will rejoin AAR from Federal Signal Corporation, where he served as President of Elgin, Trackless, and Vactor, the company's primarily municipal-focused specialty vehicle businesses, from 2024 to 2026.\n• From 2017 to 2024, Wolin led AAR's strategic and corporate development, treasury, and investor relations functions. He helped lead the Company's portfolio repositioning, capital markets activities, and strategic planning, including the acquisitions of Trax and Triumph Product Support."},{"time":"16:33","ticker":"AEE","headline":"Ameren beats by $0.01, beats on revs; reaffirms FY26 EPS guidance","body":"• Reports Q4 (Dec) earnings of $0.78 per share, excluding non-recurring items, $0.01 better than the FactSet Consensus of $0.77; revenues fell 8.2% year/year to $1.78 bln vs the $1.67 bln FactSet Consensus.\n• Co reaffirms guidance for FY26, sees EPS of $5.25 to $5.45, excluding non-recurring items, vs. $5.36 FactSet Consensus."},{"time":"16:33","ticker":"CGNX","headline":"Cognex beats by $0.05, beats on revs; guides Q1 EPS above consensus, revs above consensus","body":"• Reports Q4 (Dec) earnings of $0.27 per share, excluding non-recurring items, $0.05 better than the FactSet Consensus of $0.22; revenues rose 9.9% year/year to $252.34 mln vs the $238.99 mln FactSet Consensus.\n• Co issues upside guidance for Q1, sees EPS of $0.22-0.26, excluding non-recurring items, vs. $0.19 FactSet Consensus; sees Q1 revs of $235-255 mln vs. $228.50 mln FactSet Consensus.\n• Co completed a comprehensive strategic portfolio review in Q4 and began exiting approximately $22 mln of non-core, no-growth or low-margin revenue, sharpening focus and improving mix."},{"time":"16:33","ticker":"NAVN","headline":"Navan announces the appointment of Aurlien Nolf as Chief Financial Officer, effective March 2, 2026","body":"As VP, Head of FP&A and Investor Relations at Lyft (LYFT), Nolf has played an important role in that company's ongoing transformation by improving forecasting processes, leading a series of projects that achieved sustainable profitability and free cash flow, and advancing investor targeting and marketing efforts."},{"time":"16:32","ticker":"CW","headline":"Curtiss-Wright beats by $0.10, beats on revs; guides FY26 EPS above consensus, revs above consensus","body":"• Reports Q4 (Dec) earnings of $3.79 per share, excluding non-recurring items, $0.10 better than the FactSet Consensus of $3.69; revenues rose 14.9% year/year to $946.98 mln vs the $890.31 mln FactSet Consensus.\n• Co issues upside guidance for FY26, sees EPS of $14.70-$15.15, excluding non-recurring items, vs. $14.61 FactSet Consensus; sees FY26 revs of $3.710-$3.765 bln vs. $3.69 bln FactSet Consensus."},{"time":"16:32","ticker":"CUBI","headline":"Customers Bancorp authorizes a new common stock repurchase plan, providing the Company the discretion to purchase up to $100 mln of its outstanding common stock over a one-year period","body":"s"},{"time":"16:32","ticker":"VCTR","headline":"Victory Capital reports Total Assets Under Management of $320.2 billion, Other Assets of $3.0 billion, and Total Client Assets of $323.2 billion, as of January 31, 2026","body":"For the month of January, Average Total AUM was $318.3 billion, average Other Assets was $2.9 billion, and average Total Client Assets was $321.2 billion."},{"time":"16:30","ticker":"SAFE","headline":"Safehold Reports Fourth Quarter and Fiscal Year 2025 Results","body":"\"Safehold had a productive 2025 and is well positioned for 2026,\" said Jay Sugarman, Chairman and Chief Executive Officer. \"Customer dialogue and closings have been active, our affordable housing business has good momentum, and our cost of capital has significantly improved following a third credit ratings upgrade to A-. With the addition of Michael Trachtenberg as President strengthening our leadership team, we look forward to putting our capital to work to serve our customers and create value for our shareholders.\"Click here for full release."},{"time":"16:27","ticker":"QS","headline":"QuantumScape reports EPS in-line, beats on revs","body":"• Reports Q4 (Dec) loss of $0.17 per share, excluding non-recurring items, in-line with the FactSet Consensus of ($0.17); revenues were unchanged year/year at $0 mln vs the $0 mln FactSet Consensus.\n• FY26 capex expected between $40 mln and $60 mln."},{"time":"16:25","ticker":"VKTX","headline":"Viking Therapeutics reports Q4 results; provides clinical update","body":"• Reports Q4 (Dec) loss of $(1.38) per share, $0.48 worse than the FactSet Consensus of ($0.90). Co has no revenue.\n• Co provides clinical update:Phase 3 VANQUISH Trials for Subcutaneous VK2735 in Obesity Ongoing; VANQUISH-1 Enrollment Complete, VANQUISH-2 Nearing Full Enrollment. VK2735 Maintenance Dosing Study Fully Enrolled; Data Expected 3Q26. Novel Amylin Agonist IND Filing Planned This Quarter.\n• Phase 3 VANQUISH Trials for Subcutaneous VK2735 in Obesity Ongoing; VANQUISH-1 Enrollment Complete, VANQUISH-2 Nearing Full Enrollment.\n• VK2735 Maintenance Dosing Study Fully Enrolled; Data Expected 3Q26.\n• Novel Amylin Agonist IND Filing Planned This Quarter."},{"time":"16:25","ticker":"GTY","headline":"Getty Realty Corp. beats by $0.02, beats on revs; reaffirms FY26 FFO guidance","body":"• Reports Q4 (Dec) funds from operations of $0.63 per share, excluding non-recurring items, $0.02 better than the FactSet Consensus of $0.61; revenues rose 14.2% year/year to $60.5 mln vs the $55.34 mln FactSet Consensus.\n• Co reaffirms guidance for FY26, sees FFO of $2.48-$2.50, excluding non-recurring items, vs. $2.47 FactSet Consensus."},{"time":"16:24","ticker":"PRI","headline":"Primerica beats by $0.45, beats on revs; new $475 mln share buyback program; increases dividend by 15%","body":"• Reports Q4 (Dec) earnings of $6.13 per share, excluding non-recurring items, $0.45 better than the FactSet Consensus of $5.68; revenues rose 8.3% year/year to $853.68 mln vs the $844.93 mln FactSet Consensus.\n• The Board of Directors authorized a new $475 million share repurchase program to occur through December 31, 2026.\n• In addition, the Board of Directors approved a 15% increase to our first quarter dividend, now at $1.20 per share and payable on March 13, 2026 to stockholders of record on February 23, 2026."},{"time":"16:24","ticker":"NRGV","headline":"Energy Vault sees Q4 revs above consensus","body":"• Co issues upside guidance for Q4 (Dec), sees Q4 (Dec) revs of $150-155 mln vs. $140.86 mln FactSet Consensus. Positive Q4 2025 Adjusted EBITDA expected to be between $5.0 million and $10.0 million, versus a loss of $13.4M in Q4 2024; Q4 2025 Net loss expected to be between $22.1 million and $9.5 million versus $61.8 million in Q4 2024.\n• Q4 2025 GAAP Gross Profit expected to be between $28 million and $33 million, an increase of ~3x sequentially from Q3 2025, with a Q4 2025 Gross Margin expected to be between 18% and 22%, representing a YoY improvement of ~1,000bps and ~1,400bps."},{"time":"16:22","ticker":"ALB","headline":"Albemarle will idle the remaining operating train, Train 1, at its Kemerton lithium hydroxide processing plant in Western Australia and place it into care and maintenance effective immediately","body":"• Today's announcement follows actions in 2024 to place Train 2 into care and maintenance and to cease expansion plans for Trains 3 and 4.\n• The Kemerton plant processes spodumene from the Greenbushes mine, one of the world's best spodumene resources. Albemarle holds ownership interest and half of the offtake rights from Greenbushes through an Australian joint venture. Kemerton, with its proven technology and commercial scale lithium hydroxide production, was built to enable\n• The decision is expected to be accretive to adjusted EBITDA beginning in the second quarter of 2026 with no impact to projected 2026 volumes. Albemarle will meet customer demand for lithium hydroxide through other production channels.\n• Albemarle's mining interests in Australia, including its holdings in Greenbushes and Wodgina and its exploration interests in Western Australia, are not impacted by the Kemerton decision as they remain core components of the company's strategy."},{"time":"16:22","ticker":"AM","headline":"Antero Midstream misses by $0.14, reports revs in-line; Issues FY26 guidance, including net income of $485-$535 mln","body":"• Reports Q4 (Dec) earnings of $0.11 per share, $0.14 worse than the FactSet Consensus of $0.25; revenues rose 3.3% year/year to $297 mln vs the $296.22 mln FactSet Consensus.\n• Low pressure gathering and compression volumes increased by 5% compared to the prior year quarter.\n• Adjusted EBITDA was $285 million, a 4% increase compared to the prior year quarter.\n• 2026 Guidance: AM is forecasting Net Income of $485 to $535 million. The Company is forecasting Adjusted EBITDA of $1.19 to $1.24 billion, which represents an 8% increase compared to 2025 at the midpoint. Antero Midstream expects to service 65 to 75 wells with its fresh water delivery system, with the wells having an average lateral length of approximately 13,700 feet.AM is forecasting a capital budget of $190 to $220 million. The midpoint of the 2026 capital budget includes approximately $145 million of investment in gathering and compression infrastructure for both the legacy Antero Midstream and acquired HG Midstream assets.AM is forecasting Adjusted Free Cash Flow before dividends of $755 to $815 million and Adjusted Free Cash Flow after dividends of $330 to $390 million for 2026, assuming an annualized dividend of $0.90 per share.\n• AM is forecasting a capital budget of $190 to $220 million. The midpoint of the 2026 capital budget includes approximately $145 million of investment in gathering and compression infrastructure for both the legacy Antero Midstream and acquired HG Midstream assets.\n• AM is forecasting Adjusted Free Cash Flow before dividends of $755 to $815 million and Adjusted Free Cash Flow after dividends of $330 to $390 million for 2026, assuming an annualized dividend of $0.90 per share."},{"time":"16:22","ticker":"ALB","headline":"Albemarle misses by $0.11, beats on revs","body":"• Reports Q4 (Dec) loss of $0.53 per share, excluding non-recurring items, $0.11 worse than the FactSet Consensus of ($0.42); revenues rose 15.9% year/year to $1.43 bln vs the $1.35 bln FactSet Consensus.\n• Assuming average lithium price of ~$10/kg, FY26 net sales expected between $4.1 bln and $4.3 bln.\n• Assuming average lithium price of ~$20/kg, FY26 net sales expected between $5.7 bln and $6.0 bln.\n• Assuming average lithium price of ~$30/kg, FY26 net sales expected between $7.5 bln and $7.8 bln."},{"time":"16:22","ticker":"SCI","headline":"Service Corp reports EPS in-line, revs in-line; guides FY26 EPS in-line","body":"• Reports Q4 (Dec) earnings of $1.14 per share, excluding non-recurring items, in-line with the FactSet Consensus of $1.14; revenues rose 1.7% year/year to $1.11 bln vs the $1.12 bln FactSet Consensus.\n• Co issues in-line guidance for FY26, sees EPS of $4.05-4.35, excluding non-recurring items, vs. $4.26 FactSet Consensus."},{"time":"16:22","ticker":"FE","headline":"FirstEnergy increases quarterly dividend 4.5% to $0.465/share from $0.445/share","body":""},{"time":"16:21","ticker":"GPI","headline":"Group 1 Auto increases quarterly cash dividend 10% to $0.55/share from $0.50/share","body":""},{"time":"16:21","ticker":"TYL","headline":"Tyler Tech misses by $0.08, misses on revs; guides FY26 EPS in-line, revs mostly below consensus","body":"• Reports Q4 (Dec) earnings of $2.64 per share, excluding non-recurring items, $0.08 worse than the FactSet Consensus of $2.72; revenues rose 6.3% year/year to $575.2 mln vs the $590.99 mln FactSet Consensus.\n• Co issues in-line guidance for FY26, sees EPS of $12.40-12.65, excluding non-recurring items, vs. $12.56 FactSet Consensus; sees FY26 revs of $2.50-2.55 bln vs. $2.56 bln FactSet Consensus.Subscription revenues are expected to grow between 12% and 15%. Within subscriptions: SaaS revenues are expected to grow between 20.5% and 22.5%. Transaction revenues are expected to grow between 5% and 7% (between 10% and 12% excluding the impact of the termination of the Texas payments contract). Maintenance revenues are expected to decline between 5% and 7%.Professional services revenues are expected to grow between 3% and 5%.Software licenses and royalties are expected to grow between 15% and 17%.Hardware and other revenues are expected to decline between 17% and 19%.\n• Subscription revenues are expected to grow between 12% and 15%. Within subscriptions: SaaS revenues are expected to grow between 20.5% and 22.5%. Transaction revenues are expected to grow between 5% and 7% (between 10% and 12% excluding the impact of the termination of the Texas payments contract).\n• SaaS revenues are expected to grow between 20.5% and 22.5%.\n• Transaction revenues are expected to grow between 5% and 7% (between 10% and 12% excluding the impact of the termination of the Texas payments contract).\n• Maintenance revenues are expected to decline between 5% and 7%.\n• Professional services revenues are expected to grow between 3% and 5%.\n• Software licenses and royalties are expected to grow between 15% and 17%.\n• Hardware and other revenues are expected to decline between 17% and 19%."},{"time":"16:21","ticker":"RNR","headline":"RenaissanceRe increases quarterly dividend to $0.41/share from $0.40/share; renews repurchase","body":"• In addition, the Board of Directors approved a renewal of RenaissanceRe's authorized share repurchase program, bringing the total current authorization up to $750.0 million, which includes the remaining amounts under prior authorizations."},{"time":"16:20","ticker":"FAF","headline":"First American Financial beats by $0.61, beats on revs","body":"• Reports Q4 (Dec) earnings of $1.99 per share, excluding non-recurring items, $0.61 better than the FactSet Consensus of $1.38; revenues rose 21.6% year/year to $2.05 bln vs the $1.8 bln FactSet Consensus."},{"time":"16:20","ticker":"AR","headline":"Antero Resources beats by $0.12, beats on revs; Issues FY26 guidance, including drilling and completion capital budget of $1 bln","body":"• Reports Q4 (Dec) earnings of $0.62 per share, $0.12 better than the FactSet Consensus of $0.50; revenues rose 20.8% year/year to $1.41 bln vs the $1.31 bln FactSet Consensus.\n• Net production averaged 3.5 Bcfe/d, 2% increase from the year ago period.\n• Adjusted EBITDAX was $422 million; net cash provided by operating activities was $371 million.\n• 2026 Guidance: AR's 2026 drilling and completion capital budget is $1 billion and includes $900 million for maintenance capital and $100 million of capital related to not electing to enter into a drilling joint venture during the year. Discretionary growth capital up to $200 million will be based on the commodity price outlook and in basin demand needs throughout the year. First quarter 2026 production is expected to average approximately 3.8 Bcfe/d, with the second quarter increasing to 4.1 Bcfe/d driven by a full quarter of HG contribution. The second half of 2026 is expected to average approximately 4.2 Bcfe/d. This results in a full year average of approximately 4.1 Bcfe/d.\n• First quarter 2026 production is expected to average approximately 3.8 Bcfe/d, with the second quarter increasing to 4.1 Bcfe/d driven by a full quarter of HG contribution.\n• The second half of 2026 is expected to average approximately 4.2 Bcfe/d. This results in a full year average of approximately 4.1 Bcfe/d."},{"time":"16:20","ticker":"CBU","headline":"Community Financial System announces the appointment of Brenda M. Hall to its Board of Directors as a new independent director, effective as of March 1, 2026","body":"Ms. Hall is the former Executive Vice President and Chief Operating Officer of Standard Lines at Selective Insurance Group, Inc. (SIGI), where she built a distinguished 24-year career marked by progressive advancement and increasing leadership responsibilities."},{"time":"16:19","ticker":"CRK","headline":"Comstock beats by $0.04, beats on revs","body":"• Reports Q4 (Dec) earnings of $0.16 per share, excluding non-recurring items, $0.04 better than the FactSet Consensus of $0.12; revenues rose 115.5% year/year to $789.81 mln vs the $505.91 mln FactSet Consensus.\n• 2026 Budget:In response to improved natural gas prices, the Company currently plans to increase the number of operating drilling rigs it is running from eight to nine during 2026. Four of the rigs will be devoted to the Western Haynesville to continue to delineate the new play. As a result, Comstock plans to spend approximately $1.4 billion to $1.5 billion in 2026 on its development and exploration projects and $100 million to $150 million on its Western Haynesville midstream system.\n• In response to improved natural gas prices, the Company currently plans to increase the number of operating drilling rigs it is running from eight to nine during 2026. Four of the rigs will be devoted to the Western Haynesville to continue to delineate the new play. As a result, Comstock plans to spend approximately $1.4 billion to $1.5 billion in 2026 on its development and exploration projects and $100 million to $150 million on its Western Haynesville midstream system."},{"time":"16:19","ticker":"GLPI","headline":"Gaming and Leisure Properties announces that it acquired the real estate assets of Bally's Lincoln in Lincoln, Rhode Island, from Bally's Corporation (BALY) for $700.0 million","body":"• The initial cash rent of $56.0 million represents an 8.0% capitalization rate and equates to a purchase multiple of 12.5x. Bally's Lincoln will be added to the GLPI Bally's Master Lease II agreement, increasing the number of properties to five, and the pro forma rent coverage ratio is expected to be over 2.2x. On a four-wall basis, rent coverage for Bally's Lincoln is over 1.9x. The initial lease term is consistent with Bally's Master Lease II, which extends to 2039, and includes four 5-year renewal options. Lease rent escalation is indexed to the consumer price index (\"CPI\") with a 1.0% floor and a 2.0% ceiling, subject to CPI meeting a 0.5% threshold.\n• The transaction is primarily funded through debt and is expected to be immediately accretive to GLPI's adjusted funds from operation (\"AFFO\") per share. Upon closing, GLPI's net debt to adjusted EBITDA ratio is expected to remain below the low end of the target range of 5.0x to 5.5x, with incremental pipeline funding expected to take leverage into the low end of the target range."},{"time":"16:19","ticker":"MSI","headline":"Motorola Solutions beats by $0.24, beats on revs; guides Q1 EPS in-line, revs below consensus; guides FY26 EPS above consensus, revs above consensus","body":"• Reports Q4 (Dec) earnings of $4.59 per share, excluding non-recurring items, $0.24 better than the FactSet Consensus of $4.35; revenues rose 12.3% year/year to $3.38 bln vs the $3.34 bln FactSet Consensus.\n• Co issues guidance for Q1, sees EPS of $3.20-3.25, excluding non-recurring items, vs. $3.23 FactSet Consensus; sees Q1 revs of +6-7% yr/yr to $2.68-2.71 bln vs. $2.75 bln FactSet Consensus.\n• Co issues raised guidance for FY26, sees EPS of $16.70-16.85 vs. $16.26 FactSet Consensus; sees FY26 revs of $12.7 bln vs. $12.6 bln FactSet Consensus.\n• Operating margin - GAAP operating margin was 27.9% of sales, up from 27.0% in the year-ago quarter and non-GAAP operating margin was 32.1% of sales, up from 30.4% in the year-ago quarter. The increase in both GAAP and non-GAAP operating margin was driven by higher sales, favorable mix and improving operating leverage, partially offset by higher tariffs."},{"time":"16:19","ticker":"AUR","headline":"Aurora Innovation announces that it is tripling its driverless network with the launch of its latest software release, which also provides the Aurora Driver with the capabilities to begin expanding across the Southern United States and serve customer endpoints in 2026","body":""},{"time":"16:17","ticker":"TPG","headline":"TPG Inc. and Jackson Financial (JXN) launch long-term strategic partnership; TPG has made a $500 mln minority investment in Jackson","body":"• Under the agreement, which was first announced by TPG and Jackson on January 6, 2026, TPG will manage a minimum commitment of $12 billion of AUM for Jackson, with economic incentives aligned to a long-term target of $20 billion. The non-exclusive investment management arrangement, with a 10-year initial term and automatic 1-year renewals through year 15, is initially focused on Investment Grade Asset Based Finance (ABF) and Direct Lending, further accelerating TPG's credit origination momentum.\n• As part of the transaction, TPG has made a $500 million minority investment in Jackson, acquiring 4,715,554 shares of Jackson's common stock, which represents an approximate 6.5% common equity stake in Jackson Financial Inc. Additionally, TPG issued to a wholly owned, indirect subsidiary of Jackson 2,279,109 shares of TPG Class A common stock."},{"time":"16:17","ticker":"LEG","headline":"Leggett &amp; Platt misses by $0.01, reports revs in-line; guides FY26 EPS in-line, revs in-line","body":"• Reports Q4 (Dec) earnings of $0.22 per share, excluding non-recurring items, $0.01 worse than the FactSet Consensus of $0.23; revenues fell 11.2% year/year to $938.6 mln vs the $938.74 mln FactSet Consensus.\n• Co issues in-line guidance for FY26, sees EPS of $1.00-1.20, excluding non-recurring items, vs. $1.09 FactSet Consensus; sees FY26 revs of $3.8-4.0 bln vs. $3.9 bln FactSet Consensus.Volume is expected to be flat to down low-single digits. 2026 EBIT margin is expected to be 5.9%--7.8%; adjusted EBIT margin is expected to be 6.3%--7.0%.\n• Volume is expected to be flat to down low-single digits.\n• 2026 EBIT margin is expected to be 5.9%--7.8%; adjusted EBIT margin is expected to be 6.3%--7.0%."},{"time":"16:16","ticker":"NRGV","headline":"Energy Vault intends to offer, subject to market conditions and other factors, $125.0 mln aggregate principal amount of convertible senior notes due 2031 in a private placement","body":"• The Notes will be senior unsecured obligations of the Company. The Notes are expected to pay interest semiannually and will mature on March 1, 2031, unless earlier converted, redeemed or repurchased in accordance with their terms. Conversion of the Notes will be settled in cash, shares of the Company's common stock, or a combination thereof, at the Company's election.\n• The Company expects to use the net proceeds from the offering to fund the cost of entering into the capped call transactions described below, redeem $35.0 million to $45.0 million in aggregate principal amount of the senior unsecured convertible debentures issued to YA II PN, Ltd., and the remainder for general corporate purposes, which may include, among other things, the repayment of additional indebtedness and funding growth initiatives. If the initial purchasers exercise their option to purchase additional Notes, the Company expects to use the net proceeds from the sale of the additional Notes to enter into additional capped call transactions with the option counterparties and the remainder for general corporate purposes."},{"time":"16:16","ticker":"CXW","headline":"CoreCivic beats by $0.07, beats on revs; guides FY26 FFO above two analyst estimate","body":"• Reports Q4 (Dec) funds from operations of $0.52 per share, excluding non-recurring items, $0.07 better than the FactSet Consensus of $0.45; revenues rose 26.0% year/year to $604 mln vs the $577.8 mln FactSet Consensus.\n• Co issues upside guidance for FY26, sees FFO of $2.54-$2.64, excluding non-recurring items, vs. $2.51 two analyst estimate. Sees EBITDA of $437-$445 mln."},{"time":"16:15","ticker":"EQH","headline":"Equitable Holdings announces additional $1 billion share repurchase authorization","body":""},{"time":"16:14","ticker":"EQIX","headline":"Equinix increases quarterly cash dividend to $5.16/share from $4.69/share","body":""},{"time":"16:14","ticker":"STAG","headline":"STAG Industrial beats by $0.02, beats on revs","body":"• Reports Q4 (Dec) funds from operations of $0.66 per share, $0.02 better than the FactSet Consensus of $0.64; revenues rose 10.8% year/year to $220.9 mln vs the $212.93 mln FactSet Consensus."},{"time":"16:14","ticker":"WCN","headline":"Waste Connections beats by $0.01, reports revs in-line; guides FY26 revs below consensus","body":"• Reports Q4 (Dec) earnings of $1.29 per share, excluding non-recurring items, $0.01 better than the FactSet Consensus of $1.28; revenues rose 5.0% year/year to $2.37 bln vs the $2.37 bln FactSet Consensus.\n• Co issues downside guidance for FY26, sees FY26 revs of $9.90 bln to $9.95 bln vs. $9.97 bln FactSet Consensus.FY26 adjusted FCF expected between $1.40 bln and $1.45 bln.\n• FY26 adjusted FCF expected between $1.40 bln and $1.45 bln."},{"time":"16:14","ticker":"MH","headline":"McGraw Hill beats by $0.18, beats on revs; guides FY26 revs above consensus","body":"• Reports Q4 (Dec) earnings of $0.28 per share, excluding non-recurring items, $0.18 better than the FactSet Consensus of $0.10; revenues rose 4.2% year/year to $434.2 mln vs the $410.78 mln FactSet Consensus.\n• Digital revenue of $363.7 million, an increase of 11.0% year-over-year.\n• Remaining performance obligation (RPO) of $1,696.8 million as of December 31, 2025 demonstrates predictability and visibility into future revenue.\n• Co issues upside guidance for FY26, sees FY26 revs of $2.067-$2.087 bln vs. $2.05 bln FactSet Consensus."},{"time":"16:13","ticker":"ROL","headline":"Rollins misses by $0.02, misses on revs","body":"• Reports Q4 (Dec) earnings of $0.24 per share, $0.02 worse than the FactSet Consensus of $0.26; revenues rose 9.7% year/year to $912.9 mln vs the $926.76 mln FactSet Consensus.Adjusted EPS was $0.25\n• Adjusted EPS was $0.25\n• For 2026, the Company anticipates: The underlying health of core pest control markets, as well as Rollins' ongoing commitment to operational execution, should support another year of organic growth, further complemented by a strategic and disciplined approach to acquisitions. A focus on pricing, ongoing modernization efforts, and a culture of continuous improvement should support an improving margin profile. Compounding cash flow and strong balance sheet should continue to enable a balanced capital allocation strategy.\n• The underlying health of core pest control markets, as well as Rollins' ongoing commitment to operational execution, should support another year of organic growth, further complemented by a strategic and disciplined approach to acquisitions.\n• A focus on pricing, ongoing modernization efforts, and a culture of continuous improvement should support an improving margin profile.\n• Compounding cash flow and strong balance sheet should continue to enable a balanced capital allocation strategy."},{"time":"16:13","ticker":"EMBC","headline":"Embecta Corp. announces that the Board of Directors of embecta has elected Devdatt Kurdikar as Chairman of the Board and Dr. Claire Pomeroy as Lead Independent Director, effective immedia","body":"These changes follow the previously announced retirement of LTG (Ret.) David F. Melcher, Non-Executive Chairman of the Board due to several commitments outside of his service to the Company."},{"time":"16:12","ticker":"CXT","headline":"Crane NXT beats by $0.01, beats on revs; guides FY26 EPS below consensus, revs in-line; increases dividend","body":"• Reports Q4 (Dec) earnings of $1.27 per share, excluding non-recurring items, $0.01 better than the FactSet Consensus of $1.26; revenues rose 19.5% year/year to $476.9 mln vs the $450.64 mln FactSet Consensus.\n• Co issues guidance for FY26, sees EPS of $4.10-4.40, excluding non-recurring items, vs. $4.50 FactSet Consensus; sees FY26 revenue growth of 4-6%, which computes as of $1.72-1.76 bln vs. $1.74 bln FactSet Consensus.\n• Co remains on track to complete Antares Vision acquisition in 2026.\n• Co announced its quarterly dividend of $0.18 per share, an increase of 6% over the prior year, for the first quarter of 2026. The dividend is payable on March 11, 2026 to shareholders of record as of February 28, 2026."},{"time":"16:12","ticker":"CSCO","headline":"Cisco beats by $0.02, beats on revs; guides Q3 EPS in-line, revs above consensus; raises FY26 guidance; raises dividend 2% to $0.42/share","body":"• Reports Q2 (Jan) earnings of $1.04 per share, excluding non-recurring items, $0.02 better than the FactSet Consensus of $1.02; revenues rose 9.7% year/year to $15.35 bln vs the $15.11 bln FactSet Consensus.\n• Non-GAAP operating income was $5.3 billion, up 9%, with non-GAAP operating margin at 34.6% (Cisco guided to Q2 non-GAAP operating margin of 33.5-34.5%).\n• Co issues guidance for Q3, sees EPS of $1.02-1.04, excluding non-recurring items, vs. $1.03 FactSet Consensus; sees Q3 revs of $15.4-15.6 bln vs. $15.19 bln FactSet Consensus.\n• Co issues raised guidance for FY26, sees EPS of $4.13-4.17 from $4.08-4.14, excluding non-recurring items, vs. $4.13 FactSet Consensus; sees FY26 revs of $61.2-61.7 bln from $60.2-61.0 bln vs. $60.76 bln FactSet Consensus.\n• Cisco has declared a quarterly dividend of $0.42 per common share, a 1-cent increase or up 2% over the previous quarter's dividend, to be paid on April 22, 2026, to all stockholders of record as of the close of business on April 2, 2026. Future dividends will be subject to Board approval.\n• \"Cisco's strong second quarter and first half of fiscal 2026 demonstrate both the power of our portfolio and the fundamental role we continue to play in connecting and protecting customers in a rapidly evolving landscape,\" said Chuck Robbins, chair and CEO of Cisco. \"With over 40 years of customer trust, global scale, and a relentless focus on innovation, we believe Cisco is uniquely positioned to deliver the trusted infrastructure needed to securely and confidently power the AI-era.\"\n• \"In Q2, we delivered double-digit growth on both the top and bottom lines which exceeded the high end of our guidance and puts us on track to deliver our strongest revenue year yet in fiscal 2026,\" said Mark Patterson, CFO of Cisco. \"Operating margin was also above the high end of guidance, as we continue to drive profitability by exercising financial discipline. We see strong, broad-based demand for our technology solutions and remain focused on capturing the significant opportunities we see ahead.\""},{"time":"16:12","ticker":"GDYN","headline":"Grid Dynamics accelerates AI transformation momentum","body":"Grid Dynamics Holdings, Inc. (Nasdaq: GDYN) (\"Grid Dynamics\"), a premier AI transformation partner for the Fortune 1000, today announced it has achieved Preferred Vendor status with one of the major hyperscale cloud providers. This milestone follows a strategic, exhaustive two-year vendor consolidation initiative by the hyperscaler that reduced its service provider ecosystem to a small group. This designation establishes the contractual framework for Grid Dynamics to significantly increase business with this hyperscaler, boosting Grid Dynamics' joint solution development, co-selling, and go-to-market opportunities.Click here for full release."},{"time":"16:11","ticker":"QDEL","headline":"QuidelOrtho beats by $0.04, beats on revs; guides FY26 EPS below consensus, revs in-line; CFO to retire","body":"• Reports Q4 (Dec) earnings of $0.46 per share, excluding non-recurring items, $0.04 better than the FactSet Consensus of $0.42; revenues rose 2.2% year/year to $723.6 mln vs the $700.73 mln FactSet Consensus.\n• Co issues guidance for FY26, sees EPS of $2.00-2.42, excluding non-recurring items, vs. $2.45 FactSet Consensus; sees FY26 revs of $2.7-2.9 bln vs. $2.77 bln FactSet Consensus.Adjusted EBITDA $630-670 mln.\n• Adjusted EBITDA $630-670 mln.\n• The Company announced that Joseph M. Busky, Chief Financial Officer, has decided to retire, effective June 30, 2026. The Company has begun a search to identify a successor. Mr. Busky will serve in an advisory role following his retirement to facilitate a smooth transition."},{"time":"16:11","ticker":"FSLY","headline":"Fastly beats by $0.06, beats on revs; guides Q1 EPS above consensus, revs above consensus; guides FY26 EPS above consensus, revs above consensus","body":"• Reports Q4 (Dec) earnings of $0.12 per share, excluding non-recurring items, $0.06 better than the FactSet Consensus of $0.06; revenues rose 22.8% year/year to $172.61 mln vs the $161.36 mln FactSet Consensus.\n• Co issues upside guidance for Q1, sees EPS of $0.07 to $0.10, excluding non-recurring items, vs. $0.01 FactSet Consensus; sees Q1 revs of $168.0 mln to $174.0 mln vs. $159.62 mln FactSet Consensus.\n• Co issues upside guidance for FY26, sees EPS of $0.23 to $0.29, excluding non-recurring items, vs. $0.13 FactSet Consensus; sees FY26 revs of $700.0 mln to $720.0 mln, excluding non-recurring items, vs. $667.79 mln FactSet Consensus."},{"time":"16:09","ticker":"FCPT","headline":"Four Corners Property Trust beats by $0.01, reports revs in-line","body":"• Reports Q4 (Dec) funds from operations of $0.45 per share, excluding non-recurring items, $0.01 better than the FactSet Consensus of $0.44; revenues rose 10.7% year/year to $75.67 mln vs the $75.85 mln FactSet Consensus.\n• \"FCPT delivered another strong year in 2025, achieved by raising capital efficiently and by deploying that capital into a series of high value new investments. We invested a near record $318 million across 105 properties located in strong retail corridors and leased to a set of nationally branded operators. We achieved these results while never wavering from our commitment to using an insights driven scoring system and to maintaining a steadfast set of pricing objectives,\" said CEO Bill Lenehan. \"We funded acquisitions primarily through equity issued at accretive pricing which lowers our leverage profile and provides us with an over-equitized capital position and significant leverage capacity entering 2026. We believe that we are in a very strong position to continue progress toward our growth objectives.\""},{"time":"16:08","ticker":"PCVX","headline":"Vaxcyte announces that the first participants were dosed in the OPUS-3 Phase 3 trial evaluating VAX-31, the Company's next-generation 31-valent pneumococcal conjugate vaccine candidate, in adults who have previously received pneumococcal vaccination","body":"• Company Expects to Report Topline Data from OPUS-3 Trial and OPUS-2 Phase 3 Trial Evaluating Concomitant Administration of VAX-31 and a Seasonal Influenza Vaccine in First Half of 2027\n• OPUS-1, VAX-31 Adult Phase 3 Noninferiority Trial, Continues to Enroll Subjects, with Topline Data Expected in Fourth Quarter of 2026\n• Vaxcyte's VAX-31 Phase 3 Adult Clinical Program -- Finalized in Consultation and Alignment with U.S. Food and Drug Administration -- to Support Planned BLA Submission\n• VAX-31 is Designed to Cover ~95% of Invasive Pneumococcal Disease (IPD) and ~88% of Pneumococcal Pneumonia in U.S. Adults Aged 50+, with Potential to Provide an Incremental 14-34% Broader IPD Coverage and 19-31% Broader Pneumonia Coverage than Standard-of-Care Vaccines"},{"time":"16:08","ticker":"MCD","headline":"McDonald's beats by $0.07, beats on revs; global comps +5.7%; US comps +6.8%","body":"• Reports Q4 (Dec) earnings of $3.12 per share, excluding non-recurring items, $0.07 better than the FactSet Consensus of $3.05; revenues rose 9.7% year/year to $7.01 bln vs the $6.84 bln FactSet Consensus.Global comparable sales increased +5.7%: US Q4 comps increased +6.8%; Comps were driven by positive check and guest count growth primarily from successful marketing promotions.International Operated Markets Q4 comps increased +5.2%; Nearly all markets reflected positive comparable sales, led by the U.K., Germany and Australia.International Developmental Licensed Markets Q4 comps increased +4.5%; Positive comparable sales were led by Japan, with all geographic regions reflecting positive comparable sales.\n• Global comparable sales increased +5.7%: US Q4 comps increased +6.8%; Comps were driven by positive check and guest count growth primarily from successful marketing promotions.International Operated Markets Q4 comps increased +5.2%; Nearly all markets reflected positive comparable sales, led by the U.K., Germany and Australia.International Developmental Licensed Markets Q4 comps increased +4.5%; Positive comparable sales were led by Japan, with all geographic regions reflecting positive comparable sales.\n• US Q4 comps increased +6.8%; Comps were driven by positive check and guest count growth primarily from successful marketing promotions.\n• International Operated Markets Q4 comps increased +5.2%; Nearly all markets reflected positive comparable sales, led by the U.K., Germany and Australia.\n• International Developmental Licensed Markets Q4 comps increased +4.5%; Positive comparable sales were led by Japan, with all geographic regions reflecting positive comparable sales.\n• \"By listening to customers and taking action, we have improved traffic and strengthened our value & affordability scores. That focus helped increase global systemwide sales by 8% and delivered strong comp sales growth across all segments this quarter. The momentum we've built reinforces the progress we've made with our strategy and has earned us the right to look forward together as a system.\""},{"time":"16:08","ticker":"HUBS","headline":"HubSpot beats by $0.10, beats on revs; guides Q1 EPS above consensus, revs above consensus; guides FY26 EPS above consensus, revs above consensus; authorizes new $1 bln share repurchase program","body":"• Reports Q4 (Dec) earnings of $3.09 per share, excluding non-recurring items, $0.10 better than the FactSet Consensus of $2.99; revenues rose 20.4% year/year to $846.75 mln vs the $830.91 mln FactSet Consensus.\n• Co issues upside guidance for Q1, sees EPS of $2.46-2.48, excluding non-recurring items, vs. $2.34 FactSet Consensus; sees Q1 revs of $862-863 mln vs. $838.69 mln FactSet Consensus.\n• Co issues upside guidance for FY26, sees EPS of $12.38-12.46, excluding non-recurring items, vs. $11.52 FactSet Consensus; sees FY26 revs of $3.69-3.70 bln vs. $3.61 bln FactSet Consensus.\n• On February 7, 2026, the company's Board of Directors authorized a share repurchase program for the repurchase of shares of the company's common stock, in an aggregate amount of up to $1.0 billion"},{"time":"16:07","ticker":"EQIX","headline":"Equinix misses by $0.14, misses on revs; guides Q1 revs above consensus; guides FY26 FFO above consensus, revs above consensus","body":"• Reports Q4 (Dec) funds from operations of $8.91 per share, excluding non-recurring items, $0.14 worse than the FactSet Consensus of $9.05; revenues rose 7.0% year/year to $2.42 bln vs the $2.46 bln FactSet Consensus.\n• Co issues upside guidance for Q1, sees Q1 revs of $2.496-$2.536 bln vs. $2.47 bln FactSet Consensus.\n• Co issues upside guidance for FY26, sees FFO of $41.93-$42.74, excluding non-recurring items, vs. $40.78 FactSet Consensus; sees FY26 revs of $10.123-$10.223 bln vs. $10.07 bln FactSet Consensus."},{"time":"16:07","ticker":"AB","headline":"AllianceBernstein announces that preliminary assets under management increased to $875 billion during January 2026 from $867 billion at the end of December 2025","body":"The 1% month-over-month increase was primarily driven by market appreciation, partially offset by net outflows concentrated in the Retail and Institutional channels, with Private Wealth also experiencing slight outflows."},{"time":"16:07","ticker":"APP","headline":"AppLovin beats by $0.29, beats on revs; guides Q1 revs above consensus","body":"• Reports Q4 (Dec) earnings of $3.24 per share, $0.29 better than the FactSet Consensus of $2.95; revenues rose 66.0% year/year to $1.66 bln vs the $1.61 bln FactSet Consensus.\n• Co issues upside guidance for Q1, sees Q1 revs of $1.745-$1.775 bln vs. $1.7 bln FactSet Consensus. Sees adjusted EBITDA of $1.465-$1.495 bln."},{"time":"16:07","ticker":"PAYC","headline":"Paycom Software reports EPS in-line, revs in-line; guides FY26 revs below consensus","body":"• Reports Q4 (Dec) earnings of $2.45 per share, excluding non-recurring items, in-line with the FactSet Consensus of $2.45; revenues rose 10.2% year/year to $544.3 mln vs the $543.03 mln FactSet Consensus.\n• Co issues downside guidance for FY26, sees FY26 revs of $2.175-2.195 bln vs. $2.23 bln FactSet Consensus.Adjusted EBITDA in the range of $950 million to $970 million, representing a margin of approximately 44% at the midpoint.\n• Adjusted EBITDA in the range of $950 million to $970 million, representing a margin of approximately 44% at the midpoint."},{"time":"16:06","ticker":"INSP","headline":"Inspire Medical Systems beats by $0.97, beats on revs; guides FY26 EPS above consensus, revs in-line","body":"• Reports Q4 (Dec) earnings of $1.65 per share, excluding non-recurring items, $0.97 better than the FactSet Consensus of $0.68; revenues rose 12.2% year/year to $269.08 mln vs the $265.34 mln FactSet Consensus.\n• Co issues guidance for FY26, sees EPS of $1.85 to $2.35, excluding non-recurring items, vs. $1.76 FactSet Consensus; sees FY26 revs of $950 mln to $1.0 bln from $1.003 bln to $1.013 bln vs. $1.01 bln FactSet Consensus."},{"time":"16:05","ticker":"NTST","headline":"NETSTREIT has commenced a public offering of 8,750,000 shares of its common stock in connection with the forward sale agreements","body":""},{"time":"16:05","ticker":"CFLT","headline":"Confluent beats by $0.02, beats on revs","body":"• Reports Q4 (Dec) earnings of $0.12 per share, excluding non-recurring items, $0.02 better than the FactSet Consensus of $0.10; revenues rose 20.5% year/year to $314.82 mln vs the $308.06 mln FactSet Consensus.\n• In light of the pending transaction with IBM, Confluent will not be holding a conference call to discuss fourth quarter 2025 financial results or providing financial guidance."},{"time":"16:04","ticker":"NBIX","headline":"Neurocrine Biosciences reports Q4 (Dec) results, beats on revs","body":"• Reports Q4 (Dec) earnings of $1.88 per share, may not be comparable to the FactSet Consensus of $1.80; revenues rose 28.3% year/year to $805.5 mln vs the $790.5 mln FactSet Consensus.GAAP EPS was $1.48 vs $1.00 in the yr-ago period\n• GAAP EPS was $1.48 vs $1.00 in the yr-ago period\n• Expects FY26 INGREZZA net product sales between $2.7-2.8 bln"},{"time":"16:03","ticker":"AMCX","headline":"AMC Networks beats by $0.07, beats on revs","body":"• Reports Q4 (Dec) earnings of $0.64 per share, excluding non-recurring items, $0.07 better than the FactSet Consensus of $0.57; revenues fell 0.8% year/year to $594.8 mln vs the $581.61 mln FactSet Consensus.\n• AMC Networks Chief Executive Officer Kristin Dolan said: \"AMC Networks had a successful 2025. Streaming is now the largest single source of revenue in our domestic segment, a significant milestone and inflection point in the ongoing transformation of our business. We delivered free cash flow(1) well ahead of our previously increased forecast and once again achieved our financial guidance for the year. We look forward to continuing to take advantage of our independence and unique strengths as we drive the company forward during a time of change in our industry.\""},{"time":"16:03","ticker":"ASND","headline":"Ascendis Pharma reports fourth quarter results; positioned to generate approximately 500 million in operating cash flow in 2026","body":"COPENHAGEN, Denmark, Feb. 11, 2026 (GLOBE NEWSWIRE) -- Ascendis Pharma A/S (Nasdaq: ASND) today announced financial results for the fourth quarter and full year ended December 31, 2025, and provided a business update.Click here for full release."}],"fetchedAt":1770887105121},"savedAt":1770887105122}