{"data":{"updated":"2/12/2026, 5:10:30 AM","entries":[{"time":"04:59","ticker":"BUD","headline":"Anheuser-Busch InBev beats by $0.07, reports revs in-line","body":"• Reports Q4 (Dec) earnings of $0.95 per share, $0.07 better than the FactSet Consensus of $0.88; revenues rose 6.2% year/year to $15.55 bln vs the $15.59 bln FactSet Consensus.\n• 2026 OutlookOverall Performance: Co expects EBITDA to grow in line with our medium-term outlook of between 4-8%. The outlook for FY26 reflects current assessment of inflation and other macroeconomic conditions.Net Finance Costs: Net pension interest expenses and accretion expenses are expected to be in the range of $190 to 220 million per quarter, depending on currency and interest rate fluctuations. Co expects the average gross debt coupon in FY26 to be approximately 4%.Net Capital Expenditure: Co expects net capital expenditure of between $3.5 and 4.0 billion in FY26.\n• Overall Performance: Co expects EBITDA to grow in line with our medium-term outlook of between 4-8%. The outlook for FY26 reflects current assessment of inflation and other macroeconomic conditions.\n• Net Finance Costs: Net pension interest expenses and accretion expenses are expected to be in the range of $190 to 220 million per quarter, depending on currency and interest rate fluctuations. Co expects the average gross debt coupon in FY26 to be approximately 4%.\n• Net Capital Expenditure: Co expects net capital expenditure of between $3.5 and 4.0 billion in FY26."},{"time":"04:51","ticker":"WRD","headline":"WeRide and Uber (UBER) launch first downtown commercial robotaxi service in Abu Dhabi","body":"• WeRide (WRD) and Uber Technologies (UBER) began the first commercial robotaxi operations in downtown Abu Dhabi, expanding coverage to ~70% of the city's core areas.Service now operates across Khalifa City, Masdar City, Rabdan, and routes between Corniche Road and the Sheikh Zayed Grand Mosque, endorsed by the Integrated Transport Centre.Riders can access WeRide's Robotaxi GXR via UberX, Uber Comfort, or a dedicated \"Autonomous\" option; vehicles currently include an onboard safety specialist.Fleet has quadrupled since December 2024 launch, with over 200 robotaxis in the Middle East and a target to deploy at least 1,200 units across Abu Dhabi, Dubai, and Riyadh as soon as 2027.\n• Service now operates across Khalifa City, Masdar City, Rabdan, and routes between Corniche Road and the Sheikh Zayed Grand Mosque, endorsed by the Integrated Transport Centre.\n• Riders can access WeRide's Robotaxi GXR via UberX, Uber Comfort, or a dedicated \"Autonomous\" option; vehicles currently include an onboard safety specialist.\n• Fleet has quadrupled since December 2024 launch, with over 200 robotaxis in the Middle East and a target to deploy at least 1,200 units across Abu Dhabi, Dubai, and Riyadh as soon as 2027."},{"time":"04:46","ticker":"NRGV","headline":"Energy Vault upsizes and prices offering of $140.0 mln of 5.250% convertible senior notes due 2031","body":"• The offering was upsized from the previously announced offering size of $125.0 million aggregate principal amount of Notes."},{"time":"04:44","ticker":"NKTR","headline":"Nektar Therapeutics prices offering $400 mln offering consisting of common stock and warrants","body":"• Co priced an upsized $400 mln underwritten public offering of common stock and pre-funded warrants.Co is selling 6,603,449 shares at $58.00 per share and 293,103 pre-funded warrants at $57.9999, with a $0.0001 exercise price.Gross proceeds are expected to total approximately $400 mln before underwriting discounts and expenses.\n• Co is selling 6,603,449 shares at $58.00 per share and 293,103 pre-funded warrants at $57.9999, with a $0.0001 exercise price.\n• Gross proceeds are expected to total approximately $400 mln before underwriting discounts and expenses."},{"time":"04:42","ticker":"NTST","headline":"NETSTREIT prices 10.98 mln shares of common stock at $19.00 per share","body":""},{"time":"04:39","ticker":"AMAT","headline":"Applied Materials settles export probe with Commerce for $252.5 mln; DOJ, SEC close reviews","body":"• Applied Materials reached a civil settlement with the U.S. Department of Commerce's Bureau of Industry and Security, agreeing to pay $252.5 mln to resolve export regulation allegations tied to China shipments between Nov. 2020 and July 2022.The matter stemmed from a misunderstanding of the applicability of certain U.S. Export Administration Regulations.The U.S. Department of Justice and the Securities and Exchange Commission have closed related investigations without taking action.With the settlement, the U.S. government's review is concluded, removing a regulatory overhang as Applied focuses on semiconductor demand and its technology roadmap.\n• The matter stemmed from a misunderstanding of the applicability of certain U.S. Export Administration Regulations.\n• The U.S. Department of Justice and the Securities and Exchange Commission have closed related investigations without taking action.\n• With the settlement, the U.S. government's review is concluded, removing a regulatory overhang as Applied focuses on semiconductor demand and its technology roadmap."},{"time":"04:35","ticker":"NWE","headline":"NorthWestern misses by $0.02, reports revs in-line; guides FY26 EPS in-line; raises dividend","body":"• Reports Q4 (Dec) earnings of $1.17 per share, excluding non-recurring items, $0.02 worse than the FactSet Consensus of $1.19; revenues rose 10.9% year/year to $414.3 mln vs the $414.26 mln FactSet Consensus.\n• Co issues in-line guidance for FY26, sees EPS of $3.68-3.83, excluding non-recurring items, vs. $3.83 FactSet Consensus.Co is affirming long-term diluted earnings per share growth guidance of 4% to 6%, based on 2024 adjusted diluted non-GAAP EPS baseline of $3.40.\n• Co is affirming long-term diluted earnings per share growth guidance of 4% to 6%, based on 2024 adjusted diluted non-GAAP EPS baseline of $3.40.\n• Additionally, is announcing a $3.2 billion capital investment plan for 2026-2030, which is expected to support rate base growth of 4% to 6% from our 2024 base year of approximately $5.4 billion. Co anticipates funding capital expenditures through cash flows from operations, available credit sources, debt issuances, and future rate increases. In order to fund South Dakota generation investment, equity issuances are expected beginning in 2027.\n• Dividend DeclaredNorthWestern Energy Group's Board of Directors has declared a quarterly common stock dividend of $0.67 per share, representing a 1.5% increase over the previous quarter's dividend. The dividend is payable on March 31, 2026, to shareholders of record as of March 13, 2026.Looking ahead, co remains committed to maintaining a dividend payout ratio within our targeted range of 60-70% over the long term.\n• NorthWestern Energy Group's Board of Directors has declared a quarterly common stock dividend of $0.67 per share, representing a 1.5% increase over the previous quarter's dividend. The dividend is payable on March 31, 2026, to shareholders of record as of March 13, 2026.\n• Looking ahead, co remains committed to maintaining a dividend payout ratio within our targeted range of 60-70% over the long term."},{"time":"04:28","ticker":"APC","headline":"ARKO Petroleum Corp. (Nasdaq) prices 11,111,111 share IPO at $18.00 per share, at the low end of the $18-20 expected range","body":""},{"time":"04:26","ticker":"AXG","headline":"Solowin Holdings secures up to $100 mln financing to expand stablecoin and tokenization strategy","body":"• SOLOWIN HOLDINGS (AXG) entered a securities purchase agreement with Streeterville Capital for up to $100 mln via pre-paid purchase agreements tied to Class A ordinary shares.The initial tranche of ~$5.4 mln (before OID and expenses) has closed; additional tranches are subject to mutual consent.Proceeds are earmarked for expanding the company's stablecoin and asset tokenization businesses, advancing AI and blockchain security R&D, and supporting global expansion.Terms were disclosed in a Form 6-K and related 424B5 prospectus supplement filed February 9, 2026; structure implies potential future share issuance depending on drawdowns.\n• The initial tranche of ~$5.4 mln (before OID and expenses) has closed; additional tranches are subject to mutual consent.\n• Proceeds are earmarked for expanding the company's stablecoin and asset tokenization businesses, advancing AI and blockchain security R&D, and supporting global expansion.\n• Terms were disclosed in a Form 6-K and related 424B5 prospectus supplement filed February 9, 2026; structure implies potential future share issuance depending on drawdowns."},{"time":"04:22","ticker":"FRMI","headline":"Fermi America advances Hyundai E&amp;C partnership for four AP1000 units at Project Matador","body":"• Fermi Inc. deepened its partnership with Hyundai Engineering & Construction Co., Ltd. to advance FEED work for four AP1000 reactors at its 11GW Project Matador campus near Amarillo, Texas.The companies engaged U.S. contractors at Hyundai E&C's nuclear technology seminar in Dallas to strengthen supply chain and workforce readiness as part of a broader push to restart large-scale U.S. nuclear construction.FEED activities include site layout, cooling system evaluations, and cost/schedule development to support a potential EPC pathway.Management highlighted AI-driven load growth and said Project Matador is positioned as one of the few advanced U.S. nuclear projects with active NRC engagement and readiness to break ground.\n• The companies engaged U.S. contractors at Hyundai E&C's nuclear technology seminar in Dallas to strengthen supply chain and workforce readiness as part of a broader push to restart large-scale U.S. nuclear construction.\n• FEED activities include site layout, cooling system evaluations, and cost/schedule development to support a potential EPC pathway.\n• Management highlighted AI-driven load growth and said Project Matador is positioned as one of the few advanced U.S. nuclear projects with active NRC engagement and readiness to break ground."},{"time":"04:20","ticker":"ODV","headline":"Osisko Development provides infill drilling update on its 13,000-meter Lowhee Program at Cariboo Gold Project","body":"MONTREAL, Feb. 11, 2026 (GLOBE NEWSWIRE) -- OsiskoDevelopment Corp. (NYSE: ODV, TSXV: ODV) (\"Osisko Development\" or the \"Company\") is pleased to announce new infill drilling results from its ongoing 13,000-meter program on 10 meter drill spacing that commenced in August 2025 in the Lowhee Zone of the Company's permitted, 100%-owned Cariboo Gold Project (\"Cariboo\" or the \"Project\"), located in central British Columbia (\"B.C.\"), Canada. The six drill hole fans reported herein comprise an additional ~5,043 meters (\"m\") of underground infill drilling, bringing the total tally of drilling with full results to 11,025 m, or ~80% of the planned total.Click here for full release."},{"time":"04:13","ticker":"MESO","headline":"Mesoblast highlights Ryoncil survival data at ASTCT/CIBMTR; adult pivotal trial set to begin","body":"• Mesoblast Limited presented data showing Ryoncil (remestemcel-L-rknd) delivered similarly high survival in steroid-refractory acute GVHD across children and adults, second- or third-line use, and ruxolitinib-nave or resistant patients.\n• Ryoncil is the first FDA-approved mesenchymal stromal cell product and the only therapy approved for children under 12 with SR-aGvHD.\n• In EIND patients treated = third line (89% grade III/IV), 15% died before completing therapy vs. 2% in second-line Phase 3 (MSB-GVHD001), underscoring benefit of earlier use post-steroid resistance.\n• Adult EIND patients showed day-100 survival at least comparable to pediatric patients; company plans to initiate a pivotal adult second-line trial this quarter to pursue label expansion."},{"time":"04:11","ticker":"SNY","headline":"Sanofi names Beln Garijo CEO; Hudson to step down","body":"• Sanofi will not renew Paul Hudson's director mandate; his last day as CEO is Feb. 17, 2026.\n• Beln Garijo, currently CEO of Merck KGaA, appointed Chief Executive Officer effective after the April 29, 2026 AGM; Board will propose her as director.\n• Olivier Charmeil named Interim CEO during the transition.\n• Garijo to focus on strengthening R&D productivity, governance, and innovation capacity; previously held senior roles at Sanofi and serves on the board of BBVA; former board member of L'Oral."},{"time":"04:08","ticker":"HEINY","headline":"Heineken launches 375 mln second tranche of 750 mln buyback","body":"• Heineken Holding N.V. begins the second 375 mln tranche of its up to 750 mln two-year share buyback program.\n• Repurchases will mirror its pro rata participation in the Heineken N.V. buyback, selling HEIA shares and buying back HEIO shares daily at VWAP.\n• Program expected to complete by 29 Jan 2027, or earlier if fully utilized."}],"fetchedAt":1770891030672},"savedAt":1770891030672}