{"data":{"updated":"2/21/2026, 2:50:44 PM","entries":[{"time":"17:44","ticker":"WRAPX","headline":"This week's biggest % gainers/losers","body":"• Healthcare: MASI (175.37 +34.74%), TNDM (24.83 +31.03%), AMN (19.34 +19.02%), MRNA (49.97 +18.33%)\n• Materials: AG (27.46 +19.58%)\n• Industrials: NCI (5.74 +139.96%)\n• Consumer Discretionary: FNKO (5.28 +46.94%), NDLS (5.36 +36.18%), FOSL (4.63 +21.83%), RRGB (3.79 +18.28%)\n• Information Technology: RNG (39.04 +29.3%), INSG (12.57 +26.97%), GPN (82.41 +20.34%), LPL (4.76 +18.88%)\n• Financials: DFIN (47.41 +21.19%)\n• Energy: OIS (12.46 +32.55%), KOS (2.13 +26.49%), GTE (6.68 +19.93%)\n• Consumer Staples: HLF (19.85 +24.84%)\n• Materials: SXC (6.24 -21.96%), CC (17.06 -16.86%), TSE (0.33 -15.6%), OEC (6.1 -14.21%)\n• Industrials: DNOW (13.14 -20.02%), CAR (95.71 -19.13%), TBI (3.71 -18.21%)\n• Consumer Discretionary: GPC (117.88 -19.9%), JACK (16.8 -18.96%), POOL (221.11 -16.82%)\n• Information Technology: OLED (103.41 -17.21%), EPAM (138.1 -17%), AKAM (93.65 -16.2%), ACLS (79.86 -15.54%), EGHT (2.28 -15.24%), OKTA (74.10 -15.09%), CEVA (19.47 -14.12%), IPGP (132.95 -13.62%)"},{"time":"17:31","ticker":"VOYA","headline":"Voya Financial files mixed securities shelf offering","body":""},{"time":"17:12","ticker":"EQX","headline":"Equinox Gold has filed its audited financial statements and related management's discussion and analysis for the three months and year ended December 31, 2025","body":""},{"time":"16:58","ticker":"HLNE","headline":"Hamilton Lane commences repurchases under its existing stock repurchase program","body":""},{"time":"16:34","ticker":"TROX","headline":"Tronox files mixed securities shelf offering","body":""},{"time":"16:29","ticker":"WRAPX","headline":"Closing Market Summary: Stocks weather macro crosscurrents to finish the week higher","body":"• S&P Mid Cap 400: +9.1% YTD\n• Russell 2000: +7.3% YTD\n• DJIA: +3.3% YTD\n• S&P 500: +0.9% YTD\n• Nasdaq Composite: -1.5% YTD\n• December Personal Income 0.3% (Briefing.com consensus 0.3%); Prior was revised to 0.4% from 0.3%, December Personal Spending 0.4% (Briefing.com consensus 0.2%); Prior was revised to 0.4% from 0.5%, December PCE Prices 0.4% (Briefing.com consensus 0.3%); Prior 0.2%, December PCE Prices - Core 0.4% (Briefing.com consensus 0.4%); Prior 0.2%The key takeaway from the report, other than the fact that spending outpaced income in December, is that the core PCE Price Index sported a 3-handle on a year-over-year basis. This is a key inflation gauge for the Fed, and it doesn't hold the key to a near-term rate cut.\n• The key takeaway from the report, other than the fact that spending outpaced income in December, is that the core PCE Price Index sported a 3-handle on a year-over-year basis. This is a key inflation gauge for the Fed, and it doesn't hold the key to a near-term rate cut.\n• Q4 GDP-Adv. 1.4% (Briefing.com consensus 3.0%); Prior 4.4%, Q4 Chain Deflator-Adv. 3.6% (Briefing.com consensus 3.3%); Prior 3.8%The key takeaway from the report was the combination of weak growth and stubbornly high inflation in the fourth quarter, both of which run afoul of a market narrative that has been concentrated on stronger growth and lower inflation.\n• The key takeaway from the report was the combination of weak growth and stubbornly high inflation in the fourth quarter, both of which run afoul of a market narrative that has been concentrated on stronger growth and lower inflation.\n• February S&P Global U.S. Manufacturing PMI - Prelim 51.2; Prior 52.4\n• February S&P Global U.S. Services PMI - Prelim 52.3; Prior 52.7\n• December New Home Sales 745K (Briefing.com consensus 714K); Prior 758KThe key takeaway from the report is that the weakest growth was concentrated in the nation's largest new home market--the South--underscoring the prevailing weakness in the housing market that has coincided with affordability constraints driven by higher prices and higher mortgage rates.\n• The key takeaway from the report is that the weakest growth was concentrated in the nation's largest new home market--the South--underscoring the prevailing weakness in the housing market that has coincided with affordability constraints driven by higher prices and higher mortgage rates.\n• February Univ. of Michigan Consumer Sentiment - Final 56.6 (Briefing.com consensus 57.3); Prior 57.3 The key takeaway from the report is that there were stark differences in sentiment among consumers with stock holdings (large increase in sentiment) and consumers without stock holdings (a decline in sentiment).\n• The key takeaway from the report is that there were stark differences in sentiment among consumers with stock holdings (large increase in sentiment) and consumers without stock holdings (a decline in sentiment)."},{"time":"16:22","ticker":"ABUS","headline":"Arbutus Biopharma: Delaware Court issues summary judgment rulings in Arbutus, Genevant patent case against Moderna (MRNA)","body":""},{"time":"16:21","ticker":"VNDA","headline":"Vanda Pharma halted for news pending","body":""},{"time":"16:21","ticker":"FIVN","headline":"Five9 entered into cooperation agreement with Anson Funds Management LP, including the nomination of Sagar Gupta for election to the Board","body":"Filing"},{"time":"16:16","ticker":"SVRA","headline":"Savara announces that the FDA filed for review the BLA for MOLBREEVI as a therapy to treat patients with autoimmune PAP","body":"• Co announces that the FDA has filed for review the BLA for MOLBREEVI as a therapy to treat patients with autoimmune PAP. The FDA granted Priority Review with a PDUFA action date of August 22, 2026.\n• \"The FDA's filing of the BLA marks another significant milestone for Savara and the autoimmune PAP community and brings us one step closer to a potential approval in the U.S. in August of this year,\" said Matt Pauls, Chair and Chief Executive Officer, Savara. \"We believe the considerable body of data in the application demonstrates MOLBREEVI improves pulmonary gas transfer, quality of life, and the clinical symptoms associated with this rare and debilitating lung disease. We are grateful to the FDA for the constructive feedback they have provided throughout development and the review process to date and look forward to continued dialogue with the Agency.\""},{"time":"16:10","ticker":"FOLD","headline":"Amicus Therapeutics beats by $0.03, beats on revs","body":"• Reports Q4 (Dec) earnings of $0.10 per share, excluding non-recurring items, $0.03 better than the FactSet Consensus of $0.07; revenues rose 23.7% year/year to $185.21 mln vs the $181.48 mln FactSet Consensus.\n• Note: In December 2025, Amicus entered into a definitive agreement to be acquired by BioMarin Therapeutics (BMRN) for $14.50 per share in an all-cash transaction for a total equity value of approximately $4.8 billion. The agreement has been unanimously approved by the Boards of Directors of both companies and the Amicus Board of Directors unanimously recommended that Amicus' stockholders vote to adopt the agreement. The transaction is expected to close in the second quarter of 2026, subject to regulatory clearances."},{"time":"16:07","ticker":"CIGI","headline":"Colliers amends its revolving credit facility, extending the maturity to February 2031 while including a $250 mln accordion feature","body":""},{"time":"16:06","ticker":"EXAS","headline":"Exact Sciences stockholders approve acquisition by Abbott (ABT)","body":"• Subject to the satisfaction or waiver of the remaining conditions to closing, the transaction is expected to close before the end of the second calendar quarter of 2026."},{"time":"16:01","ticker":"STLD","headline":"Steel Dynamics increases quarterly cash dividend 6% to $0.53/share from $0.50/share","body":""}],"fetchedAt":1771703444434},"savedAt":1771703444435}