{"data":{"updated":"2/11/2026, 4:05:20 AM","entries":[{"time":"17:28","ticker":"ZENA","headline":"ZenaTech files for $250 mln mixed securities shelf offering","body":""},{"time":"17:27","ticker":"MRVL","headline":"Marvell completes acquisition of XConn Technologies","body":"• The acquisition expands Marvell's switching portfolio with XConn's PCIe and CXL products and strengthens Marvell's capabilities in scale-up connectivity for next-generation AI and cloud data center architectures."},{"time":"17:26","ticker":"CRM","headline":"Salesforce signs definitive agreement to acquire Cimulate","body":"• Co has signed a definitive agreement to acquire Cimulate, an emerging leader in AI-powered product discovery and agentic commerce. The acquisition will strengthen Salesforce's investment in Agentforce Commerce by accelerating improvements to search and discovery, helping retailers deliver more personalized, contextual, and conversational shopping experiences."},{"time":"17:20","ticker":"HOOD","headline":"Robinhood Markets names Shiv Verma as new CFO","body":"• In connection with the previously announced retirement of our former Chief Financial Officer Jason Warnick, Shiv Verma, previously the Company's Senior Vice President of Finance and Strategy, and Treasurer, was appointed Chief Financial Officer effective February 6, 2026, and Mr. Warnick is now serving as a strategic advisor until his retirement on September 1, 2026."},{"time":"17:16","ticker":"BAM","headline":"Brookfield Asset Mgmt files mixed securities shelf offering","body":""},{"time":"17:16","ticker":"RMAX","headline":"RE/MAX Holdings expands unmatched global footprint with new master franchise in Libya and Office Launch in Baku, Azerbaijan","body":""},{"time":"17:15","ticker":"RBKB","headline":"Rhinebeck Bancorp announces adoption of plan of conversion and reorganization to undertake second step conversion","body":"• Co announces that the Board of Trustees of its parent mutual holding company, Rhinebeck Bancorp, MHC (the \"MHC\"), has adopted a Plan of Conversion and Reorganization pursuant to which the MHC will undertake a \"second step\" conversion from the mutual holding company structure to the stock holding company structure.\n• The MHC, which was formed in connection with the reorganization of the Bank into the mutual holding company structure and the related initial public offering by the Company in 2019, currently owns approximately 57% of the outstanding shares of common stock of the Company.\n• As part of the conversion, the MHC will merge into the Company and cease to exist. Each share of common stock of the Company owned by persons other than the MHC (the \"minority stockholders\") will be exchanged for new shares of the Company's common stock pursuant to an exchange ratio established at the completion of the proposed transaction.\n• The proposed transaction is expected to be completed in the third quarter of 2026."},{"time":"17:12","ticker":"COUR","headline":"Coursera and Udemy (UDMY) confirm HSR applicable waiting period expired for merger","body":"• On January 9, 2026, Coursera and Udemy submitted the Premerger Notification and Report Forms for the Merger under the HSR Act. The U.S. Federal Trade Commission (\"FTC\") granted early termination under the HSR Act of the waiting period effective February 9, 2026 at 4:29 p.m. (Eastern Time).\n• The completion of the Merger remains subject to the satisfaction of other customary closing conditions specified in the Merger Agreement, including the receipt of certain other required regulatory approvals and the requisite approvals of Coursera and Udemy stockholders."},{"time":"17:03","ticker":"BMM","headline":"Blue Moon Metals completes previously announced acquisition of the Springer critical metals mine and processing plant","body":"• The acquired assets include fee lands and mineral claims containing a historically mined tungsten deposit with significant historical resources, together with a flotation mill previously utilized for tungsten ore processing."},{"time":"16:58","ticker":"NSP","headline":"Insperity announced an internal reorganization; expected to result in the elimination of approximately 4% of non-sales positions","body":"• On February 10, 2026, co announced an internal reorganization designed to improve the efficiency and align workforce with key areas of focus. These actions are expected to result in the elimination of approximately 4% of non-sales positions.\n• \"We expect to continue disciplined hiring in sales and other key positions. We currently estimate that we will incur one-time charges of approximately $9 million in connection with the Realignment Plan, consisting primarily of cash expenditures for severance payments, employee benefits, and related costs. We expect that the majority of the charges will be incurred in the first quarter of 2026 and that the execution of the Realignment Plan will be substantially complete before the end of the first quarter of 2026. We intend to exclude the charges associated with the Realignment Plan from our non-GAAP financial measures.\""},{"time":"16:57","ticker":"LEU","headline":"Centrus Energy misses by $0.62, reports revs in-line; guides FY26 revs below consensus","body":"• Reports Q4 (Dec) earnings of $0.79 per share, $0.62 worse than the FactSet Consensus of $1.41; revenues fell 3.6% year/year to $146.2 mln vs the $146.76 mln FactSet Consensus.The company's total backlog is $3.8 billion as of December 31, 2025 and extends to 2040.\n• The company's total backlog is $3.8 billion as of December 31, 2025 and extends to 2040.\n• Co issues downside guidance for FY26, sees FY26 revs of $425-475 mln vs. $479.46 mln FactSet Consensus."},{"time":"16:52","ticker":"SAM","headline":"Boston Beer Co Chief Marketing Officer Lesya Lysyj to step down","body":"On February 4, 2026, the Company and Lesya Lysyj agreed that she would step down from her position as Chief Marketing Officer effective March 6, 2026, remaining with the company in an advisory capacity through September 30, 2026. On February 10, 2026, Ms. Lysyj and the Company entered into a separation agreement (the \"Separation Agreement\"), outlining the details of her transition and departure."},{"time":"16:51","ticker":"HIW","headline":"Highwoods Prop files mixed securities shelf offering","body":""},{"time":"16:49","ticker":"TFPM","headline":"Triple Flag Precious Metals Corp. and Evolution to unlock the gold-dominant E44 deposit at Northparkes, underpinned by guaranteed gold and silver deliveries","body":"Triple Flag Precious Metals Corp. (TFPM) announces that its wholly owned subsidiary, Triple Flag International Ltd., has agreed with Evolution Mining Limited to fund US$84.3 million in the fourth quarter of 2026 for the development of the new gold-dominant E44 open pit deposit at Northparkes, with Evolution committing to guaranteed minimum deliveries of 45,052 ounces of gold and 446,200 ounces of silver over the 2030 to 2037 period from the E44 Gold Deposit. Triple Flag also congratulates Evolution on its announcement that it has approved the block cave development of the gold-rich E22 deposit at the Northparkes mine, as well as the commencement of a mill expansion study to evaluate the viability of increasing processing capacity to 10 million tonnes per annum or more, from 7.5 Mtpa currently."},{"time":"16:45","ticker":"AMZN","headline":"Amazon One Medical launches Health Insights, a new beta feature that helps eligible members gain deeper understanding of their routine lab results through personalized analysis and evidence-based recommendations","body":"New beta feature transforms routine bloodwork results into personalized and actionable health information."},{"time":"16:45","ticker":"FPH","headline":"Five Point Holdings announced the formation of a new residential land banking investment partnership executed by its Hearthstone Residential Holdings platform with funds managed by Blue Owl Capital (OWL)","body":"• The investment partnership is designed to support the acquisition of residential homesites and land assets in high-quality U.S. housing markets, leveraging Hearthstone's operating expertise, sourcing capabilities, and long-standing relationships with national homebuilders.\n• As part of the transaction, Five Point has agreed to issue warrants to funds managed by Blue Owl that will vest upon the achievement of specified cumulative capital contribution thresholds aligning Blue Owl's long-term participation with the growth of the platform."},{"time":"16:45","ticker":"NOG","headline":"Northern Oil &amp; Gas provides fourth quarter update","body":"• Unrealized mark-to-market gains on derivatives for the fourth quarter were an estimated $84.0 -- $88.0 million, driven by changes to the value of the Company's derivatives portfolio. Realized hedge gains were an estimated $70.0 -- $72.0 million, driven by the Company's natural gas, crude oil and basis hedges.\n• The Company continues to execute its policy of protecting its capital program by periodically entering into financial derivative instruments with counterparties to lock in future commodity prices on a portion of its expected production. NOG has added additional hedges since its third quarter report, including hedges to oil, natural gas and Waha, Midland-Cushing and M2 basis hedges. The Company currently has an average of over 45,000 barrels per day of oil hedged for the first half of 2026 and an average of over 40,000 barrels per day of oil hedged for full-year 2026, through a combination of swaps and collars.\n• NOG continued its successful ground game efforts in the fourth quarter with a record 33 ground game transactions, deploying approximately $77.0 million of acquisition and development capital across the Company's four basins adding 1.2 net wells and over 6,000 net acres.\n• In 2025, the Company deployed approximately $173.5 million of acquisition and development capital across a record 84 ground game transactions, adding 12.8 net wells and over 12,000 acres. These activities will add over 65 net incremental locations across all of NOG's active basins.\n• NOG accounts for its assets under the full-cost method under SEC guidelines, as opposed to the Successful Efforts method, which does not perform historical price-based asset tests. Driven by lower average oil prices on a year-over-year basis, the Company expects to take a non-cash impairment charge in the fourth quarter of 2025 of $260 -- $270 million under the \"ceiling test\" of the full cost pool on its assets. This non-cash charge will have no impact on cash flows of the Company."},{"time":"16:43","ticker":"JHX","headline":"James Hardie beats by $0.01, beats on revs","body":"• Reports Q3 (Dec) earnings of $0.24 per share, $0.01 better than the FactSet Consensus of $0.23; revenues rose 30.1% year/year to $1.24 bln vs the $1.21 bln FactSet Consensus.\n• With respect to FY26 guidance, Ryan Lada, CFO, said, \"For Siding & Trim, market conditions remain challenged, consistent with our prior expectations; however, channel inventories have normalized. As a result, we are allowing our stronger-than-expected third-quarter performance to flow through to full-year results, resulting in a modest increase in the guidance range for the segment. We continue to expect the broader Exteriors market to remain mixed in the near term. For Deck, Rail & Accessories, mid-single-digit sell-through growth continued through the third quarter and into early Q4. We expect channel partner inventories to remain at seasonally normal levels for the remainder of the fiscal year.\" Net Sales for Siding & Trim: $2.953 to $2.998 billion (prev. $2.925 to $2.995 billion)Net Sales for Deck, Rail & Accessories: $787 to $800 million (prev. $780 to $800 million)Adjusted EBITDA for Siding & Trim: $939 to $962 million (prev. $920 to $955 million)Adjusted EBITDA for Deck, Rail & Accessories: $219 to $224 million (prev. $215 to $225 million)Total Adjusted EBITDA: $1.232 to $1.263 billion (prev. $1.20 to $1.25 billion)Free Cash Flow: At Least $200 million (unchanged)\n• Net Sales for Siding & Trim: $2.953 to $2.998 billion (prev. $2.925 to $2.995 billion)\n• Net Sales for Deck, Rail & Accessories: $787 to $800 million (prev. $780 to $800 million)\n• Adjusted EBITDA for Siding & Trim: $939 to $962 million (prev. $920 to $955 million)\n• Adjusted EBITDA for Deck, Rail & Accessories: $219 to $224 million (prev. $215 to $225 million)\n• Total Adjusted EBITDA: $1.232 to $1.263 billion (prev. $1.20 to $1.25 billion)\n• Free Cash Flow: At Least $200 million (unchanged)"},{"time":"16:42","ticker":"SUZ","headline":"Suzano S.A.  will maintain, throughout the entire year of 2026, a market pulp production volume approximately 3.5%  lower than its nominal annual capacity","body":"This decision represents the continuity, for the remaining months of 2026, of the reduction in the operating rate disclosed to the market in the Material Fact dated August 6th, 2025. The decision is based on the assessment that resuming the marginal volume would not provide adequate returns for the Company."},{"time":"16:39","ticker":"LTM","headline":"LATAM Airlines transported 8.2 million passengers in January, recording a solid load factor of 86.4%","body":"• During January, LATAM group transported 8.2 million passengers, representing a 9.0% increase compared to the same month of 2025. This growth was accompanied by a solid load factor, which reached 86.4%, up 1.7 percentage points compared to the same month of the previous year.\n• In line with the above, LATAM group increased its consolidated capacity, measured in available seat-kilometers (ASK), by 11.1% compared to January 2025. This growth was mainly driven by a 15.3% increase in international operations, together with a 10.7% increase in capacity in LATAM Airlines Brazil's domestic market.\n• Consolidated traffic, measured in revenue passenger-kilometers (RPK), increased by 13.3% compared to January 2025, reflecting growth across all segments. International operations once again stood out, with an increase of 17.5%, followed by LATAM Airlines Brazil's domestic market, which recorded an 11.9% year-over-year increase."},{"time":"16:39","ticker":"SCANX","headline":"Notable earnings/guidance movers: MNTN +29.9%, TDC +16%, NET +6.7%, DIOD +6.3% on upside; MAT -19%, ANGI -18.7%, RPD -16.2%, LYFT -13.9% on downside","body":"• Earnings/guidance gainers: MNTN +29.9%, TDC +16%, NET +6.7%, DIOD +6.3%, LSCC +6.1%, KVYO +5.8%, RRR +3.6%, HNGE +3.6%, BL +3.3%, EW +3%, AEIS +2.9%, VREX +1.9%, F +1.7%, UPST +1.4%,\n• Earnings/guidance losers: MAT -19%, ANGI -18.7%, RPD -16.2%, LYFT -13.9%, MBC -10.9%, PEGA -9.4%, ALAB -8.9%, HOOD -7.5%, MIR -6.6%, FRSH -5.6%, GILD -5.2%, ZG -4.9%, OI -4.3%, AIG -1.6%, ARI -1.2%,"},{"time":"16:39","ticker":"TIGO","headline":"Millicom International Cellular acquires Telefonica operations in Chile jointly with NJJ, structured to capture strategic value while protecting its balance sheet","body":"• NJJ and Millicom International Cellular S.A. announced the acquisition from Telefonica S.A. (\"Telefonica\") of 100% of Telefonica's interest in its Chilean business (representing 99.4% of the company), through a jointly controlled vehicle owned 51% by NJJ and 49% by Millicom.\n• Telefonica will receive an initial closing payment of $50 million and be entitled to additional earn-out consideration up to $150 million based on structural value creation. The earn-out consideration and any obligations of the acquired business, including its existing debt, will be payable from its cash flows and are not guaranteed by Millicom. In connection with the joint acquisition, NJJ and Millicom are entering into a shareholders' agreement pursuant to which Millicom will have a call option to purchase NJJ's share in the acquired business after the fifth and sixth years post-closing, at a valuation based on Millicom's then-prevailing trading multiples less a 10% discount, payable with Millicom shares. If exercised, NJJ will be entitled to receive cash or Millicom shares for its transferred stake. If Millicom does not exercise its option, NJJ will have a call option to acquire Millicom's 49% stake on similar pricing terms."},{"time":"16:34","ticker":"GXO","headline":"GXO Logistics beats by $0.04, reports revs in-line; guides FY26 EPS in-line","body":"• Reports Q4 (Dec) earnings of $0.87 per share, excluding non-recurring items, $0.04 better than the FactSet Consensus of $0.83; revenues rose 7.9% year/year to $3.51 bln vs the $3.48 bln FactSet Consensus.\n• Co issues in-line guidance for FY26, sees EPS of $2.85-3.15, excluding non-recurring items, vs. $2.99 FactSet Consensus.Organic revenue growth of 4% to 5%; Adjusted EBITDA of $930 million to $970 million; Adjusted diluted EPS2 of $2.85 to $3.15; and Adjusted EBITDA to free cash flow conversion of 30% to 40%\n• Organic revenue growth of 4% to 5%;\n• Adjusted EBITDA of $930 million to $970 million;\n• Adjusted diluted EPS2 of $2.85 to $3.15; and\n• Adjusted EBITDA to free cash flow conversion of 30% to 40%"},{"time":"16:34","ticker":"AWK","headline":"American Water Works and Essential Utilities (WTRG) shareholders approve merger-related proposals at special shareholder meetings","body":"The merger is expected to close by the end of the first quarter of 2027, but remains subject to customary closing conditions, including, among others, clearance under the Hart-Scott-Rodino Act, and required regulatory approvals, including approval from applicable public utility commissions."},{"time":"16:33","ticker":"MBC","headline":"MasterBrand misses by $0.16, beats on revs; guides Q1 EPS below estimate","body":"• Reports Q4 (Dec) loss of $0.02 per share, excluding non-recurring items, $0.16 worse than the single analyst estimate of $0.14; revenues fell 3.5% year/year to $644.6 mln vs the $607.6 mln single analyst estimate.\n• Co issues downside guidance for Q1, sees EPS of ($0.06)-$0.00, excluding non-recurring items, vs. $0.11 single analyst estimate.Net sales year-over-year decrease of mid-single-digit to high-single-digit percentage.\n• Net sales year-over-year decrease of mid-single-digit to high-single-digit percentage.\n• For full year 2026, MasterBrand expects its addressable market to be down mid-single digits. The Company also expects the following: Gross tariff costs of approximately 5-6% of 2026 net sales Interest expense to be flat to down year-over-year Effective tax rate to improve year-over-year Free cash flow to be in excess of 2026 net income\n• Gross tariff costs of approximately 5-6% of 2026 net sales\n• Interest expense to be flat to down year-over-year\n• Effective tax rate to improve year-over-year\n• Free cash flow to be in excess of 2026 net income"},{"time":"16:33","ticker":"CELH","headline":"Celsius appoints Christy Jacoby and John Short to the Company's Board of Directors","body":"• The Co. announced the appointment of Christy Jacoby and John Short to its Board of Directors. Jacoby and Short were nominated by PepsiCo, Inc. (PEP) following the resignation of Israel Kontorovsky and Michael Del Pozzo from the Celsius Holdings Board, effective immediately.\n• Jacoby currently serves as Senior Vice President and Chief Financial Officer of PepsiCo North America Operations, where she oversees financial strategy and performance of PepsiCo's approximately $40 billion foods and beverages business, including Frito Lay, Quaker North America and Pepsi Beverages. She brings more than two decades of finance and operational leadership experience across PepsiCo's global organization, encompassing financial planning, revenue management, strategy, innovation, supply chain finance and go-to-market finance.\n• Short currently serves as PepsiCo's Senior Vice President of Strategic Partnerships & Franchise, where he leads PepsiCo Beverages North America allied beverage partnerships, beverage mergers and acquisition activity and PepsiCo independent bottler relations. He brings more than 30 years of leadership experience across the beverage and consumer packaged goods industries, encompassing commercial strategy, revenue growth management, customer and channel leadership, operations, mergers and acquisitions, strategic partnerships and franchise bottling systems.\n• PepsiCo is currently entitled to nominate two directors to the Celsius Holdings Board of Directors pursuant to agreements entered into in connection with its equity investment in the Company."},{"time":"16:32","ticker":"LUV","headline":"Southwest Air announces that Directors David Cush and Gregg Saretsky have informed the Company that they are stepping off the Board effective Feb. 23, 2026","body":"The Company further said that in connection with the departures of Cush and Saretsky, the Board intends to reduce its size from 13 to 11 members."},{"time":"16:32","ticker":"NSP","headline":"Insperity misses by $0.13, reports revs in-line; guides Q1 EPS below consensus; guides FY26 EPS in-line","body":"• Reports Q4 (Dec) loss of $0.60 per share, excluding non-recurring items, $0.13 worse than the FactSet Consensus of ($0.47); revenues rose 3.4% year/year to $1.67 bln vs the $1.68 bln FactSet Consensus.\n• Q4 average paid WSEEs up 1% to 312,377.\n• Co issues downside guidance for Q1, sees EPS of $1.03-$1.50, excluding non-recurring items, vs. $1.69 FactSet Consensus.\n• Co issues in-line guidance for FY26, sees EPS of $1.69-$2.72, excluding non-recurring items, vs. $2.44 FactSet Consensus."},{"time":"16:31","ticker":"OI","headline":"O-I Glass beats by $0.01, misses on revs; guides FY26 EPS below consensus","body":"• Reports Q4 (Dec) earnings of $0.20 per share, excluding non-recurring items, $0.01 better than the FactSet Consensus of $0.19; revenues fell 1.9% year/year to $1.5 bln vs the $1.52 bln FactSet Consensus.\n• Co issues downside guidance for FY26, sees EPS of $1.65-$1.90, excluding non-recurring items, vs. $1.94 FactSet Consensus."},{"time":"16:31","ticker":"RCL","headline":"Royal Caribbean increases quarterly cash dividend 50% to $1.50/share from $1.00/share","body":""},{"time":"16:31","ticker":"FBRT","headline":"Franklin BSP Realty Trust announces that the Board of Directors of the Company has appointed Michael Comparato, currently the Company's President, as Chief Executive Officer and Brian Buffone as President, effective immediately","body":"Richard Byrne will continue as Chairman of the Board of Directors."},{"time":"16:31","ticker":"SOLS","headline":"Solstice Advance Materials Announces expansion of uranium conversion production to support strong nuclear industry customer demand","body":"• Driven by rising demand, expected 2026 production of over 10 kilotonnes of uranium hexafluoride in 2026 would represent an approximate 20% expansion from planned 2024 capacity.\n• Company to explore further debottlenecking at its facility and new capacity investments; current backlog is over $2 billion."},{"time":"16:30","ticker":"IVT","headline":"InvenTrust Properties Corp. reports 2025 fourth quarter and full year results; increases quarterly cash dividend 5% to $0.25/share","body":"InvenTrust Properties Corp. (\"InvenTrust\" or the \"Company\") (NYSE: IVT) today reported financial and operating results for the fourth quarter and full year ended December 31, 2025 and provided initial guidance for 2026. For the three months ended December 31, 2025 and 2024, the Company reported Net Income of $2.7 million, or $0.03 per diluted share, compared to Net Income of $9.8 million, or $0.13 per diluted share, respectively. For the years ended December 31, 2025 and 2024, the Company reported Net Income of $111.4 million, or $1.42 per diluted share, compared to Net Income of $13.7 million, or $0.19 per diluted share, respectively.Click here for full release."},{"time":"16:29","ticker":"WRAPX","headline":"Closing Market Summary: Major averages finish mostly lower as tech rebound stalls","body":"• S&P Mid Cap 400: +8.6% YTD\n• Russell 2000: +8.0% YTD\n• DJIA: +4.4% YTD\n• S&P 500: +1.4% YTD\n• Nasdaq Composite: -0.6% YTD\n• January NFIB Small Business Optimism 99.3; Prior 99.5\n• December Retail Sales 0.0% (Briefing.com consensus 0.4%); Prior 0.6%, December Retail Sales, ex-auto 0.0% (Briefing.com consensus 0.4%); Prior was revised to 0.4% from 0.5%The key takeaway from the report is that spending on goods was down across most discretionary categories following some decent-sized gains in November. That will foment some concern about consumer spending fatigue at the end of last year, which of course included the holiday shopping period.\n• The key takeaway from the report is that spending on goods was down across most discretionary categories following some decent-sized gains in November. That will foment some concern about consumer spending fatigue at the end of last year, which of course included the holiday shopping period.\n• Q4 Employment Cost Index 0.7% (Briefing.com consensus 0.8%); Prior 0.8%The key takeaway from the report is that there was some moderation in employment costs on a year-over-year basis that will help temper inflation worries.\n• The key takeaway from the report is that there was some moderation in employment costs on a year-over-year basis that will help temper inflation worries.\n• December Import Prices 0.1%\n• December Import Prices ex-oil 0.4%\n• December Export Prices 0.3%\n• December Export Prices ex-ag. 0.3%\n• November Business Inventories 0.1% (Briefing.com consensus 0.2%); Prior was revised to 0.2% from 0.3%"},{"time":"16:28","ticker":"DEI","headline":"Douglas Emmett reports FFO in-line, misses on revs; guides FY26 FFO in-line","body":"• Reports Q4 (Dec) funds from operations of $0.35 per share, in-line with the FactSet Consensus of $0.35; revenues rose 1.8% year/year to $249.43 mln vs the $252.26 mln FactSet Consensus.\n• Co issues in-line guidance for FY26, sees FFO of $1.39-1.45 vs. $1.41 FactSet Consensus."},{"time":"16:27","ticker":"CURB","headline":"Curbline Properties announces the commencement of an underwritten public offering of 8,000,000 shares of its common stock on a forward basis in connection with the forward sale agreements","body":"In connection with the offering, the Company expects to enter into forward sale agreements with Morgan Stanley and BofA Securities, with respect to 8,000,000 shares of the Company's common stock."},{"time":"16:27","ticker":"EW","headline":"Edwards Lifesciences misses by $0.04, beats on revs; guides Q1 EPS above consensus, revs in-line; guides FY26 EPS in-line, revs in-line","body":"• Reports Q4 (Dec) earnings of $0.58 per share, excluding non-recurring items, $0.04 worse than the FactSet Consensus of $0.62; revenues rose 13.3% year/year to $1.57 bln vs the $1.55 bln FactSet Consensus.\n• Co issues guidance for Q1, sees EPS of $0.70-0.76, excluding non-recurring items, vs. $0.69 FactSet Consensus; sees Q1 revs of $1.55-1.63 bln vs. $1.57 bln FactSet Consensus.\n• Co issues in-line guidance for FY26, sees EPS of $2.90-3.05 vs. $2.92 FactSet Consensus; sees FY26 revenue growth of +8-10%, which computes as $6.55-6.67 bln vs. $6.63 bln FactSet Consensus."},{"time":"16:26","ticker":"ARI","headline":"Apollo Commercial Real Estate Finance, Inc. Reports Fourth Quarter and Full Year 2025 Results","body":"NEW YORK, Feb. 10, 2026 (GLOBE NEWSWIRE) -- Apollo Commercial Real Estate Finance, Inc. (ARI) today reported results for the quarter and year ended December 31, 2025.Click here for full release."},{"time":"16:25","ticker":"TDC","headline":"Teradata advances Board refreshment program","body":"• The Co. announced the following changes to its Board of Directors as part of the Board's ongoing refreshment program and in connection with a cooperation agreement with Lynrock Lake LP and certain related parties:The Board expects to appoint Melissa Fisher to the Board as a Class I director no later than March 1, 2026, following the completion of customary onboarding procedures. Ms. Fisher is expected to be nominated for election at the Company's 2026 Annual Meeting of Stockholders (the \"2026 Annual Meeting\") with a term expiring at the 2029 Annual Meeting of Stockholders. The Board has an active search process underway to identify an additional independent director to join the Board following the 2026 Annual Meeting and will work with Lynrock Lake to select candidates for consideration. As part of the Board's phased refreshment plan, one Class I director will retire and not stand for re-election at the 2026 Annual Meeting, and one Class II director will retire and not stand for re-election at the 2027 Annual Meeting of Stockholders.\n• The Board expects to appoint Melissa Fisher to the Board as a Class I director no later than March 1, 2026, following the completion of customary onboarding procedures. Ms. Fisher is expected to be nominated for election at the Company's 2026 Annual Meeting of Stockholders (the \"2026 Annual Meeting\") with a term expiring at the 2029 Annual Meeting of Stockholders.\n• The Board has an active search process underway to identify an additional independent director to join the Board following the 2026 Annual Meeting and will work with Lynrock Lake to select candidates for consideration.\n• As part of the Board's phased refreshment plan, one Class I director will retire and not stand for re-election at the 2026 Annual Meeting, and one Class II director will retire and not stand for re-election at the 2027 Annual Meeting of Stockholders."},{"time":"16:24","ticker":"HNGE","headline":"Hinge Health beats by $0.08, beats on revs; guides Q1 revs above consensus; guides FY26 revs above consensus","body":"• Reports Q4 (Dec) earnings of $0.49 per share, $0.08 better than the FactSet Consensus of $0.41; revenues rose 45.5% year/year to $170.73 mln vs the $156.66 mln FactSet Consensus.\n• LTM calculated billings increased 44% year over year to $671.4 million, compared to $467.5 million as of December 31, 2024.\n• Annual yield of 3.9% in 2025, up 50 basis points compared to 3.4% in 2024.\n• Number of clients increased 25% year over year to 2,830 clients, compared to 2,256 clients as of December 31, 2024.\n• Co issues upside guidance for Q1, sees Q1 revs of $171-$173 mln vs. $160.21 mln FactSet Consensus. Expect non-GAAP income from operations to be between $30 million and $32 million, reflecting year over year growth of 108% and non-GAAP operating margin of 18% at the midpoint.\n• Co issues upside guidance for FY26, sees FY26 revs of $732-$742 mln vs. $702.88 mln FactSet Consensus. Expect non-GAAP income from operations to be between $151 million and $156 million, reflecting year over year growth of 29% and non-GAAP operating margin of 21% at the midpoint."},{"time":"16:24","ticker":"ALAB","headline":"Astera Labs beats by $0.06, beats on revs; guides Q1 EPS above consensus, revs above consensus; names new CFO","body":"• Reports Q4 (Dec) earnings of $0.58 per share, excluding non-recurring items, $0.06 better than the FactSet Consensus of $0.52; revenues rose 91.8% year/year to $270.58 mln vs the $249.55 mln FactSet Consensus.\n• Co issues upside guidance for Q1, sees EPS of $0.53-0.54, excluding non-recurring items, vs. $0.52 FactSet Consensus; sees Q1 revs of $286-297 mln vs. $260.18 mln FactSet Consensus.\n• Co also announces that Mike Tate will transition from his CFO role to become a full-time Strategic Advisor to the CEO. During this time, he will also support a smooth leadership handoff to his successor. Desmond Lynch will join Astera Labs as CFO effective March 2, 2026. Desmond brings more than 25 years of financial leadership experience in the semiconductor industry and was most recently CFO of Rambus (RMBS), following senior finance roles at Knowles, IDT, Atmel and National Semiconductor."},{"time":"16:23","ticker":"RPD","headline":"Rapid7 beats by $0.03, beats on revs; guides Q1 EPS, revs below consensus; guides FY26 EPS, revs below consensus","body":"• Reports Q4 (Dec) earnings of $0.44 per share, excluding non-recurring items, $0.03 better than the FactSet Consensus of $0.41; revenues rose 0.5% year/year to $217.39 mln vs the $215.02 mln FactSet Consensus.\n• Co issues downside guidance for Q1, sees EPS of $0.29-$0.32, excluding non-recurring items, vs. $0.46 FactSet Consensus; sees Q1 revs of $207-$209 mln vs. $213.50 mln FactSet Consensus.\n• Co issues downside guidance for FY26, sees EPS of $1.50-$1.60, excluding non-recurring items, vs. $1.96 FactSet Consensus; sees FY26 revs of $835-$843 mln vs. $869.34 mln FactSet Consensus."},{"time":"16:22","ticker":"NET","headline":"Cloudflare beats by $0.01, beats on revs; guides Q1 EPS below consensus, revs above consensus; guides FY26 EPS below consensus, revs above consensus","body":"• Reports Q4 (Dec) earnings of $0.28 per share, excluding non-recurring items, $0.01 better than the FactSet Consensus of $0.27; revenues rose 33.6% year/year to $614.51 mln vs the $591.34 mln FactSet Consensus.\n• Co issues mixed guidance for Q1, sees EPS of $0.23, excluding non-recurring items, vs. $0.25 FactSet Consensus; sees Q1 revs of $620-621 mln vs. $614.35 mln FactSet Consensus.\n• Co issues mixed guidance for FY26, sees EPS of $1.11-1.12, excluding non-recurring items, vs. $1.18 FactSet Consensus; sees FY26 revs of $2.785-2.795 bln vs. $2.73 bln FactSet Consensus."},{"time":"16:22","ticker":"AIG","headline":"American Intl beats by $0.06, Total net investment income down 34%","body":"• Reports Q4 (Dec) earnings of $1.96 per share, excluding non-recurring items, $0.06 better than the FactSet Consensus of $1.90.\n• Total net investment income for the fourth quarter of 2025 was $872 million, down 34% from $1.3 billion in the prior year quarter, primarily due to lower gains on the change in fair value and lower gains on sale of shares from AIG's interest in Corebridge and lower income on alternative investments, partially offset by higher income from fixed maturity securities.\n• General Insurance underwriting income of $670 million, up 48% year-over-year.\n• General Insurance combined ratio of 88.8%; Accident year combined ratio, as adjusted (AYCR) of 88.9%."},{"time":"16:21","ticker":"MAT","headline":"Mattel misses by $0.15, misses on revs; guides FY26 EPS below consensus, revs in-line; to acquire full ownership of Mattel163 Mobile Games Studio; announces licensing deal with Paramount for Teenage Mutant Ninja Turtles brand; announces $150 mln of strategic investments in 2026","body":"• Reports Q4 (Dec) earnings of $0.39 per share, excluding non-recurring items, $0.15 worse than the FactSet Consensus of $0.54; revenues rose 7.3% year/year to $1.77 bln vs the $1.84 bln FactSet Consensus.\n• Co issues guidance for FY26, sees EPS of $1.18-1.30, excluding non-recurring items, vs. $1.77 FactSet Consensus; sees FY26 revs growing +3-6%, which we compute as $5.51-5.67 bln vs. $5.62 bln FactSet Consensus.$150 mln of strategic investments: Co says its 2026 guidance includes several targeted, strategic investments in new capabilities and technology to scale business opportunities of approximately $110 mln in 2026. These include digital games, first-party data, direct-to-consumer, and breakthrough toy innovation, as well as AI and infrastructure. Co is also planning to invest approximately $40 mln primarily in performance-based marketing. In aggregate, these investments will impact Mattel's Adjusted Operating Income in 2026 and then are expected to be high-ROI and self-funding in 2027 and beyond through accelerated growth in Net Sales and Adjusted Operating Income.\n• $150 mln of strategic investments: Co says its 2026 guidance includes several targeted, strategic investments in new capabilities and technology to scale business opportunities of approximately $110 mln in 2026. These include digital games, first-party data, direct-to-consumer, and breakthrough toy innovation, as well as AI and infrastructure. Co is also planning to invest approximately $40 mln primarily in performance-based marketing. In aggregate, these investments will impact Mattel's Adjusted Operating Income in 2026 and then are expected to be high-ROI and self-funding in 2027 and beyond through accelerated growth in Net Sales and Adjusted Operating Income.\n• Co also announces an agreement with its joint venture partner, NetEase (NTES), an internet and game services provider, to acquire full ownership of the Mattel163 mobile games studio. The transaction is expected to be completed by the end of Q1. Mattel163 develops digital games based on Mattel's iconic brands. Since its inception in 2018, Mattel163 has released four games based on Mattel IP, Uno!, Uno Wonder, Phase 10, and Skip Bo, with approximately 20 million monthly active users and over 550 million downloads worldwide. The transaction values Mattel163 at $318 mln, with a purchase price of $159 mln for NetEase's 50% interest. More than half of the purchase cost is expected to be funded from Mattel's share of the JV's cash, which is not consolidated on Mattel's balance sheet. It will be immediately accretive for the company. Acquiring full control of Mattel163 meaningfully advances Mattel's digital games business and will add significant development, publishing, and digital customer acquisition expertise.\n• The transaction values Mattel163 at $318 mln, with a purchase price of $159 mln for NetEase's 50% interest. More than half of the purchase cost is expected to be funded from Mattel's share of the JV's cash, which is not consolidated on Mattel's balance sheet. It will be immediately accretive for the company. Acquiring full control of Mattel163 meaningfully advances Mattel's digital games business and will add significant development, publishing, and digital customer acquisition expertise.\n• Co and Paramount, a Skydance Corporation (PSKY) announce a global, multiyear licensing agreement to develop and market a wide range of products for the iconic Teenage Mutant Ninja Turtles brand. Beginning in 2027, action figures, playsets and accessories, vehicles, games, collectibles, role play and more are set to roll out across retailers. Through the agreement, Mattel will also produce new product lines for the animated movie sequel Teenage Mutant Ninja Turtles: Mutant Mayhem 2 for 2027, and a new untitled Teenage Mutant Ninja Turtles live-action/CG animation hybrid in 2028."},{"time":"16:20","ticker":"FRSH","headline":"Freshworks beats by $0.03, beats on revs; guides Q1 EPS below consensus, revs above consensus; guides FY26 EPS below consensus, revs above consensus","body":"• Reports Q4 (Dec) earnings of $0.14 per share, excluding non-recurring items, $0.03 better than the FactSet Consensus of $0.11; revenues rose 14.5% year/year to $222.74 mln vs the $218.76 mln FactSet Consensus.\n• Co issues mixed guidance for Q1, sees EPS of $0.10-$0.12, excluding non-recurring items, vs. $0.14 FactSet Consensus; sees Q1 revs of $222-$225 mln vs. $220.89 mln FactSet Consensus.\n• Co issues mixed guidance for FY26, sees EPS of $0.55-$0.57, excluding non-recurring items, vs. $0.69 FactSet Consensus; sees FY26 revs of $952-$960 mln vs. $945.30 mln FactSet Consensus."},{"time":"16:19","ticker":"MNTN","headline":"MNTN, Inc. beats by $0.19, beats on revs; guides Q1 revs below consensus; guides FY26 revs in-line","body":"• Reports Q4 (Dec) earnings of $0.43 per share, $0.19 better than the FactSet Consensus of $0.24; revenues rose 24.8% year/year to $87.1 mln vs the $86.18 mln FactSet Consensus.\n• Adjusted EBITDA increased to $28.1 million, representing 32% of revenue, compared to Adjusted EBITDA of $20.7 million, which was 30% of revenue, in Q4 2024.\n• Co issues downside guidance for Q1, sees Q1 revs of $71.3-$73.3 mln vs. $74.66 mln FactSet Consensus. Adjusted EBITDA is expected to be between $13 million and $14 million.\n• Co issues in-line guidance for FY26, sees FY26 revs of $345-$355 mln vs. $345.50 mln FactSet Consensus. Adjusted EBITDA is expected to be between $94.6 million and $99.6 million."},{"time":"16:18","ticker":"EXEL","headline":"Exelixis beats by $0.11, reports revs in-line; guides FY26 revs in-line","body":"• Reports Q4 (Dec) earnings of $0.94 per share, excluding non-recurring items, $0.11 better than the FactSet Consensus of $0.83; revenues rose 5.6% year/year to $598.66 mln vs the $596.52 mln FactSet Consensus.\n• Co issues in-line guidance for FY26, sees FY26 revs of $2.525-$2.625 bln vs. $2.62 bln FactSet Consensus."},{"time":"16:18","ticker":"TX","headline":"Ternium S.A. completed the acquisition of 153.1 mln ordinary shares of Usinas Siderrgicas de Minas Gerais S.A. from Nippon Steel (NPSCY) and Mitsubishi (MSBHF) for approximately $315.2 mln in cash","body":""},{"time":"16:18","ticker":"DIOD","headline":"Diodes beats by $0.06, beats on revs; guides Q1 revs above consensus","body":"• Reports Q4 (Dec) earnings of $0.34 per share, excluding non-recurring items, $0.06 better than the FactSet Consensus of $0.28; revenues rose 15.4% year/year to $391.58 mln vs the $381.27 mln FactSet Consensus.\n• Co issues upside guidance for Q1, sees Q1 revenue of $395 mln +/- 3%, which computes as $383.15-406.85 mln vs. $376.55 mln FactSet Consensus.\n• \"We have continued to see demand improvements across all target markets and geographies, with the most significant growth for the full year driven by a 25% increase in the computing market primarily for AI server-related applications as well as double-digit increases in our automotive and industrial end markets\""},{"time":"16:18","ticker":"U","headline":"Unity Software announces the appointment of gaming and technology veteran Bernard Kim as an independent director to its Board of Directors, effective May 1, 2026","body":"Unity also announced that David Helgason and Tomer Bar-Zeev stepped down from its Board of Directors, effective February 5, 2026."},{"time":"16:17","ticker":"APAM","headline":"Artisan Partners Asset Mgmt reports that its preliminary assets under management as of January 31, 2026 totaled $185.3 billion","body":"Artisan Funds and Artisan Global Funds accounted for $90.2 billion of total firm AUM, while separate accounts and other AUM1 accounted for $95.1 billion."},{"time":"16:17","ticker":"WPC","headline":"W.P. Carey beats by $0.02, beats on revs; guides FY26 FFO above consensus","body":"• Reports Q4 (Dec) funds from operations of $1.27 per share, excluding non-recurring items, $0.02 better than the FactSet Consensus of $1.25; revenues rose 9.6% year/year to $442.4 mln vs the $415.81 mln FactSet Consensus.\n• Year-to-date investment volume of $312.4 million.\n• Active capital investments and commitments of $238.3 million scheduled to be completed in 2026, including three projects totaling $50.0 million completed year to date.\n• Co issues upside guidance for FY26, sees FFO of $5.13-$5.23, excluding non-recurring items, vs. $5.08 FactSet Consensus."},{"time":"16:14","ticker":"MAT","headline":"Mattel announces an agreement with its joint venture partner, NetEase, a leading internet and game services provider, to acquire full ownership of the Mattel163 mobile games stud","body":"• The transaction is expected to be completed by the end of Q1, subject to customary closing conditions.\n• Mattel163 develops digital games based on Mattel's iconic brands. Since its inception in 2018, Mattel163 has released four games based on Mattel IP, Uno!, Uno Wonder, Phase 10, and Skip Bo, with approximately 20 million monthly active users and over 550 million downloads worldwide.\n• The transaction values Mattel163 at $318 million, with a purchase price of $159 million for NetEase's 50% interest. More than half of the purchase cost is expected to be funded from Mattel's share of the JV's cash, which is not consolidated on Mattel's balance sheet. It will be immediately accretive for the company.\n• Acquiring full control of Mattel163 meaningfully advances Mattel's digital games business and will add significant development, publishing, and digital customer acquisition expertise. Mattel will leverage Mattel163 capabilities to increase its mobile games output and enhance alignment with the broader Mattel product roadmap. Integrating Mattel163 with Mattel's digital business will create scale benefits in performance marketing and cross promotion, as well as greater synergy with Mattel brand marketing. The acquisition is in line with Mattel's strategy to capture the full value of its IP in high-margin, highly accretive entertainment verticals."},{"time":"16:14","ticker":"PEGA","headline":"Pegasystems beats by $0.03, beats on revs; guides FY26 EPS above consensus, revs above consensus","body":"• Reports Q4 (Dec) earnings of $0.76 per share, excluding non-recurring items, $0.03 better than the FactSet Consensus of $0.73; revenues rose 2.8% year/year to $504.3 mln vs the $491.84 mln FactSet Consensus.Annual Contract Value (ACV) grows 17% year over year (14% in constant currency).\n• Annual Contract Value (ACV) grows 17% year over year (14% in constant currency).\n• Co issues upside guidance for FY26, sees EPS of $2.75, excluding non-recurring items, vs. $2.22 FactSet Consensus; sees FY26 revs of $2.0 bln vs. $1.86 bln FactSet Consensus.Annual contract value growth of 15%. Free cash flow of $575 mln.\n• Annual contract value growth of 15%.\n• Free cash flow of $575 mln.\n• Increases share repurchase authorization by $1B."},{"time":"16:14","ticker":"VREX","headline":"Varex Imaging announces financial results for first quarter fiscal year 2026 with guidance","body":"\"We are pleased to report a solid start to fiscal 2026, with results toward the high-end of guidance. First quarter revenue of $210 million, increased 5% year-over-year. Growth in the quarter was driven by strength in our cargo systems business, which contributed to a 17% year-over-year increase in Industrial segment revenue,\" said Sunny Sanyal, Chief Executive Officer. Sanyal added, \"Looking ahead, we expect demand for CT products to remain strong and we are encouraged by the sustained momentum in our cargo security systems business.\"Click here for full release."},{"time":"16:14","ticker":"KVYO","headline":"Klaviyo beats by $0.02, beats on revs; guides Q1 revs above consensus; guides FY26 revs above consensus","body":"• Reports Q4 (Dec) earnings of $0.19 per share, excluding non-recurring items, $0.02 better than the FactSet Consensus of $0.17; revenues rose 29.6% year/year to $350.2 mln vs the $333.98 mln FactSet Consensus.\n• Co issues upside guidance for Q1, sees Q1 revs of $346-350 mln vs. $344.09 mln FactSet Consensus.\n• Co issues upside guidance for FY26, sees FY26 revs of $1.501-1.509 bln vs. $1.48 bln FactSet Consensus.\n• \"The shift toward autonomous customer experiences is reinforcing the durability of our model and accelerating our growth across multi-product adoption, enterprise wins, international expansion, and increased AI adoption, giving us confidence in our path to continued growth in 2026.\""},{"time":"16:14","ticker":"LYFT","headline":"Lyft reports Q4 results, misses on revs, Gross Bookings up 19%; Guides Q1 Gross Bookings in-line, adjusted EBITDA below consensus at midpoint of range, and announces new $1.0 bln share repurchase program","body":"• Reports Q4 (Dec) earnings; revenues rose 2.7% year/year to $1.59 bln vs the $1.75 bln FactSet Consensus. Gross Bookings of $5.1 billion, up 19% yr/yr.\n• Adjusted EBITDA up 37% year over year to $154.1 million compared to $112.8 million in Q4.\n• In Q4, Active Riders growth accelerated to 18% year over year to 29.2 million. In 2025, Lyft reached another all-time high of 51.3 million annual riders.\n• Announces new $1 billion share repurchase program\n• 1Q26 Outlook: Sees Gross Bookings of approximately $4.86-$5.00 billion, up approximately 17% to 20% year over year, and in-line with the $4.93 bln FactSet Consensus estimate. Sees adjusted EBITDA of approximately $120-$140 million vs. the $140 mln FactSet Consensus estimate."},{"time":"16:13","ticker":"PSKY","headline":"Paramount Skydance and Mattel (MAT) announce a global, multiyear licensing agreement to develop and market a wide range of products for the iconic Teenage Mutant Ninja Turtles brand","body":"Beginning in 2027, action figures, playsets and accessories, vehicles, games, collectibles, role play and more are set to roll out across retailers. Through the agreement, Mattel will also produce new product lines for the animated movie sequel Teenage Mutant Ninja Turtles: Mutant Mayhem 2 for 2027, and a new untitled Teenage Mutant Ninja Turtles live-action/CG animation hybrid in 2028."},{"time":"16:13","ticker":"FRMI","headline":"Fermi America in partnership with the Texas Tech University System secures a $500 million financing commitment from MUFG Bank (MUFG)","body":"• MUFG's financing serves as a solid institutional backing of Fermi America's strategy and further strengthens the ability to deliver the first 2.3 of 11 gigawatts of long-duration, reliable power at scale.\n• Proceeds from the financing will be used to fund the acquisition of three Siemens Energy F-class gas turbines (previously announced), a proven industrial frame class asset widely deployed across large-scale, mission-critical power infrastructure globally."},{"time":"16:13","ticker":"TDC","headline":"Teradata beats by $0.18, beats on revs; guides Q1 EPS above consensus, revs above consensus; guides FY26 EPS above consensus, revs above consensus","body":"• Reports Q4 (Dec) earnings of $0.74 per share, excluding non-recurring items, $0.18 better than the FactSet Consensus of $0.56; revenues rose 2.9% year/year to $421 mln vs the $400.51 mln FactSet Consensus.\n• Co issues upside guidance for Q1, sees EPS of $0.75-$0.79, excluding non-recurring items, vs. $0.69 FactSet Consensus; sees Q1 revs of +1% to +3%, which we equate to about $422.2-$430.5 mln vs. $411.14 mln FactSet Consensus.\n• Co issues upside guidance for FY26, sees EPS of $2.55-$2.65, excluding non-recurring items, vs. $2.54 FactSet Consensus; sees FY26 revs of -2% to flat, which we equate to about $1.72-$1.75 bln vs. $1.64 bln FactSet Consensus."},{"time":"16:12","ticker":"BL","headline":"BlackLine beats by $0.04, reports revs in-line; guides Q1 EPS below consensus, revs in-line; guides FY26 EPS above consensus, revs above consensus","body":"• Reports Q4 (Dec) earnings of $0.63 per share, excluding non-recurring items, $0.04 better than the FactSet Consensus of $0.59; revenues rose 8.1% year/year to $183.2 mln vs the $183.04 mln FactSet Consensus.\n• Co issues guidance for Q1, sees EPS of $0.44-0.46, excluding non-recurring items, vs. $0.54 FactSet Consensus; sees Q1 revs of $180-182 mln vs. $181.29 mln FactSet Consensus.\n• Co issues upside guidance for FY26, sees EPS of $2.37-2.48, excluding non-recurring items, vs. $2.35 FactSet Consensus; sees FY26 revs of $764-768 mln vs. $760.82 mln FactSet Consensus.\n• \"Our fourth-quarter performance, highlighted by record bookings, provides encouraging validation of the strategic transformation we initiated over two years ago,\" said Owen Ryan, CEO of BlackLine. \"The intentional steps we have taken to modernize our Go-To-Market engine, scale our Studio360 platform, and launch Verity AI to deliver outcomes for customers are translating into solid results. While we are pleased with this momentum, we remain focused on disciplined execution to drive revenue growth and operating margin expansion in 2026.\""},{"time":"16:12","ticker":"NTST","headline":"NETSTREIT reports fourth quarter results; affirms 2026 AFFO; increases quarterly dividend by 2.3% to $0.22 per share","body":"NETSTREIT Corp. (NYSE: NTST) (the \"Company\") today announced financial and operating results for the fourth quarter and year ended December 31, 2025.Click here for full release."},{"time":"16:11","ticker":"AVDL","headline":"Avadel Pharmaceuticals announces that the Irish High Court has sanctioned, without modification, the scheme of arrangement between Avadel and its shareholders under Chapter 1 of Part 9 of the Irish Companies Act 2014 pursuant to which Alkermes plc, a public limited company incorporated in Ireland  will acquire the entire issued and to be issued ordinary share capital of Avadel","body":"• As set out in the definitive proxy statement filed by Avadel with the U.S. Securities and Exchange Commission on December 3, 2025, completion of the Proposed Transaction remains subject to the delivery to the Registrar of Companies of a copy of the Court Order sanctioning the Scheme.\n• Assuming that a copy of the Court Order is processed and made available to Avadel by no later than February 11, 2026, the Court Order is expected to be delivered to the Registrar of Companies on February 12, 2026 and, accordingly, the Scheme is expected to take effect on February 12, 2026. Accordingly, February 11, 2026 is expected to be the last date on which trading of Avadel Shares on the Nasdaq Global Market will occur. It is expected that Avadel will request Nasdaq halt trading of the Avadel Shares effective as of 8.00 p.m. (U.S. Eastern Time) on February 11, 2026.\n• Except as otherwise defined herein, capitalised terms used but not defined in this announcement have the same meanings as given to them in the Definitive Proxy"},{"time":"16:11","ticker":"HOOD","headline":"Robinhood Markets beats by $0.03, misses on revs","body":"• Reports Q4 (Dec) earnings of $0.66 per share, $0.03 better than the FactSet Consensus of $0.63; revenues rose 26.5% year/year to $1.28 bln vs the $1.35 bln FactSet Consensus.Transaction-based revenues increased 15% year-over-year to $776 million, primarily driven by other transaction revenue of $147 million, up over 300%, options revenue of $314 million, up 41%, and equities revenue of $94 million, up 54%, partially offset by cryptocurrencies revenue of $221 million, down 38%.Average Revenue Per User (\"ARPU\") increased 16% year-over-year to $191.\n• Transaction-based revenues increased 15% year-over-year to $776 million, primarily driven by other transaction revenue of $147 million, up over 300%, options revenue of $314 million, up 41%, and equities revenue of $94 million, up 54%, partially offset by cryptocurrencies revenue of $221 million, down 38%.\n• Average Revenue Per User (\"ARPU\") increased 16% year-over-year to $191.\n• 2026 expense plan and outlook: \"Our 2026 expense plan is designed to accelerate product velocity, drive Net Deposit growth, and grow revenues. This expense outlook includes growth investments in new or recently launched products and features, marketing, international expansion, full year costs related to the 2025 acquisitions of TradePMR and Bitstamp, and rapid growth in existing core products; while also driving rapid growth in existing core products and productivity and efficiency gains in our existing businesses. Our outlook for 2026 Adjusted Operating Expenses and SBC is $2.6 billion to $2.725 billion, which represents 18% year-over-year growth at the midpoint relative to 2025 Adjusted Operating Expenses and SBC.\""},{"time":"16:10","ticker":"WELL","headline":"Welltower beats by $0.04, beats on revs; guides FY26 FFO above consensus","body":"• Reports Q4 (Dec) funds from operations of $1.45 per share, excluding non-recurring items, $0.04 better than the FactSet Consensus of $1.41; revenues rose 41.3% year/year to $3.18 bln vs the $2.86 bln FactSet Consensus.\n• Co issues upside guidance for FY26, sees FFO of $6.09-6.25, excluding non-recurring items, vs. $6.04 FactSet Consensus.We expect average blended SSNOI growth of 11.25% to 15.75%\n• We expect average blended SSNOI growth of 11.25% to 15.75%\n• On February 10, 2026, the Board of Directors declared a cash dividend for the quarter ended December 31, 2025, of $0.74 per share. This dividend, which will be paid on March 10, 2026, to stockholders of record as of February 25, 2026, will be our 219th consecutive quarterly cash dividend."},{"time":"16:10","ticker":"AMAT","headline":"Applied Materials introduces new deposition, etch and materials modification systems that boost the performance of leading-edge logic chips at 2nm and beyond","body":"• New chipmaking systems boost the energy-efficient performance of Gate-All-Around transistors and wiring at 2nm and beyond.\n• Viva pure radical treatment smoothens GAA silicon nanosheets with atomic-level precision to increase transistor performance.\n• Sym3 Z Magnum conductor etch system delivers angstrom-level 3D trench profile control to increase silicon nanosheet uniformity and performance.\n• Spectral atomic layer deposition system replaces today's tungsten transistor contacts with molybdenum, a new contact metal that lowers electrical resistance at the critical link between transistors and the copper wiring network.\n• The new systems are now being used by multiple leading foundry-logic manufacturers."},{"time":"16:10","ticker":"ZG","headline":"Zillow misses by $0.01, reports revs in-line; guides Q1 revs above consensus","body":"• Reports Q4 (Dec) earnings of $0.39 per share, excluding non-recurring items, $0.01 worse than the FactSet Consensus of $0.40; revenues rose 18.1% year/year to $654 mln vs the $650.51 mln FactSet Consensus.For Sale revenue was up 11% yr/yr to $475 mln. Residential revenue was up 8% to $418 million, benefiting from growth in the company's agent and software offerings and in the company's New Construction marketplace. Mortgages revenue increased 39% year over year to $57 million in Q4, primarily due to a 67% increase in purchase loan origination volume to $1.5 billion. Rentals revenue increased 45% to $168 mln in Q4, primarily driven by multifamily revenue growing 63%.\n• For Sale revenue was up 11% yr/yr to $475 mln. Residential revenue was up 8% to $418 million, benefiting from growth in the company's agent and software offerings and in the company's New Construction marketplace. Mortgages revenue increased 39% year over year to $57 million in Q4, primarily due to a 67% increase in purchase loan origination volume to $1.5 billion.\n• Rentals revenue increased 45% to $168 mln in Q4, primarily driven by multifamily revenue growing 63%.\n• Co issues upside guidance for Q1, sees Q1 revs of $700-710 mln vs. $691.42 mln FactSet Consensus. Co guides to Q1 adjusted EBITDA of $160-175 mln.Co expects For Sale yr/yr revenue growth in Q1 to be in line with, or slightly better than its 11% Q4 2025 growth, driven by Residential revenue growth in the high single-digit range and Mortgages revenue growth of approximately 40%. Co expects Rentals revenue to grow approximately 40% yr/yr in Q1, driven by multifamily revenue.Co says its outlook reflects its expectation that challenging housing market conditions will continue in Q1.\n• Co expects For Sale yr/yr revenue growth in Q1 to be in line with, or slightly better than its 11% Q4 2025 growth, driven by Residential revenue growth in the high single-digit range and Mortgages revenue growth of approximately 40%.\n• Co expects Rentals revenue to grow approximately 40% yr/yr in Q1, driven by multifamily revenue.\n• Co says its outlook reflects its expectation that challenging housing market conditions will continue in Q1."},{"time":"16:08","ticker":"NKTR","headline":"Nektar Therapeutics announces proposed public offering of $300 mln of its shares of its common stock","body":"Nektar intends to use the net proceeds from the offering for general corporate purposes, which may include research and development, clinical development (including Phase 3 trials for rezpegaldesleukin) and manufacturing costs to support the advancement of its drug candidates, as well as other general corporate purposes."},{"time":"16:08","ticker":"RMBS","headline":"Rambus reaffirmed previously announced Q1 guidance","body":"• (Per the 2/2 earnings release) 2026 Q1 Financial OutlookLicensing billings (operational metric): $66M -- $72M (Both GAAP & Non-GAAP)Product revenue: $84M -- $90M (Both GAAP & Non-GAAP)Contract and other revenue: $21M -- $27M (Both GAAP & Non-GAAP)Total operating costs and expenses:GAAP: $121M -- $117MNon-GAAP: $104M -- $100MInterest and other income (expense), net: $6M (Both GAAP & Non-GAAP)Diluted share count: 110 million (Both GAAP & Non-GAAP)\n• Licensing billings (operational metric): $66M -- $72M (Both GAAP & Non-GAAP)\n• Product revenue: $84M -- $90M (Both GAAP & Non-GAAP)\n• Contract and other revenue: $21M -- $27M (Both GAAP & Non-GAAP)\n• Total operating costs and expenses:GAAP: $121M -- $117MNon-GAAP: $104M -- $100M\n• GAAP: $121M -- $117M\n• Non-GAAP: $104M -- $100M\n• Interest and other income (expense), net: $6M (Both GAAP & Non-GAAP)\n• Diluted share count: 110 million (Both GAAP & Non-GAAP)"},{"time":"16:07","ticker":"CCNE","headline":"CNB Financial increases quarterly cash dividend to $0.19/share from $0.18/share","body":""},{"time":"16:06","ticker":"GLTO","headline":"Galecto announces proposed underwritten public offering of common stock and preferred stock","body":"Galecto intends to use the proceeds from the proposed underwritten public offering of its shares of common stock and Series C preferred stock, together with its cash and cash equivalents, for preclinical studies, clinical trials, and manufacturing in support of our antibody programs, as well as for additional research and development activities, working capital, and general corporate purposes"},{"time":"16:05","ticker":"UPST","headline":"Upstart announces that Co-founder and Chief Technology Officer Paul Gu will become Upstart's Chief Executive Officer on May 1, 2026","body":"At that time, Co-founder Dave Girouard will remain Executive Chairman of Upstart's Board of Directors and serve as a special advisor to the company's CEO and leadership team."},{"time":"16:04","ticker":"GILD","headline":"Gilead Sciences increases quarterly cash dividend 3.8% to $0.82/share from $0.79/share","body":""},{"time":"16:04","ticker":"GILD","headline":"Gilead Sciences beats by $0.05, beats on revs; guides FY26 EPS in-line","body":"• Reports Q4 (Dec) earnings of $1.86 per share, excluding non-recurring items, $0.05 better than the FactSet Consensus of $1.81; revenues rose 4.7% year/year to $7.92 bln vs the $7.69 bln FactSet Consensus.\n• Biktarvy (bictegravir 50mg/emtricitabine 200mg/tenofovir alafenamide (\"TAF\") 25mg) sales increased 5% to $4.0 billion in the fourth quarter 2025 compared to the same period in 2024, primarily driven by higher demand and favorable inventory dynamics, partially offset by lower average realized price.\n• Descovy (FTC 200mg/TAF 25mg) sales increased 33% to $819 million in the fourth quarter 2025 compared to the same period in 2024, primarily driven by higher average realized price and higher demand for HIV prevention.\n• Co issues in-line guidance for FY26, sees EPS of $8.45-$8.85, excluding non-recurring items, vs. $8.79 FactSet Consensus. Sees Product Sales of $29.6-$30.0 bln."},{"time":"16:03","ticker":"NMIH","headline":"NMI Hldgs beats by $0.01","body":"• Reports Q4 (Dec) earnings of $1.20 per share, excluding non-recurring items, $0.01 better than the FactSet Consensus of $1.19. Net premiums earned increased 6% yr/yr to $152.5 mln."},{"time":"16:03","ticker":"PLTR","headline":"Palantir Technologies announces the extension of its collaboration with Airbus (EADSY) through a multi-year agreement, confirming a relationship that has driven innovation across the aerospace industry for over a decade","body":"• Under this renewed contract, Airbus will continue to rely on Palantir for Skywise, its civil aviation open data platform.\n• The Skywise platform enhances aircraft and equipment designs and enables greater efficiency, safety and sustainability in the production of civil aircraft across the Airbus industrial footprint. It also improves the performance of airlines' operations by combining in-flight engineering and operational data in an analytic rich environment enabling airlines to address their main challenges.\n• This renewed commitment comes at a pivotal time, as the aerospace sector faces demands for innovation, agility, and competitiveness. With this renewed collaboration, Palantir will provide Airbus and its customers with continued access to cutting-edge, scalable technology while upholding the highest standards of security, confidentiality and data governance."},{"time":"16:03","ticker":"AEIS","headline":"Advanced Energy beats by $0.16, beats on revs; guides Q1 EPS mostly above consensus, revs above consensus","body":"• Reports Q4 (Dec) earnings of $1.94 per share, excluding non-recurring items, $0.16 better than the FactSet Consensus of $1.78; revenues rose 17.8% year/year to $489.4 mln vs the $473.89 mln FactSet Consensus.\n• Co issues guidance for Q1, sees EPS of $1.69-2.19, excluding non-recurring items, vs. $1.70 FactSet Consensus; sees Q1 revs of $480-520 mln vs. $470.16 mln FactSet Consensus."},{"time":"16:03","ticker":"UFCS","headline":"United Fire Group reports fourth quarter and full year 2025 results; declares 25% increase in quarterly dividend to $0.20 per share","body":"Full year net income of $4.48 per diluted share and adjusted operating income of $4.60 per diluted shareClick here for full release."},{"time":"16:02","ticker":"LSCC","headline":"Lattice Semi reports EPS in-line, beats on revs; guides Q1 EPS above consensus, revs above consensus","body":"• Reports Q4 (Dec) earnings of $0.32 per share, excluding non-recurring items, in-line with the FactSet Consensus of $0.32; revenues rose 24.2% year/year to $145.79 mln vs the $143.19 mln FactSet Consensus.\n• Co issues upside guidance for Q1, sees EPS of $0.34-0.38, excluding non-recurring items, vs. $0.33 FactSet Consensus; sees Q1 revs of $158-172 mln vs. $148.16 mln FactSet Consensus."},{"time":"16:01","ticker":"CAMT","headline":"Camtek announces that it has received a $25 million Hawk systems order from a tier-1 IDM for AI applications","body":"This follows a series of smaller repeating orders from this IDM in recent months for the same applications, such that the total aggregate value of orders received is $45 million."}],"fetchedAt":1770800720822},"savedAt":1770800720822}