{"data":{"updated":"2/20/2026, 3:24:40 PM","entries":[{"time":"09:58","ticker":"OWL","headline":"Blue Owl's $4 bln AI Data-center plan encounters financing roadblock as lenders shy away from CoreWeave (CRWV) credit risk, according to Business Insider","body":"Business Insider"},{"time":"09:53","ticker":"OPTNX","headline":"Early Options Activity","body":"• OPEN Feb 5.5 calls are seeing interest with the underlying stock up 15% with 6.6K contracts trading vs. open int of 30.8K, pushing implied vol up around 14 points to ~100%. Co reported earnings last night.\n• TSLA Feb 407.5 puts are seeing interest with 4.0K contracts trading vs. open int of 4.7K, pushing implied vol up around 3 points to ~43%. Co is expected to report earnings late April.\n• TXRH implied vol is lower following earnings/guidance"},{"time":"09:45","ticker":"ECONX","headline":"February S&amp;P Global U.S. Services PMI - Prelim 52.3 vs. 52.7","body":""},{"time":"09:45","ticker":"ECONX","headline":"February S&amp;P Global U.S. Manufacturing PMI - Prelim 51.2 vs. 52.4","body":""},{"time":"09:32","ticker":"WIRES","headline":"On The Wires","body":"• Prometheus Energetics, LLC, a U.S.-based merchant supplier of solid rocket motors and energetics and a joint venture between Kratos Defense & Security Solutions (KTOS) and RAFAEL Advanced Defense Systems Ltd., today marked a major milestone with the official groundbreaking of its new solid rocket motor manufacturing campus in Indiana. The ceremony, hosted jointly with the American Center for Manufacturing and Innovation, signals the transition of Prometheus from launch phase into full execution of its domestic production strategy. The ceremony was attended by senior government leaders, along with state and local officials, industry partners, and members of the surrounding Indiana community, underscoring the broad national and regional support for the Prometheus campus.\n• LiveRamp (RAMP) announces a partnership with Scowtt, the AI-powered advertising optimization platform, to integrate Scowtt's predictive AI models into LiveRamp's data collaboration platform. As the first such partnership of its kind, LiveRamp and Scowtt will deliver unmatched value-based performance optimization to major platforms and programmatic destinations, seamlessly driving superior outcomes for every marketer.\n• The CV9035 MkIV for the Armed Forces of the Slovak Republic has been unveiled during a ceremonial rollout at BAE Systems (BAESY) Hgglunds in Sweden.\n• Bath & Body Works (BBWI) announces its official launch in Amazon's (AMZN) U.S. stores, making it easier than ever for consumers to discover and shop the brand's iconic fragrances and most loved products."},{"time":"09:08","ticker":"WRAPX","headline":"S&amp;P futures vs fair value: -13.00. Nasdaq futures vs fair value: -86.00.","body":"The stock market is on track for a lower opening following a hefty slate of economic data this morning. Personal income increased 0.3% month-over-month in December, as expected, following an upwardly revised 0.4% increase (from 0.3%) in November. Personal spending was up 0.4% month-over-month (Briefing.com consensus: 0.2%) following a downwardly revised 0.4% increase (from 0.5%) in November. The PCE Price Index jumped 0.4% month-over-month (Briefing.com consensus: 0.3%), while the core PCE Price Index, which excludes food and energy, also rose 0.4% month-over-month. On a year-over-year basis, the PCE Price Index increased 2.9%, versus 2.8% in November, and the core PCE Price Index increased 3.0%, versus 2.8% in November. The key takeaway from the report, other than the fact that spending outpaced income in December, is that the core PCE Price Index sported a 3-handle on a year-over-year basis. This is a key inflation gauge for the Fed, and it doesn't hold the key to a near-term rate cut. The Advance Q4 GDP report also had a mixed tone. Overall growth was disappointing, with real GDP increasing at an annual rate of 1.4% (Briefing.com consensus: 3.0%) on the heels of a 4.4% increase in the third quarter. The GDP Price Deflator increased 3.6% (Briefing.com consensus: 3.3%) versus 3.8% in the third quarter. The key takeaway from the report was the combination of weak growth and stubbornly high inflation in the fourth quarter, both of which run afoul of a market narrative that has been concentrated on stronger growth and lower inflation."},{"time":"09:02","ticker":"RTX","headline":"RTX's Collins Aerospace showcased its Sidekick mission autonomy software in a successful test flight of a YFQ-42A, an uncrewed jet developed by General Atomics Aeronautical Systems, Inc. for the U.S. Air Force's Collaborative Combat Aircraft program","body":"• The flight test paired uncrewed aircraft with crewed fighter jets to enhance sensor range, increase weapon effectiveness, and improve overall mission success.\n• During the flight test, autonomy mode was engaged to enable a four-hour autonomous flight managed by a human operator on the ground.\n• The successful test showcased seamless integration between Collins' autonomy software and the YFQ-42A's mission systems, ensuring precise piloting commands. This marks a significant step forward in support of the U.S. Air Force's efforts to advance its CCA program."},{"time":"09:02","ticker":"WRAPX","headline":"S&amp;P futures vs fair value: -13.00. Nasdaq futures vs fair value: -82.00.","body":"• In economic data: Japan's January National CPI -0.2% m/m (last -0.2%); 1.5% yr/yr (last 2.1%). National Core CPI 2.0% yr/yr, as expected (last 2.4%). Flash February Manufacturing PMI 52.8 (expected 51.3; last 51.5) and flash Services PMI 53.8 (last 53.7) Hong Kong's January Unemployment Rate 3.9% (last 3.8%) Australia's flash February Manufacturing PMI 51.5 (last 52.3) and flash Services PMI 52.2 (last 52.3) New Zealand's January trade deficit NZD519 mln (expected deficit of NZD745 mln; last deficit of NZD88 mln) India's flash February Manufacturing PMI 57.5 (last 55.4) and flash Services PMI 58.4 (last 58.5)\n• Japan's January National CPI -0.2% m/m (last -0.2%); 1.5% yr/yr (last 2.1%). National Core CPI 2.0% yr/yr, as expected (last 2.4%). Flash February Manufacturing PMI 52.8 (expected 51.3; last 51.5) and flash Services PMI 53.8 (last 53.7)\n• Hong Kong's January Unemployment Rate 3.9% (last 3.8%)\n• Australia's flash February Manufacturing PMI 51.5 (last 52.3) and flash Services PMI 52.2 (last 52.3)\n• New Zealand's January trade deficit NZD519 mln (expected deficit of NZD745 mln; last deficit of NZD88 mln)\n• India's flash February Manufacturing PMI 57.5 (last 55.4) and flash Services PMI 58.4 (last 58.5)\n• Japan's Nikkei: -1.1%\n• Hong Kong's Hang Seng: -1.1%\n• China's Shanghai Composite: CLOSED\n• India's Sensex: +0.4%\n• South Korea's Kospi: +2.3%\n• Australia's ASX All Ordinaries: -0.1%\n• In economic data: Eurozone's flash February Manufacturing PMI 50.8 (expected 49.9; last 49.5) and flash Services PMI 51.8 (expected 51.9; last 51.6) Germany's January PPI -0.6% m/m (expected 0.3%; last -0.2%); -3.0% yr/yr (expected -2.1%; last -2.5%). Flash February Manufacturing PMI 50.7 (expected 49.6; last 49.1) and flash Services PMI 53.4 (expected 52.4; last 52.4) U.K.'s January Retail Sales 1.8% m/m (expected 0.2%; last 0.4%); 4.5% yr/yr (expected 2.8%; last 1.9%). January Core Retail Sales 2.0% m/m (expected 0.2%; last 0.3%); 5.5% yr/yr (expected 3.6%; last 2.5%). February flash Manufacturing PMI 52.0 (expected 51.5; last 51.8) and flash Services PMI 53.9 (expected 53.5; last 54.0) France's flash February Manufacturing PMI 49.9 (expected 50.9; last 51.2) and flash Services PMI 49.6 (expected 49.1; last 48.4)\n• Eurozone's flash February Manufacturing PMI 50.8 (expected 49.9; last 49.5) and flash Services PMI 51.8 (expected 51.9; last 51.6)\n• Germany's January PPI -0.6% m/m (expected 0.3%; last -0.2%); -3.0% yr/yr (expected -2.1%; last -2.5%). Flash February Manufacturing PMI 50.7 (expected 49.6; last 49.1) and flash Services PMI 53.4 (expected 52.4; last 52.4)\n• U.K.'s January Retail Sales 1.8% m/m (expected 0.2%; last 0.4%); 4.5% yr/yr (expected 2.8%; last 1.9%). January Core Retail Sales 2.0% m/m (expected 0.2%; last 0.3%); 5.5% yr/yr (expected 3.6%; last 2.5%). February flash Manufacturing PMI 52.0 (expected 51.5; last 51.8) and flash Services PMI 53.9 (expected 53.5; last 54.0)\n• France's flash February Manufacturing PMI 49.9 (expected 50.9; last 51.2) and flash Services PMI 49.6 (expected 49.1; last 48.4)\n• STOXX Europe 600: +0.4%\n• Germany's DAX: +0.2%\n• U.K.'s FTSE 100: +0.4%\n• France's CAC 40: +0.7%\n• Italy's FTSE MIB: +1.1%\n• Spain's IBEX 35: +0.4%"},{"time":"08:56","ticker":"SPAI","headline":"Safe Pro Group has been awarded a subcontract agreement to supply the U.S. Government AI processing systems under a $1 mln subcontract from a U.S. Government prime contractor","body":"The systems' internal development and low rate initial production (LRIP) supporting this award were funded under strategic investments from leading U.S. firms including ONDAS Inc. (ONDS) and Unusual Machines Inc. (UMAC)."},{"time":"08:38","ticker":"LAES","headline":"SEALSQ Corp and Quobly have mutually agreed to halt discussions regarding a potential majority investment or acquisition of Quobly by SEALSQ","body":"• The parties will instead explore the possibility of a minority investment, to be discussed once Quobly launches its Series A financing round.\n• This decision reflects a shared preference for a minority investment structure that is more compatible with the current pace of quantum computing investments in France."},{"time":"08:37","ticker":"MED","headline":"Medifast announces that OPTAVIA's comprehensive metabolic health system is available for reimbursement on select insurance plans using Health Savings Accounts and Flexible Spending Accounts","body":"• OPTAVIA clients may be able to save up to 40% on program costs by working with their medical provider and insurance administrator to use pre-tax medical funds, offering accessibility for those prioritizing their metabolic health.\n• This milestone reinforces Medifast's position as a science-driven health and wellness leader, with a metabolic reset plan that reverses metabolic dysfunction - a widespread but often overlooked health concern, with more than 90% of U.S. adults classified as metabolically unhealthy. OPTAVIA is designed to address these challenges head-on, combining a science-backed system with coaching to guide clients toward improvements in their metabolic health, targeting the root cause of metabolic dysfunction."},{"time":"08:36","ticker":"WRAPX","headline":"S&amp;P futures vs fair value: -15.00. Nasdaq futures vs fair value: -67.00.","body":"The S&P 500 futures currently trade 15 points below fair value. Just released, personal income increased 0.3% month-over-month (Briefing.com consensus 0.3%) in December after an upwardly revised 0.4% increase in November (from 0.3%). Personal spending was up 0.4% in December (Briefing.com consensus 0.2%) after a downwardly revised 0.4% increase (from 0.5%) in November. The PCE Price Index was up 0.4% month-over-month in December (Briefing.com consensus 0.3%) while the core PCE Price Index was up 0.4% (Briefing.com consensus 0.4%). The advance Q4 GDP reading came in at 1.4% (Briefing.com consensus 3.0%). The advance GDP Deflator registered at 3.6% (Briefing.com consensus 3.3%)."},{"time":"08:36","ticker":"NUE","headline":"Nucor announces that John L. Sullivan, Vice President, Treasurer and General Manager of Investor Relations, will be promoted to Chief Financial Officer, Treasurer and Executive Vice President effective March 1, 2026","body":"He will succeed Steve Laxton, who was promoted to President and Chief Operating Officer effective January 1, 2026."},{"time":"08:35","ticker":"IBRX","headline":"ImmunityBio announces a partnership with Biopharma and Cigalah, two of the largest and most respected healthcare commercial and distribution companies in the Middle East, to launch ANKTIVA in Saudi Arabia and, over time, across the broader MENA region","body":"• Biopharma & Cigalah are two of the largest pharmaceutical commercial distributors in the Middle East and North Africa.\n• ImmunityBio established a wholly owned subsidiary in the Kingdom of Saudi Arabia to support physicians and healthcare systems throughout the MENA region.\n• The Registration Certificate of Pharmaceutical Product with pricing has been issued to ImmunityBio from the Saudi FDA.\n• ANKTIVA will be available for distribution within the next 60 days.\n• Initiated discussion with Saudi FDA and UAE regulatory authorities to expand ANKTIVA indications beyond Lung and Bladder cancers."},{"time":"08:33","ticker":"BTGO","headline":"BitGo Holdings and Figure Technology Solutions (FIGR) announce the completion of the first blockchain-native equity trades executed through their integrated infrastructure for blockchain-native equities on Figure's Alternative Trading System","body":""},{"time":"08:31","ticker":"FIHL","headline":"Fidelis Insurance Holdings Limited increases common share repurchase authorization, bringing the total current authorization to $400 million","body":""},{"time":"08:31","ticker":"ECONX","headline":"Q4 Chain Deflator-Adv. 3.6%% vs. 3.3% Briefing.com consensus; Q3 was 3.8%","body":""},{"time":"08:30","ticker":"ECONX","headline":"December PCE Prices Core 0.4% vs. 0.4% Briefing.com consensus; prior 0.2%","body":""},{"time":"08:30","ticker":"ECONX","headline":"December Personal Spending 0.4% vs. 0.2% Briefing.com consensus; prior revised to 0.4% from 0.5%","body":""},{"time":"08:30","ticker":"ECONX","headline":"Q4 GDP-Adv. 1.4% vs. 3.0% Briefing.com consensus; Q3 was 4.3%","body":""},{"time":"08:30","ticker":"ECONX","headline":"December PCE Prices 0.4% vs. 0.3% Briefing.com consensus; prior 0.2%","body":""},{"time":"08:30","ticker":"ECONX","headline":"December Personal Income 0.3% vs. 0.3% Briefing.com consensus; prior revised to 0.4% from 0.3%","body":""},{"time":"08:14","ticker":"JACK","headline":"Jack In The Box 9.86% stakeholder Biglari Capital issues statement on earnings","body":"• \"Disastrous Quarterly Results Confirm the Need for Urgent ActionFor any shareholder still weighing whether Chairman Goebel's continued presence poses a real risk, JACK's first-quarter fiscal 2026 earnings provide the answer - in case the last 17 years were not convincing enough. The results are terrible by any measure:Same-store sales declined 6.7% systemwide, a sharp deterioration from the 0.4% gain in the same period last yearAdjusted EBITDA declined approx. 23% year over year; and the adjusted EBITDA margin fell to 19.5%, down 400 bps from the comparable period last year;EPS from continuing operations fell to $0.75 - a decline of 54% from the same period last year.\n• For any shareholder still weighing whether Chairman Goebel's continued presence poses a real risk, JACK's first-quarter fiscal 2026 earnings provide the answer - in case the last 17 years were not convincing enough. The results are terrible by any measure:\n• Same-store sales declined 6.7% systemwide, a sharp deterioration from the 0.4% gain in the same period last year\n• Adjusted EBITDA declined approx. 23% year over year; and the adjusted EBITDA margin fell to 19.5%, down 400 bps from the comparable period last year;\n• EPS from continuing operations fell to $0.75 - a decline of 54% from the same period last year.\n• JACK's share price fell another 18% following the earnings announcement1.We Believe JACK's Board Is Incapable of Shifting Direction as Long as David Goebel Maintains Board InfluenceWe firmly believe these latest results are a direct consequence of the Board's continued reliance on Mr. Goebel, whose tenure has already led to massive shareholder value destruction, declining profitability, and an increased risk of financial insolvency.Since Mr. Goebel joined JACK's board in 20092:Shareholders have lost over $800 million in market value;Meanwhile, Mr. Goebel has collected over $3.7 million in total compensation.The value destruction is even higher since Mr. Goebel became chairman of the board in June 20203:Shareholders have lost over $1.2 billion in market value;Meanwhile, Mr. Goebel has collected over $1.8 million in total compensation.\"\n• We Believe JACK's Board Is Incapable of Shifting Direction as Long as David Goebel Maintains Board Influence\n• We firmly believe these latest results are a direct consequence of the Board's continued reliance on Mr. Goebel, whose tenure has already led to massive shareholder value destruction, declining profitability, and an increased risk of financial insolvency.\n• Since Mr. Goebel joined JACK's board in 20092:\n• Shareholders have lost over $800 million in market value;\n• Meanwhile, Mr. Goebel has collected over $3.7 million in total compensation.\n• The value destruction is even higher since Mr. Goebel became chairman of the board in June 20203:\n• Shareholders have lost over $1.2 billion in market value;\n• Meanwhile, Mr. Goebel has collected over $1.8 million in total compensation.\""},{"time":"08:07","ticker":"DUK","headline":"Duke Energy's nuclear fleet set a new reliability record in 2025, providing communities across the Carolinas with around-the-clock power customers can count on","body":"• Record capacity factor of 96.9% reached in 2025, marking new record for plant reliability.\n• Nuclear plants delivered approximately $600 million in savings for customers through federal nuclear production tax credits."},{"time":"08:07","ticker":"UPST","headline":"Upstart announces inaugural $200 mln Upstart Auto forward-flow agreement with Wafra","body":"• The agreement consists of a 12-month forward flow arrangement and is the first such agreement between Upstart and Wafra.\n• The arrangement supports Upstart's ability to deliver a consistent auto funding platform across its growing auto product vertical business and over a variety of economic environments."},{"time":"08:06","ticker":"WIRES","headline":"On The Wires","body":"• Western Alliance Bank (WAL) announced that OnQ, the leading retail display company, has secured an enhanced credit facility with the bank's Asset-Based Lending Group. Western Alliance Bank is supporting OnQ by providing a $7.5 million asset-based line of credit and customized treasury management solutions to support the company's current growth trajectory. The line of credit provides OnQ with flexibility as it scales its platform to serve a growing base of global retail brands.\n• Upstart Holdings (UPST) announced the previous sale of a $333 million aggregate portfolio of Upstart Auto assets to affiliates of Bayview Asset Management, LLC. The auto portfolio sale is the first major transaction between Upstart and Bayview. It demonstrates growing interest in Upstart's scaling auto platforms as well as strategic funding to optimize balance sheet usage for its newer products.\n• New Frontier Labs announced a strategic partnership with BitGo Bank & Trust, National Association (BTGO) under which BitGo will act as the issuer and primary custodian of FYUSD, a U.S. dollar-backed stablecoin designed for institutional adoption in Asian markets.\n• Starfighters Space, (FJET) announced that, after successful wind tunnel testing of the STARLAUNCH I rocket design, it is moving forward to Critical Design Review with support from GE Aerospace (GE). The CDR is intended to confirm design maturity and support the program's transition into its next phase of build and test planning."},{"time":"08:06","ticker":"BTGO","headline":"BitGo Holdings named issuer of FYUSD, bringing U.S.-aligned stablecoin standards to Asia","body":"The partnership marks an important step in extending U.S.-grade regulatory and custody standards into Asia's rapidly developing digital asset ecosystem. FYUSD is structured in alignment with the GENIUS Act framework and is intended to provide institutional users with a dollar-backed stablecoin that emphasizes transparency, reserve protection, and operational compliance"},{"time":"08:06","ticker":"NUTR","headline":"Nutraceutical and  Society Pass Incorporated (SOPA) respond to Nasdaq/SEC questions regarding status of trading of NUTR's securities; NusaTrip's operations remain normal and unaffected by trading suspension","body":"• Following NusaTrip's initial response on October 14, 2025 to Nasdaq's October 9, 2025 information request, Nasdaq issued follow-up requests for additional information. NusaTrip submitted written responses to these follow-up requests on November 17, 2025. On December 22, 2025, NusaTrip received a request from the SEC for the voluntary production of documents. NusaTrip submitted its responses to the SEC's request on January 20, 2026.\n• Trading in NusaTrip's securities on Nasdaq remains halted as of today's date. NusaTrip continues to cooperate fully with SEC and Nasdaq to resolve any outstanding matters. NusaTrip will provide further updates as appropriate.\n• NusaTrip wishes to inform its shareholders and the investing public that its daily business operations remain normal and have not been materially affected by the ongoing trading suspension."},{"time":"08:04","ticker":"TLSI","headline":"TriSalus Life Sciences prices its previously announced underwritten public offering of 9,756,100 shares of its common stock at a public offering price of $4.10 per share","body":""},{"time":"08:02","ticker":"RTX","headline":"RTX: The U.S. Navy has approved Raytheon's StormBreaker smart weapon for operational use on the F/A-18-E/F Super Hornet strike fighter","body":"Precision strike capability will increase fleet lethality and survivability."},{"time":"07:59","ticker":"WRAPX","headline":"S&amp;P futures vs fair value: -6.00. Nasdaq futures vs fair value: -28.00.","body":"• Amazon's (AMZN 204.72, -0.14, -0.0%) cloud unit had two outages due to errors involving its own artificial intelligence tools, according to Financial Times.\n• A spokesperson for Blue Owl Capital (OWL 11.18, -0.40, -3.5%) says the company is not halting investor liquidity, according to Reuters.\n• Newmont Corporation (NEM 121.00, -4.40, -3.5%) beat EPS expectations by $0.47 and beat revenue expectations.\n• NVIDIA (NVDA 186.91, -0.99, -0.5%) is close to completing a $30 billion investment in OpenAI, which will replace a $100 billion investment that was pledged last year, according to Financial Times.\n• Japan's CPI decelerated in January with Core CPI increasing at its slowest pace in two years.\n• However, flash Manufacturing PMI for February (52.8) showed accelerating activity.\n• Indonesia finalized its trade agreement with the U.S.\n• Bank Indonesia held its policy rate at 4.75% while Bangko Sentral ng Pilipinas cut its rate by 25 basis points to 4.25%.\n• Japan's January National CPI -0.2% m/m (last -0.2%); 1.5% yr/yr (last 2.1%). National Core CPI 2.0% yr/yr, as expected (last 2.4%). Flash February Manufacturing PMI 52.8 (expected 51.3; last 51.5) and flash Services PMI 53.8 (last 53.7)\n• Hong Kong's January Unemployment Rate 3.9% (last 3.8%)\n• Australia's flash February Manufacturing PMI 51.5 (last 52.3) and flash Services PMI 52.2 (last 52.3)\n• New Zealand's January trade deficit NZD519 mln (expected deficit of NZD745 mln; last deficit of NZD88 mln)\n• India's flash February Manufacturing PMI 57.5 (last 55.4) and flash Services PMI 58.4 (last 58.5)\n• Flash February Manufacturing and Services PMI readings from the region's major economies remained unimpressive for another month while readings from the U.K. outperformed.\n• The U.K. also reported strong retail sales growth for January.\n• European Central Bank President Lagarde repeated that she intends to serve through 2027 amid reports that she is looking to leave her post to get involved in shaping the next presidential election in France.\n• Eurozone's flash February Manufacturing PMI 50.8 (expected 49.9; last 49.5) and flash Services PMI 51.8 (expected 51.9; last 51.6)\n• Germany's January PPI -0.6% m/m (expected 0.3%; last -0.2%); -3.0% yr/yr (expected -2.1%; last -2.5%). Flash February Manufacturing PMI 50.7 (expected 49.6; last 49.1) and flash Services PMI 53.4 (expected 52.4; last 52.4)\n• U.K.'s January Retail Sales 1.8% m/m (expected 0.2%; last 0.4%); 4.5% yr/yr (expected 2.8%; last 1.9%). January Core Retail Sales 2.0% m/m (expected 0.2%; last 0.3%); 5.5% yr/yr (expected 3.6%; last 2.5%). February flash Manufacturing PMI 52.0 (expected 51.5; last 51.8) and flash Services PMI 53.9 (expected 53.5; last 54.0)\n• France's flash February Manufacturing PMI 49.9 (expected 50.9; last 51.2) and flash Services PMI 49.6 (expected 49.1; last 48.4)"},{"time":"07:53","ticker":"BONDX","headline":"Overnight Treasury Market Summary","body":"• U.S. Treasuries are on track for a slightly higher start in the belly ahead of the 8:30 ET release of the advance Q4 GDP (Briefing.com consensus 3.0%; prior 4.3%). The report will be released alongside the Personal Income/Outlays survey for December, though those figures will be factored into the GDP report. Treasury futures navigated a narrow sideways range in overnight trade even though the market received a big batch of data from Asia and Europe. Japan's CPI decelerated in January with Core CPI increasing at its slowest pace in two years. However, flash Manufacturing PMI for February (52.8) showed accelerating activity at a pace not seen since early 2022. In Europe, flash February Manufacturing and Services PMI readings from the region's major economies remained unimpressive for another month while readings from the U.K. outperformed. The U.K. also reported strong retail sales growth for January. On a side note, there has been some chatter that the Supreme Court could announce its opinion regarding tariffs today. Crude oil holds a modest loss while the U.S. Dollar Index is flat at 97.90.\n• Yield Check: 2-yr: -1 bp to 3.46% 3-yr: -2 bps to 3.48% 5-yr: -2 bps to 3.63% 10-yr: -2 bps to 4.06% 30-yr: UNCH at 4.70%\n• 2-yr: -1 bp to 3.46%\n• 3-yr: -2 bps to 3.48%\n• 5-yr: -2 bps to 3.63%\n• 10-yr: -2 bps to 4.06%\n• 30-yr: UNCH at 4.70%\n• News: Indonesia finalized its trade agreement with the U.S. Bank Indonesia held its policy rate at 4.75%. Bangko Sentral ng Pilipinas cut its rate by 25 basis points to 4.25%. European Central Bank President Lagarde repeated that she intends to serve through 2027 amid reports that she is looking to leave her post to get involved in shaping the next presidential election in France. Japan's January National CPI was down 0.2% m/m (last -0.2%) but up 1.5% yr/yr (last 2.1%). National Core CPI was up 2.0% yr/yr, as expected (last 2.4%). Flash February Manufacturing PMI hit 52.8 (expected 51.3; last 51.5) and flash Services PMI hit 53.8 (last 53.7). Hong Kong's January Unemployment Rate rose to 3.9% from 3.8%. Australia's flash February Manufacturing PMI hit 51.5 (last 52.3) and flash Services PMI hit 52.2 (last 52.3). New Zealand's January trade deficit reached NZD519 mln (expected deficit of NZD745 mln; last deficit of NZD88 mln). India's flash February Manufacturing PMI hit 57.5 (last 55.4) and flash Services PMI hit 58.4 (last 58.5). Eurozone's flash February Manufacturing PMI hit 50.8 (expected 49.9; last 49.5) and flash Services PMI hit 51.8 (expected 51.9; last 51.6). Germany's January PPI was down 0.6% m/m (expected 0.3%; last -0.2%), falling 3.0% yr/yr (expected -2.1%; last -2.5%). Flash February Manufacturing PMI hit 50.7 (expected 49.6; last 49.1) and flash Services PMI hit 53.4 (expected 52.4; last 52.4). U.K.'s January Retail Sales rose 1.8% m/m (expected 0.2%; last 0.4%), increasing 4.5% yr/yr (expected 2.8%; last 1.9%). January Core Retail Sales were up 2.0% m/m (expected 0.2%; last 0.3%), rising 5.5% yr/yr (expected 3.6%; last 2.5%). February flash Manufacturing PMI hit 52.0 (expected 51.5; last 51.8) and flash Services PMI hit 53.9 (expected 53.5; last 54.0).France's flash February Manufacturing PMI hit 49.9 (expected 50.9; last 51.2) and flash Services PMI hit 49.6 (expected 49.1; last 48.4).\n• Indonesia finalized its trade agreement with the U.S.\n• Bank Indonesia held its policy rate at 4.75%.\n• Bangko Sentral ng Pilipinas cut its rate by 25 basis points to 4.25%.\n• European Central Bank President Lagarde repeated that she intends to serve through 2027 amid reports that she is looking to leave her post to get involved in shaping the next presidential election in France.\n• Japan's January National CPI was down 0.2% m/m (last -0.2%) but up 1.5% yr/yr (last 2.1%). National Core CPI was up 2.0% yr/yr, as expected (last 2.4%). Flash February Manufacturing PMI hit 52.8 (expected 51.3; last 51.5) and flash Services PMI hit 53.8 (last 53.7). Hong Kong's January Unemployment Rate rose to 3.9% from 3.8%.\n• Australia's flash February Manufacturing PMI hit 51.5 (last 52.3) and flash Services PMI hit 52.2 (last 52.3).\n• New Zealand's January trade deficit reached NZD519 mln (expected deficit of NZD745 mln; last deficit of NZD88 mln).\n• India's flash February Manufacturing PMI hit 57.5 (last 55.4) and flash Services PMI hit 58.4 (last 58.5).\n• Eurozone's flash February Manufacturing PMI hit 50.8 (expected 49.9; last 49.5) and flash Services PMI hit 51.8 (expected 51.9; last 51.6).\n• Germany's January PPI was down 0.6% m/m (expected 0.3%; last -0.2%), falling 3.0% yr/yr (expected -2.1%; last -2.5%). Flash February Manufacturing PMI hit 50.7 (expected 49.6; last 49.1) and flash Services PMI hit 53.4 (expected 52.4; last 52.4).\n• U.K.'s January Retail Sales rose 1.8% m/m (expected 0.2%; last 0.4%), increasing 4.5% yr/yr (expected 2.8%; last 1.9%). January Core Retail Sales were up 2.0% m/m (expected 0.2%; last 0.3%), rising 5.5% yr/yr (expected 3.6%; last 2.5%). February flash Manufacturing PMI hit 52.0 (expected 51.5; last 51.8) and flash Services PMI hit 53.9 (expected 53.5; last 54.0).\n• France's flash February Manufacturing PMI hit 49.9 (expected 50.9; last 51.2) and flash Services PMI hit 49.6 (expected 49.1; last 48.4).\n• Commodities: WTI Crude: -0.5% to $66.10/bbl Gold: +0.9% to $5041.10/ozt Copper: +0.5% to $5.766/lb\n• WTI Crude: -0.5% to $66.10/bbl\n• Gold: +0.9% to $5041.10/ozt\n• Copper: +0.5% to $5.766/lb\n• Currencies: EUR/USD: UNCH at 1.1768 GBP/USD: +0.1% to 1.3477 USD/CNH: +0.1% to 6.9013 USD/JPY: +0.1% to 155.23\n• EUR/USD: UNCH at 1.1768\n• GBP/USD: +0.1% to 1.3477\n• USD/CNH: +0.1% to 6.9013\n• USD/JPY: +0.1% to 155.23\n• Data out Today: 8:30 ET: December Personal Income (Briefing.com consensus 0.3%; prior 0.3%), Personal Spending (Briefing.com consensus 0.2%; prior 0.5%), PCE Prices (Briefing.com consensus 0.3%; prior 0.2%), core PCE Prices (Briefing.com consensus 0.4%; prior 0.2%), advance Q4 GDP (Briefing.com consensus 3.0%; prior 4.3%) and advance Q4 Chain Deflator (Briefing.com consensus 3.3%; prior 3.8%) 9:45 ET: Flash February S&P Global U.S. Manufacturing PMI (prior 52.4) and flash February S&P Global U.S. Services PMI (prior 52.7) 10:00 ET: Final February University of Michigan Consumer Sentiment survey (Briefing.com consensus 57.3; prior 57.3) and December New Home Sales (Briefing.com consensus 714,000; prior NA)\n• 8:30 ET: December Personal Income (Briefing.com consensus 0.3%; prior 0.3%), Personal Spending (Briefing.com consensus 0.2%; prior 0.5%), PCE Prices (Briefing.com consensus 0.3%; prior 0.2%), core PCE Prices (Briefing.com consensus 0.4%; prior 0.2%), advance Q4 GDP (Briefing.com consensus 3.0%; prior 4.3%) and advance Q4 Chain Deflator (Briefing.com consensus 3.3%; prior 3.8%)\n• 9:45 ET: Flash February S&P Global U.S. Manufacturing PMI (prior 52.4) and flash February S&P Global U.S. Services PMI (prior 52.7)\n• 10:00 ET: Final February University of Michigan Consumer Sentiment survey (Briefing.com consensus 57.3; prior 57.3) and December New Home Sales (Briefing.com consensus 714,000; prior NA)"},{"time":"07:38","ticker":"PPL","headline":"PPL Corp reports EPS in-line, misses on revs; guides FY26 EPS in-line; Announces 4.6% increase to quarterly dividend","body":"• Reports Q4 (Dec) earnings of $0.41 per share, excluding non-recurring items, in-line with the FactSet Consensus of $0.41; revenues rose 2.8% year/year to $2.27 bln vs the $2.48 bln FactSet Consensus.\n• Co announces 4.6% increase in its quarterly common stock dividend, raising the dividend from $0.2725 per share to $0.2850 per share.\n• Co issues in-line guidance for FY26, sees EPS of $1.90-$1.98, excluding non-recurring items, vs. $1.95 FactSet Consensus.PPL also extended its 6% to 8% annual EPS growth target through 2029. The company expects to achieve compound annual growth near the top end of its targeted range through at least 2029 off of 2025 actual ongoing earnings of $1.81 per share, with stronger growth beginning in 2027 and continuing through 2029.\n• PPL also extended its 6% to 8% annual EPS growth target through 2029. The company expects to achieve compound annual growth near the top end of its targeted range through at least 2029 off of 2025 actual ongoing earnings of $1.81 per share, with stronger growth beginning in 2027 and continuing through 2029."},{"time":"07:35","ticker":"BHP","headline":"BHP Group's wholly-owned subsidiary and Faraday Copper Corp. have signed a non-binding letter of intent to explore a potential transaction whereby Faraday would acquire 100% of BHP's San Manuel property in Arizona, USA","body":"• In exchange, BHP would receive a 30% interest in the equity of Faraday, and commensurate shareholder and marketing rights. In addition, BHP has agreed to participate in any equity raise by Faraday, over a two-year period, up to a maximum aggregated subscription amount of US$20 million.\n• The LOI provides the basis through which BHP and Faraday will explore pathways for the restart of the San Manuel copper mine and development of a new copper hub in Arizona. Consolidated development of the adjacent Copper Creek and San Manuel properties would benefit from neighbouring land positions, existing infrastructure at San Manuel, and enhanced capital efficiency. The brownfield redevelopment of San Manuel, under this ownership structure, provides the potential for new copper units to be brought to market at pace. The LOI is non-binding, other than an exclusivity period, financing participation as outlined above, and confidentiality provisions. Completion of the proposed transaction is subject to final due diligence, agreement of definitive documentation and customary approvals."},{"time":"07:34","ticker":"FENC","headline":"Fennec Pharmaceuticals announces new real world data supporting potential use of PEDMARK in adults with head and neck cancers were presented as a digital poster at the 2026 Multidisciplinary Head and Neck Cancers Symposium","body":"• Administration of PEDMARK Approximately Six Hours After Cisplatin was Shown to Be Safe & Easily Integrated into Care for Adults with Head & Neck Cancers\n• Early Signals of Hearing Preservation Highlight the Potential of PEDMARK to Address Cisplatin-Induced Hearing Loss, a Critical Survivorship Gap, Without Compromising Cisplatin's Established Antitumor Activity\n• Majority of High-Risk Patients Receiving PEDMARK Demonstrated No Measurable Hearing Loss During or After Treatment Despite Prevalence of Baseline Hearing Impairment --"},{"time":"07:33","ticker":"OGN","headline":"Organon Audit Committee has completed its independent review; independent review did not find evidence of improper conduct","body":"• As previously disclosed, the Audit Committee of the Board of Directors conducted an independent review of the information brought to the Audit Committee's attention on February 11, 2026 relating to the timing of the Company's purchases of biosimilars from a supplier in prior years. The Audit Committee has completed its independent review with the assistance of outside counsel.\n• The review determined that no action is required. The independent review did not find evidence of improper conduct related to the transactions in question and did not identify any matters requiring adjustments to the Company's previously issued financial statements or disclosures in its filings with the Securities and Exchange Commission (the \"SEC\"). The Company intends to timely file its Form 10-K for the year ended December 31, 2025."},{"time":"07:30","ticker":"SUMRX","headline":"European Markets Update: DAX +0.3%, FTSE +0.5%, CAC +0.8%","body":"• In economic data: Eurozone's flash February Manufacturing PMI 50.8 (expected 49.9; last 49.5) and flash Services PMI 51.8 (expected 51.9; last 51.6) Germany's January PPI -0.6% m/m (expected 0.3%; last -0.2%); -3.0% yr/yr (expected -2.1%; last -2.5%). Flash February Manufacturing PMI 50.7 (expected 49.6; last 49.1) and flash Services PMI 53.4 (expected 52.4; last 52.4) U.K.'s January Retail Sales 1.8% m/m (expected 0.2%; last 0.4%); 4.5% yr/yr (expected 2.8%; last 1.9%). January Core Retail Sales 2.0% m/m (expected 0.2%; last 0.3%); 5.5% yr/yr (expected 3.6%; last 2.5%). February flash Manufacturing PMI 52.0 (expected 51.5; last 51.8) and flash Services PMI 53.9 (expected 53.5; last 54.0) France's flash February Manufacturing PMI 49.9 (expected 50.9; last 51.2) and flash Services PMI 49.6 (expected 49.1; last 48.4)\n• Eurozone's flash February Manufacturing PMI 50.8 (expected 49.9; last 49.5) and flash Services PMI 51.8 (expected 51.9; last 51.6)\n• Germany's January PPI -0.6% m/m (expected 0.3%; last -0.2%); -3.0% yr/yr (expected -2.1%; last -2.5%). Flash February Manufacturing PMI 50.7 (expected 49.6; last 49.1) and flash Services PMI 53.4 (expected 52.4; last 52.4)\n• U.K.'s January Retail Sales 1.8% m/m (expected 0.2%; last 0.4%); 4.5% yr/yr (expected 2.8%; last 1.9%). January Core Retail Sales 2.0% m/m (expected 0.2%; last 0.3%); 5.5% yr/yr (expected 3.6%; last 2.5%). February flash Manufacturing PMI 52.0 (expected 51.5; last 51.8) and flash Services PMI 53.9 (expected 53.5; last 54.0)\n• France's flash February Manufacturing PMI 49.9 (expected 50.9; last 51.2) and flash Services PMI 49.6 (expected 49.1; last 48.4)\n• STOXX Europe 600: +0.4% (+1.7% this week)\n• Germany's DAX: +0.3% (+0.8% this week)\n• U.K.'s FTSE 100: +0.5% (+2.2% this week)\n• France's CAC 40: +0.8% (+1.8% this week)\n• Italy's FTSE MIB: +1.0% (+1.8% this week)\n• Spain's IBEX 35: +0.5% (+2.4% this week)\n• EUR/USD: -0.1% to 1.1765\n• GBP/USD: +0.1% to 1.3473\n• USD/CHF: +0.3% to 0.7763"},{"time":"07:22","ticker":"SCANX","headline":"Gapping up/Gapping down","body":"• OPEN +18.1%, WK +11.6% (also increases share repurchase authorization by $250 mln), RNG +11.2% (initiates dividend; also increases share repurchase authorization to $500 mln), TNDM +10.2%, TLX +10.1%, ASIC +9.8% (also authorizes new $50 mln share repurchase program), HG +9.2% (also declares $2/sh special dividend), HLIT +8.1% (also selected by izzi for its expansion), ALRM +8.1%, JAKK +8%, RMNI +7.7%, FET +7%, OIS +6.9%, AXTI +5.6%, PRDO +4.7%, FND +4.4%, TXRH +3.8% (also increases dividend), FIX +3.8% (also increases dividend), ASIX +3.8%, GH +3.4%, AMN +3.3%, LYV +2.5%, DNOW +2.4%, IRTC +2.2%, INDI +1.5%, OLED +1% (also increases dividend)\n• KOS +5.6% (secures Ghana license extensions to 2040; updates operations and financing)\n• APP +4.5% (unconfirmed rumors of OpenAI partnership)\n• NNN +2% (names new chairperson)\n• CTRN +1.9% (announces board transition, finance committee leadership update, and extension of cooperation agreement with Fund 1)\n• VRRM +1.1% (expands program in Hawaii)\n• GDYN +1% (launches NVIDIA Solution Center)\n• HOOD +0.9% (reports January operating data)\n• NOG +0.9% (NOG and INR adjust ownership split of pending joint Ohio Utica acquisition)\n• ORLA +0.9% (preliminary assessment for Camino Rojo)\n• CDP +0.9% (increases dividend)\n• GRAL -45.3% (also topline results from NHS-Galleri trial), INSG -15.7%, VICR -12.4%, AKAM -11.7%, ACH -10.9%, CC -9.8%, VAL -8%, CPRT -7.3%, ARDX -6.1%, TVTX -5.7%, ED -4.9%, DBX -4.8%, LZ -4.3% (also increases share repurchase authorization by $100 mln), HBM -4.3%, NEM -3.4%, MTUS -3.2%, RMAX -2.9%, ST -2.4%, ONTO -2.3%, PLSE -2.2% (also enters sales agreement; may offer shares), IAUX -2.1%, WU -2.1%, RIG -2%, ESAB -1.9%, AU -1.6%, WSC -1.5%, HHH -1.5%, CWST -1.3%\n• CADL -12.9% (prices offering of 13,725,491 shares of common stock at $12.75 per share)\n• AGIG -9.3% (prices offering of 5,934,718 shares of common stock for gross proceeds of $20 mln)\n• WTTR -7.5% (commences $175 mln stock offering; also files mixed securities shelf offering)\n• EGO -4.8% (provides 2026 gold production guidance)\n• TLSI -4.6% (stock offering)\n• CXW -3.1% (I.C.E. planning to scale back its network of 200+ detention centers, according to Bloomberg)\n• ENGN -2.3% (files for $400 mln mixed securities shelf offering)\n• VIST -1.5% (provides update on acquisition of EQNR assets in Vaca Muerta)\n• INR -1.4% (NOG and INR adjust ownership split of pending joint Ohio Utica acquisition)"},{"time":"07:08","ticker":"NVO","headline":"Novo Nordisk A/S Board of Directors proposes re-election of Lars Rebien Srensen as Chair and re-election of Cees de Jong as Vice Chair at the March 26 Annual General Meeting","body":""},{"time":"07:08","ticker":"OIS","headline":"Oil States beats by $0.03, reports revs in-line","body":"• Reports Q4 (Dec) earnings of $0.13 per share, excluding non-recurring items, $0.03 better than the FactSet Consensus of $0.10; revenues rose 8.4% year/year to $178.5 mln vs the $178.92 mln FactSet Consensus."},{"time":"07:06","ticker":"CCOI","headline":"Cogent Communications beats by $0.42, misses on revs","body":"• Reports Q4 (Dec) loss of $0.64 per share, $0.42 better than the FactSet Consensus of ($1.06); revenues fell 4.7% year/year to $240.5 mln vs the $243.91 mln FactSet Consensus.\n• DividendCogent approved a quarterly dividend of $0.02 per share for Q1 2026.Cogent paid four quarterly dividends in 2025 totaling $150.1 million, or $3.05 per share.\n• Cogent approved a quarterly dividend of $0.02 per share for Q1 2026.\n• Cogent paid four quarterly dividends in 2025 totaling $150.1 million, or $3.05 per share."},{"time":"07:05","ticker":"WU","headline":"Western Union beats by $0.02, misses on revs; guides FY26 EPS in-line, revs above consensus","body":"• Reports Q4 (Dec) earnings of $0.45 per share, excluding non-recurring items, $0.02 better than the FactSet Consensus of $0.43; revenues fell 4.7% year/year to $1.01 bln vs the $1.04 bln FactSet Consensus.\n• Consumer Services segment revenue grew 15% on a reported basis, or 26% on an adjusted basis compared to the prior year period, driven by the expansion of our Travel Money business, which included the acquisition of Eurochange Limited, and higher revenues from our bill pay business.\n• Branded Digital revenue increased 7% on a reported basis, and 6% on an adjusted basis, with transaction growth of 13% compared to the prior year period. The Branded Digital business represented 30% and 39% of total Consumer Money Transfer revenues and transactions in the fourth quarter, respectively.\n• Co issues guidance for FY26, sees EPS of $1.75-$1.85, excluding non-recurring items, vs. $1.79 FactSet Consensus; sees FY26 revs growth of 6-9%, equating to revenue of $4.35-$4.47 bln vs. $4.12 bln FactSet Consensus."},{"time":"07:03","ticker":"NVT","headline":"nVent Electric announced the hiring of Mellinda Devese as Executive Vice President and Chief Supply Chain Officer, effective March 16","body":"Devese joins nVent from GE HealthCare (GEHC)."},{"time":"07:02","ticker":"GTBIF","headline":"Green Thumb announces an additional $50 million senior debt financing","body":"The credit facility has a maturity date of September 11, 2029 and will continue to bear interest from the date of issue at Secured Overnight Financing Rate (SOFR) + 500 basis points. This transaction did not involve the issuance of any Green Thumb equity to any of the participating banks in the syndication."},{"time":"07:00","ticker":"AZN","headline":"AstraZeneca: Fixed-duration Calquence combo approved in US","body":"• AstraZeneca's Calquence (acalabrutinib) in combination with venetoclax has been approved in the US as the first all-oral, fixed-duration regimen for the treatment of adult patients with chronic lymphocytic leukaemia and small lymphocytic lymphoma.\n• Jennifer Brown, MD, PhD, Director of the CLL Center of the Division of Hematologic Malignancies, Dana-Farber Cancer Institute, and the Worthington and Margaret Collette Professor of Medicine at Harvard Medical School, and principal investigator of the AMPLIFY trial, said: \"The continuous regimens frequently used to treat chronic lymphocytic leukaemia often come with side effects that may become burdensome to patients over time. The US approval of the Calquence combination offers patients an all-oral, 14-month, fixed-duration treatment option that is highly effective and well-tolerated, and gives physicians greater flexibility to tailor treatment plans for individual patient needs and goals.\""},{"time":"07:00","ticker":"SUMRX","headline":"Asian Markets Close: Nikkei -1.1%, Hang Seng -1.1%, Shanghai CLOSED","body":"• In economic data: Japan's January National CPI -0.2% m/m (last -0.2%); 1.5% yr/yr (last 2.1%). National Core CPI 2.0% yr/yr, as expected (last 2.4%). Flash February Manufacturing PMI 52.8 (expected 51.3; last 51.5) and flash Services PMI 53.8 (last 53.7) Hong Kong's January Unemployment Rate 3.9% (last 3.8%) Australia's flash February Manufacturing PMI 51.5 (last 52.3) and flash Services PMI 52.2 (last 52.3) New Zealand's January trade deficit NZD519 mln (expected deficit of NZD745 mln; last deficit of NZD88 mln) India's flash February Manufacturing PMI 57.5 (last 55.4) and flash Services PMI 58.4 (last 58.5)\n• Japan's January National CPI -0.2% m/m (last -0.2%); 1.5% yr/yr (last 2.1%). National Core CPI 2.0% yr/yr, as expected (last 2.4%). Flash February Manufacturing PMI 52.8 (expected 51.3; last 51.5) and flash Services PMI 53.8 (last 53.7)\n• Hong Kong's January Unemployment Rate 3.9% (last 3.8%)\n• Australia's flash February Manufacturing PMI 51.5 (last 52.3) and flash Services PMI 52.2 (last 52.3)\n• New Zealand's January trade deficit NZD519 mln (expected deficit of NZD745 mln; last deficit of NZD88 mln)\n• India's flash February Manufacturing PMI 57.5 (last 55.4) and flash Services PMI 58.4 (last 58.5)\n• Japan's Nikkei: -1.1% (-0.2% for the week)\n• Hong Kong's Hang Seng: -1.1% (-0.6% for the week)\n• China's Shanghai Composite: CLOSED (UNCH for the week)\n• India's Sensex: +0.4% (+0.2% for the week)\n• South Korea's Kospi: +2.3% (+5.5% for the week)\n• Australia's ASX All Ordinaries: -0.1% (+1.8% for the week)\n• USD/JPY: +0.1% to 155.23\n• USD/CNH: +0.1% to 6.9017\n• USD/INR: UNCH at 90.97"},{"time":"06:57","ticker":"BTDR","headline":"Bitdeer Technologies prices registered direct offering of 5,503,030 Class A Ordinary Shares to certain holders of its 5.25% convertible senior notes due 2029 at a price of US$7.94 per Class A ordinary share","body":"Bitdeer estimates that the net proceeds from the registered direct offering will be approximately US$43.5 million, after deducting the estimated offering expenses payable by Bitdeer. Bitdeer estimates that the net proceeds from Bitdeer's separately announced private offering (the \"notes offering\") of 5.00% Convertible Senior Notes due 2032 (the \"notes\") will be approximately US$315.1 million (or approximately US$363.7 million if the initial purchasers in the notes offering fully exercise their option to purchase additional notes), after deducting the initial purchasers' discounts and estimated offering expenses payable by Bitdeer."},{"time":"06:55","ticker":"ESAB","headline":"ESAB Corp. beats by $0.01, beats on revs; reaffirms FY26 EPS guidance","body":"• Reports Q4 (Dec) earnings of $1.35 per share, excluding non-recurring items, $0.01 better than the FactSet Consensus of $1.34; revenues rose 7.5% year/year to $721 mln vs the $690.19 mln FactSet Consensus.\n• Co reaffirms guidance for FY26, sees EPS of $5.70-5.90, excluding non-recurring items, vs. $5.82 FactSet Consensus.Consistent with 2026 guidance released on February 2, 2026, ESAB expects core organic growth of 2.0% to 4.0% and total core sales growth of 6.0% to 9.0% for the full year 2026, which reflects a 0.0% to 1.0% currency tailwind and approximately 4% M&A growth.\n• Consistent with 2026 guidance released on February 2, 2026, ESAB expects core organic growth of 2.0% to 4.0% and total core sales growth of 6.0% to 9.0% for the full year 2026, which reflects a 0.0% to 1.0% currency tailwind and approximately 4% M&A growth."},{"time":"06:49","ticker":"DNOW","headline":"DNOW Inc. reports EPS in-line, revs in-line","body":"• Reports Q4 (Dec) earnings of $0.15 per share, excluding non-recurring items, in-line with the FactSet Consensus of $0.15; revenues rose 68.0% year/year to $959 mln vs the $962.25 mln FactSet Consensus."},{"time":"06:46","ticker":"CTRN","headline":"Citi Trends announces board transition, finance committee leadership update, and extension of cooperation agreement with Fund 1","body":"• Co announced a series of governance and shareholder-related updates, including a Board transition, Finance Committee leadership change, and the extension of its cooperation agreement with Fund 1 Investments.\n• The Company announced that Wes Calvert has departed from the Company's Board of Directors effective February 19, 2026, following his distinguished service on the Board, including his role as Chair of the Finance Committee. Concurrently, the Board has appointed Benjamin Faw as a new independent director, effective February 19, 2026. Mr. Faw will assume the role of Chair of the Finance Committee upon his appointment.\n• Mr. Calvert served on the CITITRENDS Board this past year, providing strong financial oversight, disciplined capital allocation guidance, and steady leadership as the Company strengthened its operating model and long-term financial framework. As Chair of the Finance Committee, he played an instrumental role in enhancing financial rigor, long-range planning discipline, and shareholder value creation.\n• In addition, CITITRENDS announced that it has exercised its right to extend its cooperation agreement with Fund 1, including the standstill provisions, for an additional one-year term, reflecting continued alignment and constructive engagement with the Company's shareholders.\n• Following these updates, the CITITRENDS Board will consist of 8 directors, 7 of whom are independent."},{"time":"06:46","ticker":"AGO","headline":"Assured Guaranty  increases quarterly dividend to $0.38 per common share from $0.34 per common share","body":""},{"time":"06:38","ticker":"CMDB","headline":"Costamare Bulkers Holdings Limited reports results for the fourth quarter","body":"MONACO, Feb. 20, 2026 (GLOBE NEWSWIRE) -- Costamare Bulkers Holdings Limited (\"Costamare Bulkers\" or the \"Company\") (NYSE: CMDB) today reported unaudited financial results for the fourth quarter (\"Q4 2025\") and year ended December 31, 2025.Click here for full release."},{"time":"06:32","ticker":"LYB","headline":"LyondellBasell cuts quarterly dividend to $0.69 per share from $1.37 per share","body":"\"Despite one of the longest downturns in our industry, LYB was able to return approximately $2 billion to our shareholders from existing cash and operations in 2025. With markets expected to remain challenged, we have made the decision to recalibrate the dividend to better position the company to thrive once markets recover,\" said LYB CEO Peter Vanacker. \"In 2026, we are prioritizing safety and reliability while driving additional cost reductions and finding new opportunities to enhance profitability. We remain committed to our target of returning 70% of free cash flow to shareholders through the cycle.\""},{"time":"06:31","ticker":"ASIX","headline":"AdvanSix announces fourth quarter and full year 2025 financial results","body":"Driving improved cash flow in 2026 through fixed cost savings, turnaround scope, risk-based prioritization of capital expenditures, and tax benefitsClick here for full release."},{"time":"06:31","ticker":"NOV","headline":"NOV Inc. announces 20% increase in regular quarterly dividend","body":"• Co announces that its Board of Directors voted to increase its regular quarterly cash dividend by 20 percent to $0.09 per share of common stock.\n• The quarterly dividend is payable on March 27, 2026 to each stockholder of record on March 13, 2026."},{"time":"06:30","ticker":"SCANX","headline":"Early premarket gappers","body":"• Gapping up: OPEN +18.6%, FET +13.5%, WK +10.9%, KOS +10.7%, RNG +9%, HG +9%, HLIT +8.1%, TNDM +8%, JAKK +7.7%, TLX +7.7%, RMNI +7.4%, ALRM +7.2%, DOMO +7%, AXTI +6.8%, PRDO +6.8%, FIX +4.9%, ASIC +4.6%, TXRH +4.1%, BCAX +3.6%, GDYN +2.7%, AU +2.4%, IRTC +2.3%, FND +2.2%, VRRM +2%, NNN +2%, CORT +1.9%, GH +1.9%, HOOD +1.8%, LYV +1.6%, EC +1.5%, FIVN +1.5%, HHH +1.5%, SBSW +1.5%, NOG +1.4%, OLED +1%\n• OPEN +18.6%, FET +13.5%, WK +10.9%, KOS +10.7%, RNG +9%, HG +9%, HLIT +8.1%, TNDM +8%, JAKK +7.7%, TLX +7.7%, RMNI +7.4%, ALRM +7.2%, DOMO +7%, AXTI +6.8%, PRDO +6.8%, FIX +4.9%, ASIC +4.6%, TXRH +4.1%, BCAX +3.6%, GDYN +2.7%, AU +2.4%, IRTC +2.3%, FND +2.2%, VRRM +2%, NNN +2%, CORT +1.9%, GH +1.9%, HOOD +1.8%, LYV +1.6%, EC +1.5%, FIVN +1.5%, HHH +1.5%, SBSW +1.5%, NOG +1.4%, OLED +1%\n• Gapping down: GRAL -50.6%, INSG -17.1%, VICR -13%, CADL -11.4%, CC -11.4%, AKAM -11.1%, ACH -10.9%, VAL -8%, CPRT -7.6%, WTTR -7.4%, ARDX -7.4%, ENGN -6.9%, TVTX -5.7%, ED -4.9%, TLSI -4.6%, AGIG -4.4%, DBX -4.2%, IAUX -4.1%, EGO -3.7%, MTUS -3.2%, HBM -3.2%, CXW -3.1%, PTCT -3.1%, NEM -3%, VIST -2.5%, RIG -2.4%, ST -2.4%, WSC -1.5%, INR -1.4%, CENX -1.2%\n• GRAL -50.6%, INSG -17.1%, VICR -13%, CADL -11.4%, CC -11.4%, AKAM -11.1%, ACH -10.9%, VAL -8%, CPRT -7.6%, WTTR -7.4%, ARDX -7.4%, ENGN -6.9%, TVTX -5.7%, ED -4.9%, TLSI -4.6%, AGIG -4.4%, DBX -4.2%, IAUX -4.1%, EGO -3.7%, MTUS -3.2%, HBM -3.2%, CXW -3.1%, PTCT -3.1%, NEM -3%, VIST -2.5%, RIG -2.4%, ST -2.4%, WSC -1.5%, INR -1.4%, CENX -1.2%"},{"time":"06:11","ticker":"","headline":"S&P futures vs fair value: +1.00. Nasdaq futures vs fair value: +16.00.","body":""},{"time":"06:11","ticker":"","headline":"European Markets","body":"FTSE...10693.45...+66.40...+0.60%. DAX...25109.41...+65.80...+0.30%."},{"time":"06:11","ticker":"","headline":"Asian Markets","body":"Nikkei...56825.7...-642.10...-1.10%. Hang Seng...26413.36...-292.60...-1.10%."},{"time":"06:08","ticker":"LAMR","headline":"Lamar Advertising beats by $0.05, reports revs in-line; guides FY26 FFO below consensus","body":"• Reports Q4 (Dec) funds from operations of $2.24 per share, excluding non-recurring items, $0.05 better than the FactSet Consensus of $2.19; revenues rose 2.8% year/year to $595.9 mln vs the $592.67 mln FactSet Consensus.\n• Co issues downside guidance for FY26, sees FFO of $8.50-8.70, excluding non-recurring items, vs. $8.93 FactSet Consensus."},{"time":"06:07","ticker":"EGO","headline":"Eldorado Gold delivers strong 2025 full year and fourth quarter financial and operational results; significant free cash flow excluding Skouries and increased cash generated from operating activities","body":"VANCOUVER, British Columbia, Feb. 19, 2026 (GLOBE NEWSWIRE) -- Eldorado Gold Corporation (\"Eldorado\" or the \"Company\") today reports the Company's financial and operational results for the fourth quarter and year ended December 31, 2025. For further information please see the Company's Consolidated Financial Statements and Management's Discussion and Analysis (\"MD&A\") filed on SEDAR+ at www.sedarplus.com under the Company's profile.Click here for full release."},{"time":"06:00","ticker":"SUMRX","headline":"Overnight Summary -- Inflation in focus as gold rallies, dollar firms, and equities send mixed signals","body":"• World markets are mixed this morning as all eyes shift to inflation ahead of the latest PCE reading, with futures pushing higher despite overnight weakness in Asia and a firm dollar backdrop. The S&P trades well above fair value as Europe rallies, gold catches a bid, and traders position ahead of what could be the week's defining data point. The S&P is up about six points, trading around 6883. The market found support early, with the low set during after-hours trading at 6871.25. Bids dried up over 6900 as the S&P was capped at 6904.75 before the modest slide to the current level.\n• Asian markets closed mostly lower on Friday amid escalating U.S.--Iran tensions and concerns over AI-related investments and U.S. private credit, which weighed on sentiment. Japan's Nikkei 225 fell 1.12% to 56,825.70, pressured by geopolitical risks and ahead of key U.S. GDP and PCE data, while a softer inflation reading in Japan dampened expectations for a near-term Bank of Japan rate hike even as flash PMI data showed the fastest private-sector expansion since May 2023. The yen weakened amid a cooling inflation trend. Mainland China remained closed for the Lunar New Year, and Hong Kong's Hang Seng declined 1.10% as trading resumed, with stock-specific moves including a sharp drop in Sumitomo Pharma and gains in Mitsubishi Electric.\n• European markets trade mostly higher on Friday, with the FTSE 100, DAX, and CAC 40 on track for weekly gains as strong corporate earnings and easing AI concerns support sentiment. Rising geopolitical tensions temper upside after President Trump set a 10--15-day deadline for Iran to reach a nuclear deal, while U.K. retail sales jumped 1.8% in January, marking the strongest monthly growth since May 2024 and boosting the FTSE. The DAX benefits from faster-than-expected Eurozone business activity, while stock-specific strength in Air Liquide and Moncler lifts the CAC 40. Gains are partially offset by weakness in Tullow Oil, even as Swiss Re advances on a strategic acquisition.\n• S&P Futures vs Fair Value: +8.0\n• 10 yr Note: 4.077%\n• USD/JPY: 155.38 +0.39\n• EUR/USD: 1.1763 -0.0011\n• Europe: FTSE: +0.7% DAX: +0.4% CAC: +0.9%\n• Asia: Hang Seng: -1.1% Shanghai: CLOSED Nikkei: -1.1%\n• Gold (5046.00 +48.60) Silver (80.480 +2.846) Crude (66.06 -0.37)"},{"time":"05:17","ticker":"BA","headline":"Boeing responds to NASA Starliner crewed test investigation","body":"• Boeing said it appreciates NASA's investigation into the Starliner Crewed Flight Test and has made substantial technical corrective actions and cultural changes over the past 18 months.\n• The Company stated the report aligns with and reinforces ongoing efforts to improve performance and mission assurance across the Commercial Crew program.\n• Boeing emphasized crew and mission safety as its top priority and said it is working closely with NASA to ensure readiness for future Starliner missions.\n• The Company reaffirmed its commitment to supporting NASA's strategy of maintaining two commercial crew providers."},{"time":"05:14","ticker":"WIRES","headline":"On The Wires","body":"• Zillow (ZG / Z) is partnering with Google (GOOG / GOOGL) NotebookLM to make Zillow's home-buying guidance available in a featured notebook. NotebookLM is a personalized AI research and thinking tool designed to help users better connect with and understand complex information. Unlike general AI answers that can vary in accuracy, notebook users can ask questions and get responses grounded in Zillow's guidance, with direct citations to original articles on Zillow.com.\n• Institutional Property Advisors, a division of Marcus & Millichap (MMI) dedicated to serving the company's institutional clients, announced today the sale of Hancock Terrace, a 272-unit multifamily property in Santa Maria, California. The asset traded for $75 million, or $275,735 per unit. The property is within walking distance of Santa Maria Town Center, the Pacific Conservatory Theatre, John Osborne Field, and Allan Hancock College. U.S. Highway 101 and State Route 135 are nearby, and Vandenberg Space Force Base is within a short commute. Major employers in Santa Maria include Bonipak Produce, California Giant Berry Farms, Community Health Centers of the Central Coast, and Hardy Diagnostics.\n• Apollo (APO) announced that Apollo-managed funds have invested $1 billion in subordinated hybrid notes issued by Aldar Properties PJSC, a leading UAE based real estate developer and investment manager. The investment builds on Apollo's long-term strategic partnership with Aldar and represents Apollo's fifth investment in Aldar since 2022, bringing aggregate commitments to $2.9 billion to date. Proceeds from the investment are intended to support Aldar's balance sheet flexibility and strength, as well as its growth agenda, which includes landbank replenishment, expansion of its develop-to-hold portfolio, and strategic acquisitions.\n• Kanzhun Limited (BZ) announced the continued execution of its share repurchase program, utilizing near RMB25 million to repurchase 410,642 ordinary shares on Feb 17 and Feb 18. In 2026, the Company has deployed more than RMB340 million toward share repurchases. This move underscores the Company's ongoing commitment to shareholder returns. BOSS Zhipin maintains authorization under its existing program to repurchase up to $250 million worth of its shares, with the program remaining active until the end of August 2026."},{"time":"05:11","ticker":"FRMI","headline":"Fermi America draws on $200 mln equipment facility for Project Matador","body":"• Fermi America secured over $100 mln in initial commitments from a private debt fund managed by Keystone National Group as part of a $200 mln equipment facility arranged by Cape Commercial Finance to support the first 2.3GW of its 11GW Project Matador HyperGrid campus.Proceeds will fund long-lead, high-voltage assets including breakers, transformers, substations and switchgear, with a structure allowing capital to be recycled as assets are refinanced through project financing.The facility complements a previously announced $500 mln turbine warehouse financing from MUFG, bringing total recent institutional equipment commitments to over $600 mln.Management said the financing accelerates procurement and supports delivery of dedicated, behind-the-meter power infrastructure targeting AI, semiconductor, manufacturing and defense customers.\n• Proceeds will fund long-lead, high-voltage assets including breakers, transformers, substations and switchgear, with a structure allowing capital to be recycled as assets are refinanced through project financing.\n• The facility complements a previously announced $500 mln turbine warehouse financing from MUFG, bringing total recent institutional equipment commitments to over $600 mln.\n• Management said the financing accelerates procurement and supports delivery of dedicated, behind-the-meter power infrastructure targeting AI, semiconductor, manufacturing and defense customers."},{"time":"05:05","ticker":"RHHBY","headline":"Roche Hldg: FDA approves Genentch's Venclexta plus acalabrutinib for first-line CLL","body":"• Roche's Genentech unit received FDA approval for Venclexta in combination with acalabrutinib for previously untreated adults with chronic lymphocytic leukemia, marking the first all-oral, fixed-duration regimen in this setting.Approval is based on the Phase III AMPLIFY trial, where the combination reduced the risk of disease progression or death by 35% versus chemoimmunotherapy (HR 0.65; p=0.0038).Median progression-free survival was not reached for the combination at 42.6 months follow-up, compared with 47.6 months for chemoimmunotherapy.Safety profile was consistent with known effects of each drug; most common adverse events included neutropenia, headache, diarrhea, musculoskeletal pain and COVID-19.\n• Approval is based on the Phase III AMPLIFY trial, where the combination reduced the risk of disease progression or death by 35% versus chemoimmunotherapy (HR 0.65; p=0.0038).\n• Median progression-free survival was not reached for the combination at 42.6 months follow-up, compared with 47.6 months for chemoimmunotherapy.\n• Safety profile was consistent with known effects of each drug; most common adverse events included neutropenia, headache, diarrhea, musculoskeletal pain and COVID-19.\n• Briefing note: AMPLIFY is an AstraZeneca (AZN) -sponsored, global, multi-center Phase 3 trial evaluating VENCLEXTA plus acalabrutinib alone or combined with obinutuzumab versus chemoimmunotherapyVENCLEXTA is being developed by AbbVie (ABBV) and Roche.\n• AMPLIFY is an AstraZeneca (AZN) -sponsored, global, multi-center Phase 3 trial evaluating VENCLEXTA plus acalabrutinib alone or combined with obinutuzumab versus chemoimmunotherapy\n• VENCLEXTA is being developed by AbbVie (ABBV) and Roche."},{"time":"04:56","ticker":"RHHBY","headline":"Roche Hldg: FDA accepts NDA for giredestrant in ESR1-mutated advanced breast cancer","body":"• Roche announced the FDA accepted its New Drug Application for giredestrant in combination with everolimus for ER-positive, HER2-negative, ESR1-mutated locally advanced or metastatic breast cancer following prior endocrine therapy.Filing is supported by Phase III evERA data showing a 44% reduction in risk of progression or death in the ITT population and 62% in the ESR1-mutated subgroup versus standard-of-care endocrine therapy plus everolimus.Median progression-free survival reached 9.99 months in the ESR1-mutated group versus 5.45 months for comparator; overall survival data remain immature with positive trends observed.\n• Filing is supported by Phase III evERA data showing a 44% reduction in risk of progression or death in the ITT population and 62% in the ESR1-mutated subgroup versus standard-of-care endocrine therapy plus everolimus.\n• Median progression-free survival reached 9.99 months in the ESR1-mutated group versus 5.45 months for comparator; overall survival data remain immature with positive trends observed.\n• The FDA set a PDUFA date of December 18, 2026; if approved, the combination could become the first oral SERD regimen in the post-CDK4/6 inhibitor setting."},{"time":"04:54","ticker":"WTTR","headline":"Select Water Solutions prices offering of 13,725,491 shares of common stock at $12.75 per share","body":""},{"time":"04:53","ticker":"CADL","headline":"Candel Therapeutics prices offering of 18,348,624 shares of its common stock at $5.45 per share","body":""},{"time":"04:52","ticker":"EC","headline":"Ecopetrol reports 1.94 bln boe proven reserves; 121% replacement ratio","body":"• Ecopetrol recorded 1,944 mmboe of proven (1P) reserves at year-end 2025, up 2.7% from 1,892.7 mmboe in 2024, with 99% independently certified.The Company added 300 mmboe of reserves in 2025 and achieved a 121% reserves replacement ratio, the highest in the past four years.Additions were driven primarily by enhanced recovery projects at Castilla, Chichimene and Akacias, improved asset management at Rubiales and La Cira--Infantas, and ANH-related contract revisions.Production of 248 mmboe was offset by revisions and enhanced recovery gains, with average reserve life standing at 7.8 years.\n• The Company added 300 mmboe of reserves in 2025 and achieved a 121% reserves replacement ratio, the highest in the past four years.\n• Additions were driven primarily by enhanced recovery projects at Castilla, Chichimene and Akacias, improved asset management at Rubiales and La Cira--Infantas, and ANH-related contract revisions.\n• Production of 248 mmboe was offset by revisions and enhanced recovery gains, with average reserve life standing at 7.8 years.\n• Additionally, co informs that the board of directors, in its session held on February 18 and 19, 2026, elected ngela Mara Robledo Gmez and Hildebrando Vlez Galeano as chairwoman and vice chairman of the board of directors, respectively."},{"time":"04:42","ticker":"AGIG","headline":"Abundia Global Impact Group prices offering of 5,934,718 shares of common stock for gross proceeds of $20 mln","body":""},{"time":"04:37","ticker":"SJT","headline":"San Juan Basin Royalty updates on Hilcorp's $14 mln 2026 capital plan","body":"• San Juan Basin Royalty Trust said operator Hilcorp Energy plans approximately $14.0 mln in 2026 capital expenditures for the Trust's subject interests.\n• About $11.5 mln is allocated to 15 new drilling projects (nine vertical, six horizontal), primarily targeting the Mesaverde, Mancos and Dakota formations.\n• Roughly $2.0 mln is earmarked for 17 recompletions and workovers, with $0.5 mln for compression and other facilities projects.\n• For 2025, Hilcorp spent approximately $8.3 mln versus a projected $9.0 mln, including $4.0 mln on drilling and $4.3 mln on recompletions and workovers."},{"time":"04:35","ticker":"RIG","headline":"Transocean misses by $0.06, reports revs in-line; guides Q1 revs above consensus; guides FY26 revs in-line","body":"• Reports Q4 (Dec) earnings of $0.02 per share, excluding non-recurring items, $0.06 worse than the FactSet Consensus of $0.08; revenues rose 9.6% year/year to $1.04 bln vs the $1.04 bln FactSet Consensus.\n• GuidanceCo issues upside guidance for Q1, sees Q1 revs of $1.02-1.05 bln vs. $1 bln FactSet Consensus. Co issues in-line guidance for FY26, sees FY26 revs of $3.80-3.95 bln vs. $3.85 bln FactSet Consensus.\n• Co issues upside guidance for Q1, sees Q1 revs of $1.02-1.05 bln vs. $1 bln FactSet Consensus.\n• Co issues in-line guidance for FY26, sees FY26 revs of $3.80-3.95 bln vs. $3.85 bln FactSet Consensus.\n• The aggregate incremental backlog associated with these 10 fixtures is approximately $610 million. As of February 19, 2026, the company's total backlog is approximately $6.1 billion."},{"time":"04:26","ticker":"IAUX","headline":"I-80 Gold reports Q4 results; continues to advance development plan","body":"TORONTO, Feb. 19, 2026 /PRNewswire/ - i-80 GOLD CORP. (TSX: IAU) (NYSE American: IAUX) (\"i-80 Gold\" or the \"Company\") reports its operating and financial results, as well as development highlights, for the fourth quarter and full year ended December 31, 2025.Click here for full release."},{"time":"04:23","ticker":"KOS","headline":"Kosmos Energy secures Ghana license extensions to 2040; updates operations and financing","body":"• Kosmos Energy confirmed Ghana's parliament ratified extensions of the West Cape Three Points and Deepwater Tano licenses covering Jubilee and TEN fields, extending terms to 2040 and supporting up to $2 bln in incremental investment.\n• At Jubilee, the J74 well is producing ~13,000 bopd, lifting average gross field output above 70,000 bopd in February; J75 has been drilled with ~40 meters of net pay and is expected online by end-Q1.\n• At TEN, partners signed an SPA to acquire the FPSO for $205 mln gross (~$40 mln net to Kosmos), with completion expected in Q1 2027 and anticipated operating cost reductions from 2026 onward.\n• GTA LNG Phase 1 averaged ~2.9 mtpa year-to-date versus 2.7 mtpa nameplate; Kosmos also completed a $350 mln Norwegian bond, repaid $100 mln of RBL debt and initiated 2027 hedges with 2 mln barrels at a $60/bbl floor."}],"fetchedAt":1771619080905},"savedAt":1771619080906}