{"data":{"updated":"2/11/2026, 8:08:02 AM","entries":[{"time":"07:47","ticker":"WIRES","headline":"On The Wires","body":"• BMO (BMO) announced its participation as a partner bank for the Defence, Security and Resilience Bank (DSRB) Development Group. BMO's participation supports the development of the DSRB -- a proposed multilateral financial institution focused on providing financing mechanisms for defence, security, and infrastructure projects for NATO members and allied nations.\n• ING Groep (ING) announced it will redeem two series of outstanding SEC registered securities: the USD 400 million Callable Floating Rate Senior Notes and the USD 1,100 million 1.726% Callable Fixed-to-Floating Rate Senior Notes on their contractual call date of 1 April 2026. In addition, ING announced today its intention to redeem the EUR 1,500 million 2.125% Fixed Rate Subordinated Tier 2 Notes (XS2176621170) (the \"T2 Notes\") on the next contractual reset date of 26 May 2026.\n• Real Brokerage Inc. (REAX) announced that Ken Pozek, founder and leader of The Pozek Group, has joined the Company's Board of Directors. The appointment reflects Real's belief that its agents, who collectively represent the company's largest shareholder group, should have a direct voice in shaping its strategic direction."},{"time":"07:40","ticker":"AEHR","headline":"Aehr Test Systems announced a key strategic win with an initial production purchase order from its lead production customer for package-level burn-in of the customer's next-generation, significantly higher-power AI processor used in data center training and inference applications","body":"• The initial order includes multiple Aehr Sonoma ultra-high-power package-level test and burn-in systems for production burn-in of this next-generation device. Delivery of these systems, along with the fully turnkey burn-in modules (BIMs) and device-specific sockets required for this next generation ASIC AI processor, is scheduled for summer of 2026.\n• This customer is a premier large-scale data center provider that is developing its own proprietary AI accelerator ASICs for large-scale training and inference workloads and has publicly described plans for very significant capital expenditures for AI and data center infrastructure."},{"time":"07:38","ticker":"WIRES","headline":"On The Wires","body":"• abercrombie kids, the children's extension of Abercrombie & Fitch and a division of Abercrombie & Fitch Co. (ANF), is expanding its size offerings with the launch of its new Baby & Toddler Collection. The introduction marks the brand's first expansion into baby and toddler clothing, with sizes ranging from newborn to 5T, allowing families to dress their children in abercrombie styles from their earliest moments.\n• Canadian Solar Inc. (CSIQ) announces that e-STORAGE, its energy storage solutions business, has delivered its first grid-connected battery energy storage system in Japan, with a rated output of 2 MW and an energy capacity of 8.25 MWh DC. The facility marks the first deployment of e-STORAGE's battery products in the Japanese market and reflects Canadian Solar's long-standing commitment to Japan.\n• Hiab has signed a strategic dealer agreement with Custom Truck One Source (CTOS), significantly expanding the distribution and service network for HIAB loader cranes and MOFFETT truck mounted forklifts.\n• Stoke Therapeutics (STOK) announces that the first patient has been dosed in the Phase 1 OSPREY study of STK-002, an investigational medicine for the treatment of Autosomal Dominant Optic Atrophy. ADOA is a rare genetic disease that causes progressive and irreversible vision loss in both eyes starting in the first decade of life. Approximately 80 percent of people with ADOA are symptomatic by age 10, and approximately half are expected to become legally blind. There are currently no approved treatments for ADOA."},{"time":"07:37","ticker":"VVX","headline":"V2X awarded $100 mln in national security contracts","body":"• Co announces it was awarded $100 million in classified contracts during the fourth quarter of 2025 to support a broad range of national security missions for multiple U.S. defense and intelligence agencies. The awards include services and solutions in the areas of cyber operations, special systems integration, unique facility solutions and contested logistics."},{"time":"07:35","ticker":"ELAB","headline":"PMGC Holdings Inc.'s wholly owned subsidiary, NorthStrive Biosciences Inc., has executed a definitive, exclusive license agreement with Modulant Biosciences LLC","body":"• The License Agreement covers NorthStrive's EL-22 and EL-32 assets and, pursuant to its terms, grants Modulant an exclusive, royalty-bearing, sublicensable license to develop, manufacture, and commercialize products derived from these technologies solely for non-human animal health applications, including use as a feed additive. This license (\"License\") applies on a worldwide basis, excluding the Republic of Korea. Modulant agreed to pay value to NorthStrive in exchange for the License granted under the License Agreement.\n• EL-22 and EL-32 are based on proprietary intellectual property targeting myostatin and activin-A pathways, which are key biological regulators of muscle development, strength, and metabolic efficiency. These pathways are increasingly viewed as important targets across a range of animal health and nutrition applications, including livestock productivity, feed efficiency, and companion animal muscle health and aging.\n• The License Agreement encompasses issued patents, pending patent applications, and associated proprietary know-how underlying the EL-22 and EL-32 programs. Under the terms of the License Agreement, Modulant is responsible for all development, manufacturing, regulatory, and commercialization activities for licensed products within the animal health field, using commercially reasonable efforts. The License Agreement expressly excludes any human pharmaceutical or clinical applications."},{"time":"07:35","ticker":"GLDD","headline":"Great Lakes Dredge &amp; Dock to be acquired by Saltchuk Resources for $17/share","body":"• Co and Saltchuk Resources, a privately owned family of diversified freight transportation, marine service, and energy distribution companies, announce a definitive agreement for Saltchuk to acquire Great Lakes at an aggregate equity value of approximately $1.2 billion and a total transaction value of $1.5 billion.\n• Under the terms of the agreement, which has been unanimously approved by the Board of Directors of both companies, Saltchuk will commence a tender offer to acquire all outstanding shares of the Company for $17.00 per share in cash. The per share purchase price represents a 25% premium to Great Lakes's 90-day volume-weighted average price as of February 10, 2026, the last trading day prior to the announcement, as well as a 5% premium to the Company's all-time high closing price.\n• Upon completion of the transaction, Great Lakes will operate as a standalone business within Saltchuk and its common stock will no longer be listed on the Nasdaq.\n• Transaction is expected to close in Q2 2026."},{"time":"07:33","ticker":"TMUS","headline":"T-Mobile US unveiled the world's first real-time agentic AI platform built directly into a wireless network, marking a fundamental shift in how wireless providers deliver innovation","body":"• By embedding real-time AI services into the network itself, the Un-carrier can bring new capabilities straight to customers - without new devices, subscriptions, or app downloads. If you're on the T-Mobile network, you now have access to entirely new ways to connect, starting with Live Translation, a first-of-its-kind network-integrated service that enables real-time translation during phone calls in over 50 languages.\n• While translation services have been around for awhile, they are either expensive to adopt at scale, only work on certain devices, require apps, downloads and subscriptions or route data in ways that are not always private and secure.\n• Enter Live Translation. The magic lies in its integration directly into T-Mobile's network, making AI a core capability rather than an add-on. Available on T-Mobile's industry-leading 5G Advanced network, this first-of-its kind network-native AI infrastructure delivers on the promise of creating experiences that change the way consumers interact with the world around them. With the most towers, America's largest 5G Advanced network and the deepest spectrum portfolio years in the making, T-Mobile is the only wireless provider currently capable of putting this innovation directly into consumers hands at scale."},{"time":"07:30","ticker":"SUMRX","headline":"European Markets Update: DAX -0.1%, FTSE +0.8%, CAC -0.1%","body":"• In economic data: Italy's December Industrial Production -0.4% m/m (expected -0.6%; last 1.5%); 3.2% yr/yr (last 1.4%)\n• Italy's December Industrial Production -0.4% m/m (expected -0.6%; last 1.5%); 3.2% yr/yr (last 1.4%)\n• STOXX Europe 600: UNCH\n• Germany's DAX: -0.1%\n• U.K.'s FTSE 100: +0.8%\n• France's CAC 40: -0.1%\n• Italy's FTSE MIB: -0.7%\n• Spain's IBEX 35: -0.4%\n• EUR/USD: +0.1% to 1.1903\n• GBP/USD: +0.3% to 1.3683\n• USD/CHF: UNCH at 0.7672"},{"time":"07:30","ticker":"SCANX","headline":"Gapping up/Gapping down","body":"• MNTN +31.1%, STIM +26%, TDC +16.1%, NET +14.4%, HNGE +13.8%, VRT +13.7%, LSCC +11.1%, SHOP +10.8%, JHX +10%, DIOD +9.9%, CLBT +9.8%, GFS +7.4%, AEIS +6.4%, KVYO +5.3%, UFCS +5.1%, VERX +5.1%, GNRC +5%, TSEM +4%, SUZ +3.2%, OTLY +2.8%, RDWR +2.7%, KRNT +2.5%, VREX +2%, F +1.8%, TTE +1.8%, DAO +1.6%, WELL +1.5%, BL +1.5%, BWA +1.4%, EW +1.3%, RRR +1.2%, TEX +1.2%, AIG +1.1%\n• BETA +18.4% (AMZN discloses new poisiton in BETA)\n• RBKB +11.3% (adopts plan of conversion and reorganization)\n• NKTR +5.4% ($300 mln stock offering)\n• FRMI +3.8% (secures $500 mln MUFG financing to fund gas turbine purchases)\n• CAMT +3% (received a $25 mln Hawk systems order)\n• RZLV +2.3% (to acquire Reward for $230 mln in all-cash deal)\n• TFPM +1.5% (to unlock the gold-dominant E44 deposit at Northparkes)\n• APAM +1.3% (reports January AUM)\n• FLYX +1.1% (at the market offering agreement with Lucid Capital)\n• KC +7.7% (upgraded to Buy from Neutral at Goldman)\n• MNRO +5.6% (upgraded to Outperform from Perform at Oppenheimer)\n• MT +3.4% (upgraded to Buy from Hold at Jefferies)\n• MAT -26.7% (also to acquire full ownership of Mattel163; licensing deal with Paramount for Teenage Mutant Ninja Turtles brand), RPD -23.9%, U -22.7%, ANGI -19.3%, LYFT -17.3% (also authorizes new $1 bln share repurchase program), MBC -16.9%, VPG -16%, ALAB -11.6% (also enters transaction with AMZN under which Amazon may acquire up to 3,262,299 shares; also names new CFO), AVTR -10.6%, CRTO -8.9%, PEGA -8.4%, LEU -8%, HOOD -7.9% (also names new CFO), HUM -7.1%, SAIC -7% (guidance), KHC -6.8%, OI -6.3%, ZG -4.2%, MIR -4%, MLM -3.8%, SITE -3.7%, LAD -3.5%, R -3.4%, NTES -3.3%, PSN -3.1%, FRSH -2.7%, GILD -2.6% (also increases dividend), SOLS -2.6%, RMBS -2.4%, UPST -2.4% (also names new CEO), IVT -2% (also increases dividend), THC -1.6%, PAG -1.6%, CHEF -1.3%, FLNG -1.2%, EXEL -1.1%\n• UPB -22.8% (top-line results from the Phase 2 VALIANT clinical trial)\n• MRNA -10.2% (receives FDA refusal-to-file for influenza vaccine)\n• GLTO -5.7% (prices offering of 14,473,685 shares of common stock at $19.00 per share)\n• CURB -2.3% (prices offering of 8.0 mln shares of common stock for gross proceeds of ~$204 mln)\n• RILY -2% (stock offering by selling shareholders, relates to warrants)\n• PLTR -1.3% (extends collaboration with Airbus)\n• TIGO -1.2% (acquires Telefonica operations in Chile jointly with NJJ)\n• ZENA -1% (files for $250 mln mixed securities shelf offering)\n• NCLH -0.9% (downgraded to Equal Weight from Overweight at Barclays)"},{"time":"07:27","ticker":"IHS","headline":"IHS Holding Limited's IHS Towers confirms plans to sell its 51.0% stake in I-Systems to TIM S.A. (TIMB)","body":"• The I-Systems network covers approximately 9.3 million homes passed (of which approximately 6.4 are Fiber-to-the-Home) and spans approximately 22,250 route kilometers.\n• This will result in IHS Towers' exit from the Brazilian fiber sector. The I-Systems transaction, reflecting an enterprise value of $452.6 million, is aligned with the Company's previously announced strategic initiatives, helping to focus the growth of the Company in lower capex, higher return businesses. This transaction is subject to customary closing conditions, including regulatory approvals, and is expected to close later in 2026."},{"time":"07:25","ticker":"RPC","headline":"Ridgepost Capital: P10, Inc. (previously PX) has been renamed Ridgepost Capital and will trade under the symbol 'RPC","body":""},{"time":"07:22","ticker":"AGBK","headline":"AGI Inc. (NYSE) prices downsized 20.0 mln share IPO (original amount was 43.6 mln shares) at $12, below the $15-$18 projected price range","body":""},{"time":"07:20","ticker":"EXOD","headline":"Exodus Movement, Inc. January 2026 Treasury update and monthly metrics","body":"About Exodus Exodus is a financial technology leader empowering individuals and businesses with secure, user-friendly crypto software solutions. Since 2015, Exodus has made digital assets accessible to everyone through its multi-asset crypto wallets prioritizing design and ease of use.Click here for full release."},{"time":"07:18","ticker":"HCSG","headline":"Healthcare Services Group beats by $0.22, reports revs in-line; accelerates buyback","body":"• Reports Q4 (Dec) earnings of $0.44 per share, $0.22 better than the FactSet Consensus of $0.22; revenues rose 6.6% year/year to $466.68 mln vs the $467.31 mln FactSet Consensus.\n• In February 2026, Board authorized the repurchase of up to 10.0 million outstanding shares of common stock. In conjunction with that authorization, co announced that it plans to further accelerate the pace of its share buybacks, and over the next 12-months, intends to repurchase $75.0 mln of its common stock.\n• FY26 revenue expected to grow in mid-single digits."},{"time":"07:18","ticker":"INTR","headline":"Inter&amp;Co reports record results, driven by 36% credit expansion and 45% net income growth in 2025","body":"MIAMI, Feb. 11, 2026 (GLOBE NEWSWIRE) -- Inter&Co Inc. (NASDAQ: INTR) the leading digital bank providing financial and commerce services to over 43 million customers, reported its financial results today for the fourth quarter of 2025.Click here for full release."},{"time":"07:17","ticker":"WBD","headline":"Warner Bros. Discovery: Ancora Holdings Group releases an extensive presentation regarding its strong opposition to the currently proposed merger involving WBD and Netflix (NFLX)","body":"• Contends the Netflix Proposal Includes Inferior and Uncertain Cash Consideration, the Likely Debt-Laden Discovery Global Spinoff and a \"Hail Mary\" Path to Regulatory Approval\n• Details the Risks to Creative Production, Jobs and the Future of Human Talent in the Film and TV Industries Under a Seemingly Monopolistic WBD-Netflix Behemoth\n• Makes Clear the Paramount Offer Includes Significantly More Cash, the Backing of the Proven Ellison Trust and a Viable Path to Regulatory Approval Thanks to Modest Size and Studio Legacy Urges the WBD Board to Determine that Paramount's Revised Offer Could Reasonably Be Expected to Result in a \"Superior Proposal\" and Engage with Paramount to Secure a Value-Maximizing Outcome for All Shareholders\n• Ancora Holdings Group, LLC, a nearly $11 billion firm with an approximately $200 million economic interest in Warner Bros. Discovery, Inc. (WBD)."},{"time":"07:16","ticker":"RPRX","headline":"Royalty Pharma reports Q4 and full year 2025 results","body":"NEW YORK, Feb. 11, 2026 (GLOBE NEWSWIRE) -- Royalty Pharma plc (Nasdaq: RPRX) today reported financial results for the fourth quarter and full year 2025 and introduced full year 2026 guidance for Portfolio Receipts.Click here for full release."},{"time":"07:13","ticker":"DTIL","headline":"Precision BioSciences announces that the Company received a Study May Proceed notification from the U.S. Food and Drug Administration","body":"• U.S. FDA Study May Proceed notification enables initiation of clinical trial site activation for the FUNCTION-DMD Phase 1/2 clinical study in patients with Duchenne muscular dystrophy.\n• Institutional Review Board process is underway at multiple world-class DMD clinical trial sites.\n• PBGENE-DMD is an in vivo gene editing investigational product designed to correct the underlying genetic cause of DMD through a novel one-time gene editing therapy.\n• Company plans to host a virtual event in March after the Muscular Dystrophy Association conference to discuss PBGENE-DMD and the FUNCTION-DMD clinical study with participation from key opinion leaders including patient advocacy."},{"time":"07:13","ticker":"UE","headline":"Urban Edge Properties reports fourth quarter and full-year 2025 results; increases dividend","body":"Urban Edge Properties (NYSE: UE) (the \"Company\") today announced its results for the quarter and year ended December 31, 2025 and provided its initial outlook for full-year 2026.Click here for full release."},{"time":"07:13","ticker":"OTLY","headline":"Oatly Reports Fourth Quarter and Full Year 2025 Financial Results","body":"MALM, Sweden, Feb. 11, 2026 (GLOBE NEWSWIRE) -- Oatly Group AB (Nasdaq: OTLY) (\"Oatly\", the \"Company\" or the \"Group\"), the world's original and largest oat drink company, today announced financial results for the fourth quarter and twelve months ended December 31, 2025.Click here for full release."},{"time":"07:13","ticker":"SAIC","headline":"Science Applications provides mixed outlook","body":"• Co issues mixed guidance for Q4 (Jan), sees EPS of $2.30-2.50, excluding non-recurring items, vs. $1.84 FactSet Consensus; sees Q4 (Jan) revs of ~$1.745 bln vs. $1.78 bln FactSet Consensus.\n• Co issues downside guidance for FY27 (Jan), sees FY27 (Jan) revs of $7.0-7.2 bln vs. $7.4 bln FactSet Consensus.This is down from prior guidance of $7.35-7.55 blnCo sees FY27 Adj EBITDA of $705-715 mln vs prior guidance of $725-735 mln\n• This is down from prior guidance of $7.35-7.55 bln\n• Co sees FY27 Adj EBITDA of $705-715 mln vs prior guidance of $725-735 mln"},{"time":"07:12","ticker":"NCTY","headline":"The9 Ltd's Shanghai The9 Information Technology entered into definitive cooperation agreement with Chengdu Lumosi Network Technology to launch an AI-powered short drama and AI-assisted interactive movie game","body":"The collaboration will focus on: AI-powered short drama format development; AI-enhanced script iteration and cinematic scene generation; AI-driven interactive storytelling mechanics; Hybrid interactive movie game prototypes integrating cinematic narratives with player-driven decision systems."},{"time":"07:11","ticker":"SUPX","headline":"SuperX AI Technology Limited announces that its wholly-owned subsidiary, SuperX AI Solution Limited, has entered into a joint venture agreement with Tianfu International Investment, a wholly-owned subsidiary of Suzhou TFC Optical Communication, and certain affiliates, related parties, and designees","body":"The parties will jointly establish SuperX Optical Communications Pte. Ltd., with SuperX leading the joint venture through board and management control, integrating resources to expand their presence in the global AI optical connectivity market, build a leading ecosystem for optical solutions, and support new momentum for the buildout of global AI data centers."},{"time":"07:11","ticker":"MAIN","headline":"Main Street Capital completes a follow-on investment in its existing portfolio company, DMS Holdco, an industry leading provider of omni-channel direct marketing services","body":"• Main Street, along with its co-investor MSC Income Fund, (MSIF), made the follow-on investment in DMS to support the Company's strategic acquisition of Johnson & Quin, which is a direct marketing services business strategically located in Chicago, Illinois, and to support other strategic growth initiatives. Main Street and MSIF provided a portion of the financing necessary to facilitate the acquisition, with the owners of J&Q receiving a portion of the acquisition purchase price in equity ownership in DMS.\n• Main Street's portion of the investment consisted of an additional $20.8 million first lien, senior secured term debt investment and a $4.8 million direct equity investment. Main Street and MSIF initially invested in DMS in February 2018."},{"time":"07:11","ticker":"VERX","headline":"Vertex beats by $0.01, reports revs in-line; guides Q1 revs in-line; guides FY26 revs in-line","body":"• Reports Q4 (Dec) earnings of $0.17 per share, excluding non-recurring items, $0.01 better than the FactSet Consensus of $0.16; revenues rose 9.1% year/year to $194.71 mln vs the $194.32 mln FactSet Consensus.\n• Cloud revenues of $94.6 million, up 23.0% year-over-year.\n• Annual Recurring Revenue (\"ARR\") was $671.0 million, up 11.3% year-over-year.\n• Co issues in-line guidance for Q1, sees Q1 revs of $193.5-$196.5 mln vs. $195.03 mln FactSet Consensus.\n• Co issues in-line guidance for FY26, sees FY26 revs of $823.5-$831.5 mln vs. $828.71 mln FactSet Consensus. Sees Cloud revenue growth of 25 percent."},{"time":"07:09","ticker":"TSEM","headline":"Tower Semi beats by $0.02, reports revs in-line; guides Q1 revs in-line","body":"• Reports Q4 (Dec) earnings of $0.70 per share, excluding non-recurring items, $0.02 better than the FactSet Consensus of $0.68; revenues rose 13.7% year/year to $440.3 mln vs the $439.76 mln FactSet Consensus.\n• Co issues in-line guidance for Q1, sees Q1 revs of $391.4-432.6 mln vs. $408.38 mln FactSet Consensus.\n• In September 2023, Intel (INTC) signed a contract with Tower to manufacture 300mm wafers for Tower's customers in Intel's New Mexico facility. Recently, Intel has expressed its intention not to perform under the agreement. The parties are presently in a mediation process. The flows which have been transferred, or were in the process of being transferred, were originally qualified in Tower's Fab7 in Japan. Customers are now being redirected to be supported by Fab7."},{"time":"07:09","ticker":"KHC","headline":"Kraft Heinz beats by $0.06, reports revs in-line; guides FY26 EPS below consensus; pauses work related to separation; to invest $600 mln in commercial levers","body":"• Reports Q4 (Dec) earnings of $0.67 per share, excluding non-recurring items, $0.06 better than the FactSet Consensus of $0.61; revenues fell 3.4% year/year to $6.35 bln vs the $6.37 bln FactSet Consensus.\n• Co issues downside guidance for FY26, sees EPS of $1.98-2.10, excluding non-recurring items, vs. $2.47 FactSet Consensus. Co sees FY26 organic net sales down 1.5-3.5% versus the prior year. This includes an approximate 100 basis point impact from incremental SNAP headwinds.\n• \"When I decided to join Kraft Heinz, I knew that this was an exciting opportunity to contemporize iconic brands, better serve consumers and customers, and build meaningful shareholder value.\" said Steve Cahillane, CEO of Kraft Heinz. \"Since joining the company, I have seen that the opportunity is larger than expected and that many of our challenges are fixable and within our control. My number one priority is returning the business to profitable growth, which will require ensuring all resources are fully focused on the execution of our operating plan. As a result, we believe it is prudent to pause work related to the separation and we will no longer incur related dis-synergies this year.\"\n• \"In order to accelerate the momentum we are already seeing in our Taste Elevation portfolio and to drive recovery in our U.S. business, we are today announcing a $600 million investment across Marketing, Sales, and R&D as well as product superiority and select pricing.\""},{"time":"07:09","ticker":"LH","headline":"Labcorp Holdings Inc. launches first FDA-cleared blood test for Alzheimer's disease assessment in primary care","body":"• Elecsys pTau-181 test helps clinicians rule out Alzheimer's disease by identifying patients unlikely to have amyloid pathology.\n• Now available nationwide in primary care settings for patients aged 55 and older experiencing symptoms of cognitive decline.\n• Expands Labcorp's comprehensive portfolio of Alzheimer's disease blood tests across both primary and specialty care settings."},{"time":"07:07","ticker":"JG","headline":"Aurora Mobile announces a strategic partnership with affiliate entities of PAG Pegasus Fund","body":"• Leveraging Aurora Mobile's proprietary big data capabilities, the two organizations will collaborate to identify and execute data- and AI-driven investment opportunities.\n• Under the terms of the strategic partnership, PAG Pegasus will allocate $10 million toward an investment strategy supported by Aurora Mobile's data insights. The two companies will share in the investment returns based on realized fund performance. Separately, Aurora Mobile has reached an agreement to issue three-year warrants to PAG Pegasus.\n• These warrants grant PAG Pegasus the right to purchase up to 725,000 American depositary shares at an exercise price of $13.80 per ADS. The exercise price represents a premium of approximately 85% over the Company's average closing price of US$7.43 per ADS over the most recent 10 trading days. If fully exercised, the warrants would provide gross proceeds of $10 million for the Company."},{"time":"07:07","ticker":"KRNT","headline":"Kornit Digital beats by $0.06, beats on revs; guides Q1 revs in-line","body":"• Reports Q4 (Dec) earnings of $0.18 per share, $0.06 better than the FactSet Consensus of $0.12; revenues fell 3.0% year/year to $58.86 mln vs the $58.16 mln FactSet Consensus.\n• On a non-GAAP basis, gross profit margin was 50.7% compared with 55.1% in the prior year period.\n• Ended 2025 with ~$25 million in ARR from AIC.\n• Co issues in-line guidance for Q1, sees Q1 revs of $45-$49 mln vs. $46.45 mln FactSet Consensus. Sees adjusted EBITDA margin between negative 10% to negative 4% of revenue."},{"time":"07:06","ticker":"CHEF","headline":"Chefs' Warehouse beats by $0.06, beats on revs; guides FY26 revs in-line","body":"• Reports Q4 (Dec) earnings of $0.68 per share, excluding non-recurring items, $0.06 better than the FactSet Consensus of $0.62; revenues rose 10.5% year/year to $1.14 bln vs the $1.1 bln FactSet Consensus.\n• Co issues in-line guidance for FY26, sees FY26 revs of $4.35-4.45 bln vs. $4.4 bln FactSet Consensus."},{"time":"07:06","ticker":"R","headline":"Ryder System beats by $0.02, reports revs in-line; guides Q1 EPS below consensus; guides FY26 EPS below consensus, revs below consensus","body":"• Reports Q4 (Dec) earnings of $3.59 per share, excluding non-recurring items, $0.02 better than the FactSet Consensus of $3.57; revenues fell 0.4% year/year to $3.17 bln vs the $3.19 bln FactSet Consensus.\n• Co issues downside guidance for Q1, sees EPS of $2.10 to $2.35, excluding non-recurring items, vs. $2.67 FactSet Consensus.\n• Co issues downside guidance for FY26, sees EPS of $13.45 to $14.45, excluding non-recurring items, vs. $14.62 FactSet Consensus; sees FY26 revs of approx +1% yr/yr or $12.792 bln vs. $13.1 bln FactSet Consensus."},{"time":"07:06","ticker":"CLBT","headline":"Cellebrite DI beats by $0.04, beats on revs; guides Q1 revs above consensus; guides FY26 revs above consensus","body":"• Reports Q4 (Dec) earnings of $0.14 per share, $0.04 better than the FactSet Consensus of $0.10; revenues rose 28.8% year/year to $128.8 mln vs the $126.07 mln FactSet Consensus.\n• Co issues upside guidance for Q1, sees Q1 revs of $126-128 mln vs. $125.60 mln FactSet Consensus.\n• Co issues upside guidance for FY26, sees FY26 revs of $567-573 mln vs. $554.49 mln FactSet Consensus.\n• \"Cellebrite closed 2025 with a solid fourth quarter that capped a year of meaningful strategic progress,\" stated Thomas E. Hogan, Cellebrite's CEO. \"We cemented our Inseyets offering as the gold standard in digital forensics, drove strong adoption of our SaaS and cloud-based offerings, completed our first major acquisition and added important talent across the Company. Despite a challenging U.S. Federal spending environment, we drove 21% ARR growth in 2025, which reflects expansion across all of our major geographies and our flagship offerings, as well as the modest contribution from Corellium. Our success in growing the top line while expanding profit margins and generating outstanding free cash flow is a direct byproduct of the value of our platform, the strength of customer relationships and our ongoing commitment to thoughtful commitment to thoughtful spending and optimized resource allocation.\""},{"time":"07:05","ticker":"TEX","headline":"Terex beats by $0.01, beats on revs; Issues FY26 guidance","body":"• Reports Q4 (Dec) earnings of $1.12 per share, excluding non-recurring items, $0.01 better than the FactSet Consensus of $1.11; revenues rose 6.2% year/year to $1.32 bln vs the $1.3 bln FactSet Consensus.\n• Bookings of $1.9 billion grew 32% year-over-year on a pro forma13 basis, including growth in all three segments, reflects a book-to-bill of 145%.\n• Co issues guidance for FY26, sees EPS of $4.50-$5.00, excluding non-recurring items; sees FY26 revs of $7.5-$8.1 bln.Expect pro forma EBITDA to grow by about $100 million or 12% YOY to between $930 million and $1 billion, or 12.4% EBITDA margin at the mid-point.This outlook includes 11 months impact of the new Specialty Vehicle segment (former REV).\n• Expect pro forma EBITDA to grow by about $100 million or 12% YOY to between $930 million and $1 billion, or 12.4% EBITDA margin at the mid-point.\n• This outlook includes 11 months impact of the new Specialty Vehicle segment (former REV)."},{"time":"07:04","ticker":"BKR","headline":"Baker Hughes announces an award from Twenty20 Energy for 10 Frame 5 gas turbines and associated generator technology supporting up to 250 MW of power generation capacity","body":"• Baker Hughes will supply 10 Frame 5 gas turbines and associated equipment for data center projects in the U.S.\n• Award marks a pivotal step toward Baker Hughes and Twenty20 Energy's multi-gigawatt strategic collaboration for U.S. data center power generation."},{"time":"07:04","ticker":"GFS","headline":"GlobalFoundries beats by $0.08, beats on revs; guides Q1 EPS in-line, revs in-line","body":"• Reports Q4 (Dec) earnings of $0.55 per share, excluding non-recurring items, $0.08 better than the FactSet Consensus of $0.47; revenues were unchanged year/year at $1.83 bln vs the $1.8 bln FactSet Consensus.\n• Co issues in-line guidance for Q1, sees EPS of $0.30-0.40, excluding non-recurring items, vs. $0.35 FactSet Consensus; sees Q1 revs of $1.60-1.65 bln vs. $1.61 bln FactSet Consensus."},{"time":"07:03","ticker":"PANW","headline":"Palo Alto Networks completes acquisition of CyberArk (CYBR); announces intent to dual-list on the Tel Aviv Stock Exchange","body":"• PANW announces intent to dual-list on the Tel Aviv Stock Exchange (TASE): Building on CyberArk's heritage and Israel's position as a global cybersecurity powerhouse, Palo Alto Networks announces its intent to pursue a secondary listing on the TASE. As part of this historic move, the company plans to adopt the \"CYBR\" ticker on the TASE, providing a world-class tribute to the brand CyberArk built while ensuring its identity remains a cornerstone of the global strategy.\n• Palo Alto Networks will continue to be listed and trade under the \"PANW\" ticker on the NASDAQ Global Select Market. This listing would position Palo Alto Networks as the largest company listed on the TASE by market cap.\n• Transaction Details: Under the terms of the agreement, CyberArk shareholders are entitled to receive $45.00 in cash and 2.2005 shares of Palo Alto Networks common stock for each CyberArk ordinary share."},{"time":"07:03","ticker":"VRTS","headline":"Virtus Investment Partners reports preliminary assets under management of $158.4 bln and other fee earning assets of $1.8 bln for total client assets of $160.2 bln as of January 31, 2026","body":"The change in AUM from December 31, 2025 reflects net outflows in retail separate accounts, institutional accounts, and U.S. retail funds, partially offset by market performance and positive net flows in exchange-traded funds."},{"time":"07:03","ticker":"U","headline":"Unity Software beats by $0.03, beats on revs; guides Q1 revs below consensus","body":"• Reports Q4 (Dec) earnings of $0.24 per share, excluding non-recurring items, $0.03 better than the FactSet Consensus of $0.21; revenues rose 10.1% year/year to $503.09 mln vs the $492.22 mln FactSet Consensus.\n• Co issues downside guidance for Q1, sees Q1 revs of $480-490 mln vs. $491.98 mln FactSet Consensus.Expects first quarter adjusted EBITDA of $105-110 million.\n• Expects first quarter adjusted EBITDA of $105-110 million."},{"time":"07:03","ticker":"ACB","headline":"Aurora Cannabis is expanding its Aurora medical portfolio in Australia and New Zealand, delivering patients and prescribers enhanced choice, reliable quality, and easier access to science-backed products","body":"The expansion underscores the company's ongoing dedication to meeting the unique needs of patients and healthcare professionals in the region, reflecting Aurora's strategic focus on long-term global growth."},{"time":"07:02","ticker":"DAN","headline":"Dana Inc increases quarterly dividend 20% to $0.12/share from $0.10/share; increased and extended the share repurchase program","body":"Also today, the board of directors increased and extended the share repurchase program from $1 billion by 2027 to a total of $2 billion by 2030, including the $750 million already returned under the program."},{"time":"07:02","ticker":"MINE","headline":"Mayfair Gold presents the initial results from the 2025 grade control drilling program at the Fenn-Gib Project","body":"VANCOUVER, BC, Feb. 11, 2026 /PRNewswire/ - Mayfair Gold Corp. (\"Mayfair\", \"Mayfair Gold\", or the \"Company\") (TSXV: MFG) (NSYE: MINE) is pleased to announce the initial results from the tight-spaced, grade control drilling program (\"Grade Control Program\" or \"Program\") at the Fenn-Gib Project in Northern Ontario.Click here for full release."},{"time":"07:01","ticker":"MLM","headline":"Martin Marietta misses by $0.16, misses on revs; guides FY26 revs below consensus","body":"• Reports Q4 (Dec) earnings of $4.62 per share, $0.16 worse than the FactSet Consensus of $4.78; revenues rose 9.3% year/year to $1.54 bln vs the $1.65 bln FactSet Consensus.\n• Co issues downside guidance for FY26, sees FY26 revs of $6.42-6.78 bln vs. $7.15 bln FactSet Consensus."},{"time":"07:00","ticker":"SUMRX","headline":"Asian Markets Close: Nikkei HOLIDAY, Hang Seng +0.3%, Shanghai +0.1%","body":"• In economic data: China's January CPI 0.2% m/m (expected 0.3%; last 0.2%); 0.2% yr/yr (expected 0.4%; last 0.8%). January PPI -1.4% yr/yr (expected -1.5%; last -1.9%) South Korea's January Unemployment Rate 3.0% (last 3.3%) Australia's Q4 Invest Housing Finance 7.9% m/m (last 9.2%) and Home Loans 10.6% m/m (last 6.2%)\n• China's January CPI 0.2% m/m (expected 0.3%; last 0.2%); 0.2% yr/yr (expected 0.4%; last 0.8%). January PPI -1.4% yr/yr (expected -1.5%; last -1.9%)\n• South Korea's January Unemployment Rate 3.0% (last 3.3%)\n• Australia's Q4 Invest Housing Finance 7.9% m/m (last 9.2%) and Home Loans 10.6% m/m (last 6.2%)\n• Japan's Nikkei: HOLIDAY\n• Hong Kong's Hang Seng: +0.3%\n• China's Shanghai Composite: +0.1%\n• India's Sensex: -0.1%\n• South Korea's Kospi: +1.0%\n• Australia's ASX All Ordinaries: +1.6%\n• USD/JPY: -0.6% to 153.50\n• USD/CNH: UNCH at 6.9096\n• USD/INR: +0.1% to 90.65"},{"time":"06:56","ticker":"ACM","headline":"Aecom Tech announces it will deliver detailed design services for the Sydney Metro West Line Wide Systems package in a joint venture with WSP, supporting John Holland, the project lead and contractor","body":"• Sydney Metro West is a transformative project that is expected to double rail capacity between Parramatta and Sydney CBD, providing Sydney with fast and reliable transportation and aiding the city's rapid growth.\n• The joint venture will lead the design of the 24-kilometer twin-bore tunnel fit out, a new metro train depot and service facility, a new metro traction power system and tunnel ventilation system, and the train systems, operations and maintenance package."},{"time":"06:55","ticker":"SCANX","headline":"Early premarket gappers","body":"• Gapping up: MNTN +37.4%, STIM +28.4%, BETA +19.6%, TDC +15.6%, NET +14.3%, VRT +13.9%, HNGE +13.2%, RBKB +11.3%, LSCC +10.5%, AEIS +7.1%, JHX +6.6%, KVYO +6.1%, UFCS +5.1%, NKTR +4.2%, DIOD +4.2%, FRMI +4%, GNRC +3.7%, CAMT +3.4%, SUZ +3%, VREX +2%, RZLV +1.9%, TMHC +1.9%, TTE +1.7%, NOG +1.6%, F +1.5%, BL +1.5%, APAM +1.3%, EW +1.2%, RRR +1.2%, WELL +1.1%, AIG +1.1%, SAM +1%\n• MNTN +37.4%, STIM +28.4%, BETA +19.6%, TDC +15.6%, NET +14.3%, VRT +13.9%, HNGE +13.2%, RBKB +11.3%, LSCC +10.5%, AEIS +7.1%, JHX +6.6%, KVYO +6.1%, UFCS +5.1%, NKTR +4.2%, DIOD +4.2%, FRMI +4%, GNRC +3.7%, CAMT +3.4%, SUZ +3%, VREX +2%, RZLV +1.9%, TMHC +1.9%, TTE +1.7%, NOG +1.6%, F +1.5%, BL +1.5%, APAM +1.3%, EW +1.2%, RRR +1.2%, WELL +1.1%, AIG +1.1%, SAM +1%\n• Gapping down: UPB -29.9%, MAT -27.3%, RPD -24.2%, ANGI -19.7%, LYFT -17.4%, MBC -16.9%, ALAB -12.1%, AVTR -12.1%, VPG -10.4%, MRNA -10%, LEU -8.1%, PEGA -8.1%, HUM -8%, HOOD -7.8%, GLTO -6.6%, MIR -6.1%, OI -5.1%, ZG -4.4%, LAD -4%, SITE -3.7%, GILD -3.3%, PSN -3.1%, RMBS -2.8%, NTES -2.5%, SW -2.5%, FRSH -2.4%, EXEL -2.3%, RILY -2%, IVT -2%, LTM -1.9%, CURB -1.4%, FLNG -1.4%, PLTR -1.3%, SOLS -1.2%\n• UPB -29.9%, MAT -27.3%, RPD -24.2%, ANGI -19.7%, LYFT -17.4%, MBC -16.9%, ALAB -12.1%, AVTR -12.1%, VPG -10.4%, MRNA -10%, LEU -8.1%, PEGA -8.1%, HUM -8%, HOOD -7.8%, GLTO -6.6%, MIR -6.1%, OI -5.1%, ZG -4.4%, LAD -4%, SITE -3.7%, GILD -3.3%, PSN -3.1%, RMBS -2.8%, NTES -2.5%, SW -2.5%, FRSH -2.4%, EXEL -2.3%, RILY -2%, IVT -2%, LTM -1.9%, CURB -1.4%, FLNG -1.4%, PLTR -1.3%, SOLS -1.2%"},{"time":"06:51","ticker":"A","headline":"Agilent receives FDA approval for PD-L1 IHC 22C3 pharmDx in epithelial ovarian, fallopian tube, or primary peritoneal carcinoma","body":"• The Co. announcs that the U.S. Food and Drug Administration has approved PD-L1 IHC 22C3 pharmDx, Code SK006, as the only FDA-approved companion diagnostic indicated to aid in identifying first-line patients with epithelial ovarian, fallopian tube, or primary peritoneal carcinoma, whose tumors express PD-L1 and who may be eligible for treatment with KEYTRUDA, Merck's (MRK) anti-PD-1 therapy.\n• PD-L1 IHC 22C3 pharmDx, Code SK006, enables pathologists to assess PD-L1 expression at the time of diagnosis, supporting informed treatment decisions in a disease where therapeutic options remain limited for many patients. This approval marks the seventh FDA approved companion diagnostic indication currently available for PD-L1 IHC 22C3 pharmDx, Code SK006, for use with KEYTRUDA."},{"time":"06:50","ticker":"PURR","headline":"Hyperliquid Strategies Inc reports financial results for the quarter ended December 31, 2025","body":"NEW YORK, Feb. 11, 2026 /PRNewswire/ -- Hyperliquid Strategies Inc (NASDAQ: PURR) (\"HSI\" or the \"Company\"), the premier digital asset treasury platform focused on the Hyperliquid ecosystem, today reported its financial and operational results for the fiscal quarter and six months ended December 31, 2025.Click here for full release."},{"time":"06:50","ticker":"IHG","headline":"Intercontinental Hotels Group announces that Deanna Oppenheimer has today resumed her duties as Non-Executive Chair following a short-term leave of absence for medical reasons","body":"Senior Independent Director Graham Allan will now resume his normal duties, having assumed Chair responsibilities on an interim basis during this period."},{"time":"06:50","ticker":"CIM","headline":"Chimera Investment Corporation reports fourth quarter and full year 2025 earnings","body":"\"We're extremely pleased with our fourth-quarter results and the meaningful increase in our dividend,\" said Phillip J. Kardis II, President and CEO. \"What you're seeing now is the early return on the transformation we initiated in December 2024-focused, deliberate, and built for the long-term.\"Click here for full release."},{"time":"06:50","ticker":"DBI","headline":"Designer Brands announces that Sheamus Toal will join the company as Executive Vice President, Chief Financial Officer and Principal Financial Officer, effective February 16, 2026","body":"• Mark Haley, who has served as Interim Principal Financial Officer during the transition period, will return full time to his position as Senior Vice President, Controller and Principal Accounting Officer.\n• Most recently, Sheamus served as Chief Operating Officer and Chief Financial Officer of The Children's Place, overseeing finance and end-to-end operations for a multi-brand public retailer with significant size and scale."},{"time":"06:49","ticker":"CIM","headline":"Chimera Investment increases quarterly common stock dividend to $0.45/share from $0.37/share","body":""},{"time":"06:48","ticker":"THC","headline":"Tenet Healthcare beats by $0.63, reports revs in-line; guides FY26 EPS in-line, revs in-line","body":"• Reports Q4 (Dec) earnings of $4.70 per share, excluding non-recurring items, $0.63 better than the FactSet Consensus of $4.07; revenues rose 8.9% year/year to $5.53 bln vs the $5.47 bln FactSet Consensus.\n• Co issues in-line guidance for FY26, sees EPS of $16.19-18.47, excluding non-recurring items, vs. $16.44 FactSet Consensus; sees FY26 revs of $21.5-22.3 bln vs. $22.22 bln FactSet Consensus.FY 2026 Adjusted EBITDA Outlook is expected to be in the range of $4.485 billion to $4.785 billion. Adjusted free cash flow of $2.5-2.8 bln.\n• FY 2026 Adjusted EBITDA Outlook is expected to be in the range of $4.485 billion to $4.785 billion.\n• Adjusted free cash flow of $2.5-2.8 bln."},{"time":"06:47","ticker":"MRK","headline":"Merck announces the U.S. FDA approved KEYTRUDA and KEYTRUDA QLEX plus paclitaxel, with or without bevacizumab, for the treatment of adults with PD-L1+, as determined by an FDA-authorized test, platinum-resistant epithelial ovarian, fallopian tube or primary peritoneal carcinoma, who have received one or two prior systemic treatment regimens","body":"• KEYTRUDA and KEYTRUDA QLEX are the first and only PD-1 inhibitors approved for adults with platinum-resistant epithelial ovarian, fallopian tube or primary peritoneal carcinoma with PD-L1+ tumors.\n• Approvals based on Phase 3 KEYNOTE-B96 trial that demonstrated the KEYTRUDA regimen reduced the risk of disease progression or death by 28% and reduced the risk of death by 24% compared to placebo plus paclitaxel with or without bevacizumab."},{"time":"06:43","ticker":"LEU","headline":"Centrus Energy announces that its subsidiary, American Centrifuge Operating, LLC, has agreed to a strategic collaboration with Fluor (FLR) to serve as its Engineering, Procurement and Construction contractor as Centrus proceeds with its previously announced multi-billion-dollar expansion of its uranium enrichment capacity in Piketon, Ohio","body":"• Under the multi-year contract, Fluor will lead engineering and design of the expanded capacity in Ohio, manage the supply chain and procurement of key materials and services, oversee construction at the site, and support the commissioning of the new capacity.\n• The expansion project includes large-scale production of Low-Enriched Uranium (LEU) to address its substantial commercial LEU enrichment contingent backlog of $2.3 billion and growing demand from existing reactors. The company also recently announced that it is planning on building 12 metric tons of High-Assay, Low-Enriched Uranium (HALEU) annual capacity for next-generation reactors. In addition, Centrus is the only production-ready option for national security missions and was recently notified by the National Nuclear Security Administration of its intent to sole source certain uranium enrichment activities from Centrus."},{"time":"06:41","ticker":"BWA","headline":"BorgWarner beats by $0.16, beats on revs; guides FY26 EPS in line; FY26 revs below consensus; signed a master supply agreement with TurboCell","body":"• Reports Q4 (Dec) earnings of $1.35 per share, excluding non-recurring items, $0.16 better than the FactSet Consensus of $1.19; revenues rose 3.9% year/year to $3.57 bln vs the $3.53 bln FactSet Consensus.\n• Light vehicle eProducts grew approximately 23% in 2025 compared with 2024 due to demand for the Company's leading-edge hybrid and electric technologies in Europe and Asia.The Company's U.S. GAAP operating margin was 3.7%, which includes $624 million of goodwill, intangible asset and property, plant and equipment impairment charges within our PowerDrive Systems and\n• Battery & Charging Systems segments. BorgWarner achieved an adjusted operating margin of 10.7% during 2025, up 60 basis points compared with 2024. This increase was driven by strong eProducts growth and cost controls across the business.\n• Operating cash flow increased to $1,648 million, up approximately 19% compared to 2024. Free cash flow increased to $1,208 million, up approximately 66% compared with 2024 due to strong operating income and capital expenditure management.\n• Co issues guidance for FY26, sees EPS of $5.00-5.20, excluding non-recurring items, vs. $5.14 FactSet Consensus; sees FY26 revs of $14.0-14.3 bln vs. $14.57 bln FactSet Consensus.\n• Co also announced it has signed a Master Supply Agreement with TurboCell, a subsidiary of full stack data center infrastructure developer Endeavour, to supply a highly modular turbine generator system. BorgWarner expects the product to be a transformative power generation solution for the next wave of artificial intelligence driven data center demand and other microgrid applications. BorgWarner believes this solution addresses the growing demand for high power alternatives to traditional power generation. The turbine generator system is expected to be deployed to support AI campuses at gigawatt scale.\n• BorgWarner has worked with TurboCell for more than three years to bring the turbine generator system to market. The product will offer adaptability for diverse applications, including backup and prime power, advanced controls and dynamic response to manage power transients and grid peaks. It is also expected to meet future CARB emission environmental standards, or stricter emission levels, and allow for flexible fuel types including natural gas, propane, diesel and hydrogen. This exciting new technology leverages BorgWarner's many core competencies, including its world class turbocharging, thermal management, power electronics, advanced software controls and high-speed rotating electric capabilities. BorgWarner expects to leverage its robust automotive supply base and world class manufacturing capabilities to maximize vertical integration by controlling approximately 65% of the turbine generator system content.\n• The Company expects production to begin in Hendersonville, North Carolina in 2027, with an initial 2 GW of capacity installed."},{"time":"06:41","ticker":"WAB","headline":"Wabtec beats by $0.02, beats on revs; guides FY26 EPS in-line, revs above consensus; increases buyback; increases dividend","body":"• Reports Q4 (Dec) earnings of $2.10 per share, excluding non-recurring items, $0.02 better than the FactSet Consensus of $2.08; revenues rose 14.8% year/year to $2.96 bln vs the $2.87 bln FactSet Consensus.\n• Co issues guidance for FY26, sees EPS of $10.05 to $10.45, excluding non-recurring items, vs. $10.20 FactSet Consensus; sees FY26 revs of $12.19 bln to $12.49 bln vs. $12 bln FactSet Consensus.\n• Buyback authorization increased by $1.2 bln.\n• Quarterly dividend increased by 24% to $0.31 (announced last week)."},{"time":"06:40","ticker":"NI","headline":"NiSource beats by $0.01; reaffirms FY26 EPS guidance","body":"• Reports Q4 (Dec) earnings of $0.51 per share, excluding non-recurring items, $0.01 better than the FactSet Consensus of $0.50.\n• Co reaffirms guidance for FY26, sees EPS of $2.02-2.07 vs. $2.05 FactSet Consensus.The company expects to invest approximately $28.0 billion from 2026--2030 under its consolidated capital plan, which includes utility system modernization initiatives and nearly $7.0 billion in strategic data center infrastructure investments. This consolidated investment plan is expected to support an anticipated compound annual growth rate (CAGR) with respect to non-GAAP consolidated adjusted EPS of 8%-9% and consolidated rate base growth of 9%-11% from 2026 through 2033.\n• The company expects to invest approximately $28.0 billion from 2026--2030 under its consolidated capital plan, which includes utility system modernization initiatives and nearly $7.0 billion in strategic data center infrastructure investments. This consolidated investment plan is expected to support an anticipated compound annual growth rate (CAGR) with respect to non-GAAP consolidated adjusted EPS of 8%-9% and consolidated rate base growth of 9%-11% from 2026 through 2033."},{"time":"06:39","ticker":"RYAAY","headline":"Ryanair Hldgs: eDreams ODIGEO welcomes a decisive ruling by the Commercial Court No. 12 of Barcelona, which has warned Ryanair that it will incur criminal liability if it persists in its continued disobedience of court mandates secured by eDreams ODIGEO","body":"• Commercial Court No. 12 of Barcelona orders Ryanair to comply with its orders or face criminal proceedings for the crime of disobedience to judicial authority.\n• The order grants the provisional enforcement of a July 2025 ruling that found that Ryanair had conducted acts of unfair competition by denigration, which has since been repeatedly violated by the airline.\n• Ryanair has been given a 10-day deadline to comply, which includes withdrawing denigrating content and publishing a formal rectification on its website.\n• The airline faces monthly coercive fines for every month it remains in breach of the judicial mandates."},{"time":"06:38","ticker":"SN","headline":"SharkNinja beats by $0.13, reports revs in-line; guides FY26 EPS in-line, revs below consensus; Announces a share repurchase program of up to $750 mln","body":"• Reports Q4 (Dec) earnings of $1.93 per share, excluding non-recurring items, $0.13 better than the FactSet Consensus of $1.80; revenues rose 17.6% year/year to $2.1 bln vs the $2.09 bln FactSet Consensus.\n• Share Repurchase Program: Company announced that its Board of Directors authorized a share repurchase program of up to $750 million of the Company's outstanding ordinary shares.\n• Co issues guidance for FY26, sees EPS of $5.90-$6.00, excluding non-recurring items, vs. $5.98 FactSet Consensus; sees FY26 revs up 10-11%, equating to revenue of $7.04-$7.10 bln vs. $7.15 bln FactSet Consensus. Capital expenditures in the range of $190 million to $210 million primarily to support investments in new product launches and technology."},{"time":"06:37","ticker":"PSN","headline":"Parsons misses by $0.04, misses on revs; guides FY26 revs in-line","body":"• Reports Q4 (Dec) earnings of $0.75 per share, excluding non-recurring items, $0.04 worse than the FactSet Consensus of $0.79; revenues fell 7.5% year/year to $1.6 bln vs the $1.67 bln FactSet Consensus.\n• Co issues in-line guidance for FY26, sees FY26 revs of $6.5-6.8 bln vs. $6.65 bln FactSet Consensus.\n• Outlines mid-single-digit growth and double-digit margin targetsThe company targets mid-single-digit or better organic revenue growth, supported by portfolio exposure to global infrastructure spending and federal priorities.Total revenue growth is expected to reach mid-single-digit or better, supplemented by accretive M&A to enhance both top- and bottom-line performance.Adjusted EBITDA margin is projected to reach double digits by 2028, driven by operating leverage and ongoing efficiency initiatives.Free cash flow conversion is targeted at greater than 100%, positioning the business to fund organic investment and acquisitions.\n• The company targets mid-single-digit or better organic revenue growth, supported by portfolio exposure to global infrastructure spending and federal priorities.\n• Total revenue growth is expected to reach mid-single-digit or better, supplemented by accretive M&A to enhance both top- and bottom-line performance.\n• Adjusted EBITDA margin is projected to reach double digits by 2028, driven by operating leverage and ongoing efficiency initiatives.\n• Free cash flow conversion is targeted at greater than 100%, positioning the business to fund organic investment and acquisitions."},{"time":"06:33","ticker":"KDK","headline":"Kodiak AI announces that the U.S. Marine Corps has awarded the company a contract to help create autonomous military ground vehicles","body":"• Kodiak will integrate its AI-powered autonomous system into a Marine ROGUE-Fires carrier ground vehicle.\n• The collaboration further demonstrates the Kodiak Driver's versatility and adaptability for strategic military capabilities."},{"time":"06:32","ticker":"SW","headline":"Smurfit Westrock plc misses by $0.16, reports revs in-line; Provides 2030 Financial Targets","body":"• Reports Q4 (Dec) earnings of $0.34 per share, excluding non-recurring items, $0.16 worse than the FactSet Consensus of $0.50; revenues rose 0.5% year/year to $7.58 bln vs the $7.57 bln FactSet Consensus.\n• Adjusted EBITDA of $1,172 million, with an Adjusted EBITDA Margin of 15.5%.\n• Outlook: \"For the first quarter, we currently expect to deliver Adjusted EBITDA of between $1.1 billion and $1.2 billion and for the full year, we currently expect to deliver Adjusted EBITDA of between $5.0 billion and $5.3 billion.\"\n• Co also provides 2030 Financial Targets:Adjusted EBITDA1 of approximately $7 billion by 2030.Adjusted EBITDA CAGR1 of approximately 7% over 2026-2030.Adjusted EBITDA Margin1 expansion of approximately 300 basis points over 2026-2030.Cumulative Discretionary Free Cash Flow1 of approximately $14 billion over 2026-20302.Discretionary Free Cash Flow CAGR1 of approximately 17% over 2026-2030.Long-term Net Debt to EBITDA1 target of below 2.0x.Maintaining a progressive dividend policy with dividends of ~$5 billion between 2026-2030.\n• Adjusted EBITDA1 of approximately $7 billion by 2030.\n• Adjusted EBITDA CAGR1 of approximately 7% over 2026-2030.\n• Adjusted EBITDA Margin1 expansion of approximately 300 basis points over 2026-2030.\n• Cumulative Discretionary Free Cash Flow1 of approximately $14 billion over 2026-20302.\n• Discretionary Free Cash Flow CAGR1 of approximately 17% over 2026-2030.\n• Long-term Net Debt to EBITDA1 target of below 2.0x.\n• Maintaining a progressive dividend policy with dividends of ~$5 billion between 2026-2030."},{"time":"06:31","ticker":"UPB","headline":"Upstream Bio announces positive top-line results from the Phase 2 VALIANT clinical trial evaluating the safety and efficacy of verekitug in adults with severe asthma","body":"• Verekitug provided statistically significant and clinically meaningful reductions in annualized asthma exacerbation rate (AAER) with 100 mg q12 and 400 mg q24 week dosing.\n• Verekitug also delivered clinically meaningful improvements in lung function (FEV1) and exhaled nitric oxide (FeNO) with both dose regimens.\n• Verekitug was generally well tolerated, with a safety profile consistent with prior studies.\n• Over 90% of eligible patients have rolled over to the Phase 2 VALOUR long-term extension study.\n• Upstream Bio to advance verekitug into Phase 3 trials in severe asthma and CRSwNP following planned regulatory interactions.\n• Management will host a live webcast today at 8:00 a.m. ET."},{"time":"06:30","ticker":"MDGL","headline":"Madrigal Pharmaceuticals: Suzhou Ribo Life Science Co., Ltd. announces that they have entered into an exclusive worldwide licensing agreement with Madrigal Pharmaceuticals for six pre-clinical small interfering RNA programs for the treatment of metabolic dysfunction-associated steatohepatitis","body":"The collaboration will utilize Ribo's validated liver targeting siRNA GalSTARTM platform to develop novel treatments for MASH. The license agreement covers multiple existing pre-clinical assets from Ribo. In addition, both parties have the option to expand the scope of collaboration onto new siRNA programs including bi-specific siRNAs (agents that target two disease-causing genes simultaneously) utilizing Ribo's unique GalSTARTM and siRNA chemical modification platforms."},{"time":"06:28","ticker":"RIG","headline":"Transocean announces contract fixtures for two of its harsh environment semisubmersibles in Norway. In aggregate, the fixtures represent approximately $184 mln in firm contract backlog","body":"• The Transocean Encourage was awarded a seven-well contract extension. The estimated 365 days of work is expected to commence in the first quarter of 2027 in direct continuation of the rig's current program and contribute approximately $152 mln in backlog, excluding additional services.\n• Two one-well options have been exercised for the Transocean Enabler in direct continuation of the rig's current activity. The incremental 70 days of work is expected to contribute approximately $32 mln in backlog, excluding additional services, and commits the rig through December 2027."},{"time":"06:21","ticker":"TEO","headline":"Telecom Argentina prices of secondary offering of Telecom  Argentina's common stock by Fintech Telecom","body":"• Co announced the pricing of a secondary offering by Fintech Telecom LLC, as selling shareholder, of 4,050,549 American Depositary Shares representing its class B shares, at a price to the public of $11.15 per ADS. Fintech Telecom LLC has also granted a 30-day option to the underwriters to purchase up to 607,582 ADSs at the same price. The ADSs are currently listed on the New York Stock Exchange (\"NYSE\") under the symbol \"TEO.\" Each ADS represents five class B common shares, nominal value P$1.00 per share.\n• The Offering is expected to close on February 12, 2026, subject to customary closing conditions."},{"time":"06:20","ticker":"TMHC","headline":"Taylor Morrison Home beats by $0.03, beats on revs; announces $1 bln share buyback authorization","body":"• Reports Q4 (Dec) earnings of $1.76 per share, $0.03 better than the FactSet Consensus of $1.73; revenues fell 10.9% year/year to $2.1 bln vs the $1.94 bln FactSet Consensus.Home closings revenue of $1.96 billion 3,285 closings at an average sales price of $596,000 Home closings gross margin of 21.8%.\n• Home closings revenue of $1.96 billion 3,285 closings at an average sales price of $596,000\n• Home closings gross margin of 21.8%.\n• For Q1 expects Home Closings of approximately 2,200 and Home Closings gross margin of approximately 20%.\n• For 2026 expects Home Closings of approximately 11,000.\n• Taylor Morrison announced today that its Board of Directors has increased the amount available for future repurchases under its stock repurchase program to $1 billion of the Company's common stock. This program expires on December 31, 2027 and replaces the Company's prior share repurchase authorization."},{"time":"06:20","ticker":"","headline":"S&P futures vs fair value: +10.00. Nasdaq futures vs fair value: +26.00.","body":""},{"time":"06:20","ticker":"","headline":"European Markets","body":"FTSE...10410.52...+56.70...+0.60%. DAX...24917.07...-70.80...-0.30%."},{"time":"06:20","ticker":"","headline":"Asian Markets","body":"Nikkei...Holiday......... Hang Seng...27266.39...+83.20...+0.30%."},{"time":"06:17","ticker":"VPG","headline":"VPG reports fiscal 2025&nbsp;fourth quarter and twelve months results","body":"CHESTERBROOK, Pa., Feb. 11, 2026 (GLOBE NEWSWIRE) -- Vishay Precision Group, Inc. (NYSE: VPG), a leader in precision measurement technologies, today announced its results for its fiscal 2025 fourth quarter and twelve fiscal months ended December 31, 2025.Click here for full release."},{"time":"06:16","ticker":"AVTR","headline":"Avantor reports EPS in-line, beats on revs","body":"• Reports Q4 (Dec) earnings of $0.22 per share, excluding non-recurring items, in-line with the FactSet Consensus of $0.22; revenues fell 1.4% year/year to $1.66 bln vs the $1.63 bln FactSet Consensus."},{"time":"06:15","ticker":"TIMB","headline":"TIM S.A. approved the execution of a Share Purchase Agreement with IHS Fiber Brasil for the acquisition of 51% of the total capital stock of I-Systems Solues de Infraestrutura S.A. (I-Systems) currently held by IHS Brasil for R$ 950 mln","body":"I-Systems operates in the neutral fiber optic network sector in the Brazilian market, offering independent infrastructure for the wholesale segment. The company is present in the states of So Paulo, Minas Gerais, Rio de Janeiro, Gois, Paran, Bahia, Pernambuco and Amazonas, totaling approximately 9 million homes passed."},{"time":"06:08","ticker":"QXO","headline":"QXO, Inc to acquire Kodiak Building Partners in $2.25 bln deal","body":"• QXO, Inc. agreed to acquire Kodiak Building Partners from Court Square Capital Partners for approximately $2.25 bln, a transaction expected to be highly accretive to 2026 earnings.Consideration includes $2.0 bln in cash and 13.2 mln QXO shares, with QXO retaining the right to repurchase those shares at $40 per share; closing is targeted for early Q2 2026, subject to customary conditions.Kodiak generated about $2.4 bln in 2025 revenue as a U.S. distributor of structural and exterior building products, with roughly 40% of sales from Florida and Texas.The deal expands QXO's addressable market to over $200 bln and is expected to support margin expansion through procurement scale, network optimization, and technology-driven efficiencies.\n• Consideration includes $2.0 bln in cash and 13.2 mln QXO shares, with QXO retaining the right to repurchase those shares at $40 per share; closing is targeted for early Q2 2026, subject to customary conditions.\n• Kodiak generated about $2.4 bln in 2025 revenue as a U.S. distributor of structural and exterior building products, with roughly 40% of sales from Florida and Texas.\n• The deal expands QXO's addressable market to over $200 bln and is expected to support margin expansion through procurement scale, network optimization, and technology-driven efficiencies."},{"time":"06:07","ticker":"SITE","headline":"SiteOne Landscape Supply beats by $0.01, reports revs in-line","body":"• Reports Q4 (Dec) loss of $0.20 per share, $0.01 better than the FactSet Consensus of ($0.21); revenues rose 3.2% year/year to $1.05 bln vs the $1.05 bln FactSet Consensus.\n• \"With most of the commodity deflation behind us, we expect a more typical year of pricing in 2026 with overall prices increasing 1% to 3% for the full year,\" Doug Black continued. \"In terms of end markets, we believe overall demand will be flat in 2026, with steady growth in maintenance offsetting a decline in new residential construction, and with flat demand in our repair and upgrade and new commercial construction end-markets. With the benefit of our commercial initiatives, we expect to achieve positive sales volume growth, yielding low single-digit Organic Daily Sales growth for the full year. We also expect to increase our Gross margin through increased price realization and strong growth with private label products and small customers. We expect to achieve continued SG&A leverage through our operational initiatives, which include focus branch improvements and delivery cost reduction. Overall, including contributions from acquisitions, we expect to continue expanding our adjusted EBITDA margin in 2026.\" With all these factors in mind and including the negative effect of the 53rd week, we expect Adjusted EBITDA for fiscal year 2026 to be in the range of $425 million to $455 million.\n• With all these factors in mind and including the negative effect of the 53rd week, we expect Adjusted EBITDA for fiscal year 2026 to be in the range of $425 million to $455 million."},{"time":"06:07","ticker":"VRT","headline":"Vertiv beats by $0.07, reports revs in-line; guides Q1 EPS above consensus, revs in-line; guides FY26 EPS above consensus, revs above consensus","body":"• Reports Q4 (Dec) earnings of $1.36 per share, excluding non-recurring items, $0.07 better than the FactSet Consensus of $1.29; revenues rose 22.7% year/year to $2.88 bln vs the $2.88 bln FactSet Consensus.\n• Co issues guidance for Q1, sees EPS of $0.95-$1.01, excluding non-recurring items, vs. $0.94 FactSet Consensus; sees Q1 revs of $2.50-$2.70 bln vs. $2.54 bln FactSet Consensus.\n• Co issues upside guidance for FY26, sees EPS of $5.97-$6.07, excluding non-recurring items, vs. $5.33 FactSet Consensus; sees FY26 revs of $13.25-$13.75 bln vs. $12.41 bln FactSet Consensus."},{"time":"06:06","ticker":"SOLS","headline":"Solstice Advance Materials initiates quarterly dividend","body":"• Solstice Advanced Materials declared its first quarterly dividend of $0.075 per share, payable March 10, 2026 to shareholders of record February 24, 2026.\n• The dividend marks the company's initial capital return following its separation and early period as an independent public company.\n• At the current quarterly rate, the dividend implies an annualized payout of $0.30 per share, subject to Board approval each quarter."},{"time":"06:05","ticker":"HUM","headline":"Humana beats by $0.04, beats on revs; guides FY26 EPS below consensus","body":"• Reports Q4 (Dec) loss of $3.96 per share, excluding non-recurring items, $0.04 better than the FactSet Consensus of ($4.00); revenues rose 11.3% year/year to $32.52 bln vs the $32.04 bln FactSet Consensus.\n• Co issues downside guidance for FY26, sees EPS of at least $9.00, excluding non-recurring items, vs. $11.91 FactSet Consensus."},{"time":"06:04","ticker":"HLT","headline":"Hilton beats by $0.07, beats on revs; guides Q1 EPS above consensus; guides FY26 EPS below consensus","body":"• Reports Q4 (Dec) earnings of $2.08 per share, excluding non-recurring items, $0.07 better than the FactSet Consensus of $2.01; revenues rose 10.9% year/year to $3.09 bln vs the $2.97 bln FactSet Consensus.System-wide comparable RevPAR increased 0.5 percent compared to the same period in 2024 due to an increase in ADR, partially offset by modest occupancy declines. Adjusted EBITDA was $946 million for the fourth quarter.\n• System-wide comparable RevPAR increased 0.5 percent compared to the same period in 2024 due to an increase in ADR, partially offset by modest occupancy declines.\n• Adjusted EBITDA was $946 million for the fourth quarter.\n• Co issues upside guidance for Q1, sees EPS of $1.91-1.97, excluding non-recurring items, vs. $1.83 FactSet Consensus. System-wide comparable RevPAR, on a currency neutral basis, is projected to increase between 1.0 percent and 2.0 percent compared to the first quarter of 2025. Adjusted EBITDA is projected to be between $875 million and $895 million.\n• System-wide comparable RevPAR, on a currency neutral basis, is projected to increase between 1.0 percent and 2.0 percent compared to the first quarter of 2025.\n• Adjusted EBITDA is projected to be between $875 million and $895 million.\n• Co issues downside guidance for FY26, sees EPS of $8.65-8.77, excluding non-recurring items, vs. $9.13 FactSet Consensus.System-wide comparable RevPAR, on a currency neutral basis, is projected to increase between 1.0 percent and 2.0 percent compared to 2025. Adjusted EBITDA is projected to be between $4,000 million and $4,040 million. Net unit growth is projected to be between 6.0 percent and 7.0 percent.\n• System-wide comparable RevPAR, on a currency neutral basis, is projected to increase between 1.0 percent and 2.0 percent compared to 2025.\n• Adjusted EBITDA is projected to be between $4,000 million and $4,040 million. Net unit growth is projected to be between 6.0 percent and 7.0 percent."},{"time":"06:03","ticker":"GNRC","headline":"Generac misses by $0.11, misses on revs","body":"• Reports Q4 (Dec) earnings of $1.61 per share, excluding non-recurring items, $0.11 worse than the FactSet Consensus of $1.72; revenues fell 11.6% year/year to $1.09 bln vs the $1.16 bln FactSet Consensus.\n• FY26 net sales growth expected in the mid-teen percent range yr/yr."},{"time":"06:00","ticker":"SUMRX","headline":"Overnight Summary -- Markets stall as yen surges and gold bid signals quiet risk aversion","body":"• Markets are treading water this morning, with S&P futures barely above fair value as a sharp yen surge and a renewed bid in gold and silver hint at defensive positioning beneath an otherwise muted global backdrop. S&P futures are flattish, trading around 6961. The lackluster action saw buying dry up at 6986.00. The market finally broke through the 6975 support zone, trading as low as 6953.00 before the modest bounce back to the neutral zone.\n• Asian equities finished mixed on Wednesday as softer U.S. retail sales data and renewed AI-related caution prompted profit-taking after recent gains. Japan is closed for National Founding Day, while China trades sideways, with the Shanghai Composite little changed as January data show consumer inflation cooling to 0.2% and producer prices remaining in deflation, reinforcing expectations for continued monetary support. Hong Kong edges higher, with the Hang Seng up 0.31%, even as broader sentiment remains restrained. In the backdrop, a softer dollar lifts gold above $5,060, while oil firms on Middle East supply risks despite rising stockpiles.\n• European equities trade mostly lower as investors digest mixed earnings and await key U.S. jobs and inflation data for direction. The DAX slips around 0.3%, weighed down by sharp losses in Dassault Systmes and Commerzbank, even as Siemens Energy surges on strong profit growth and AI-driven demand. France's CAC 40 is pressured by weakness in technology. However, gains in TotalEnergies and Heineken provide partial support, while the FTSE 100 sees stock-specific moves, with strength in London Stock Exchange Group offset by declines in Barratt Developments. Bond yields ease modestly across the region, reflecting a cautious tone ahead of the Federal Reserve's next policy signals.\n• S&P Futures vs Fair Value: +1.0\n• 10 yr Note: 4.136%\n• USD/JPY: 153.25 -1.14\n• EUR/USD: 1.1920 +0.0023\n• Europe: FTSE: +0.4% DAX: -0.3% CAC: -0.5%\n• Asia: Hang Seng: +0.3% Shanghai: +0.1% Nikkei: CLOSED\n• Gold (5093.70 +62.70) Silver (84.720 +4.336) Crude (64.86 +0.90)"},{"time":"05:47","ticker":"WIRES","headline":"On The Wires","body":"• H World Group Limited (HTHT) announced the launch of Hanting Inn, a new economy hotel brand designed to address evolving travel needs while supporting scalable, asset-light growth. As an addition to the flagship Hanting brand family, Hanting Inn expands overall accessibility and coverage. Designed with a lower investment threshold, simplified construction standards and greater flexibility in location and property type, Hanting Inn enables faster rollout and deeper penetration into lower-tier cities and price-sensitive markets, reinforcing Hanting's ambition to make quality accommodation part of everyday travel infrastructure.\n• Pony AI Inc. (PONY) announced that it has been added to the MSCI China Index, effective after the market closes on February 27, 2026. This makes Pony.ai the first and only Robotaxi company in the index. This inclusion underscores Pony.ai's growing relevance in the global capital markets and reflects recognition of its long-term vision and execution track record.\n• As part of its ongoing commitment to transparency and keeping customers informed of the progress to strengthen the electric grid around Greater Houston, CenterPoint Energy (CNP) launched its new Community Progress Tracker. This new web-based, customer-focused map provides direct access to the public to track and measure progress on electric infrastructure upgrades on their street, in their neighborhood, or in their ZIP Code. All of the system upgrades that CenterPoint is making are critical to helping the company build and deliver the most resilient coastal grid in the nation."},{"time":"05:34","ticker":"LAD","headline":"Lithia Motors misses by $1.37, reports revs in-line","body":"• Reports Q4 (Dec) earnings of $6.74 per share, excluding non-recurring items, $1.37 worse than the FactSet Consensus of $8.11; revenues rose 0.3% year/year to $9.2 bln vs the $9.2 bln FactSet Consensus.Same-store sales nearly flat in the quarterUsed revenue increased 6.1% and used retail units increased 4.7% on a same store basis in the quarter\n• Same-store sales nearly flat in the quarter\n• Used revenue increased 6.1% and used retail units increased 4.7% on a same store basis in the quarter"},{"time":"05:12","ticker":"MRNA","headline":"Moderna receives FDA refusal-to-file for influenza vaccine","body":"• Moderna received a Refusal-to-File letter from the U.S. FDA's Center for Biologics Evaluation and Research for its mRNA-1010 seasonal influenza vaccine BLA.FDA cited the use of a licensed standard-dose flu vaccine comparator that it determined did not reflect the \"best-available standard of care,\" with no safety or efficacy concerns identified.Co has requested a Type A meeting with FDA to clarify the path forward; mRNA-1010 remains under review in the EU, Canada and Australia.Company does not expect any impact to its 2026 financial guidance from the refusal.\n• FDA cited the use of a licensed standard-dose flu vaccine comparator that it determined did not reflect the \"best-available standard of care,\" with no safety or efficacy concerns identified.\n• Co has requested a Type A meeting with FDA to clarify the path forward; mRNA-1010 remains under review in the EU, Canada and Australia.\n• Company does not expect any impact to its 2026 financial guidance from the refusal."},{"time":"05:06","ticker":"MDGL","headline":"Madrigal Pharmaceuticals licenses six siRNA assets to expand MASH pipeline","body":"• Madrigal Pharmaceuticals entered an exclusive global licensing agreement with Suzhou Ribo Life Science Co. Ltd. and its subsidiary Ribocure Pharmaceuticals AB for six preclinical siRNA programs targeting MASH.Madrigal will pay $60 mln upfront, with potential milestone payments of up to $4.4 bln plus royalties on net sales.Deal expands Co's pipeline to more than 10 programs across multiple stages, anchored by Rezdiffra and a fully enrolled Phase 3 F4c outcomes study.IND-enabling work on initial siRNA candidates is expected to begin in 2026 as Co advances combination and genetically targeted approaches.\n• Madrigal will pay $60 mln upfront, with potential milestone payments of up to $4.4 bln plus royalties on net sales.\n• Deal expands Co's pipeline to more than 10 programs across multiple stages, anchored by Rezdiffra and a fully enrolled Phase 3 F4c outcomes study.\n• IND-enabling work on initial siRNA candidates is expected to begin in 2026 as Co advances combination and genetically targeted approaches."},{"time":"05:04","ticker":"BDRBF","headline":"Bombardier secures up to $4.7 bln Challenger 3500 order from Vista","body":"• Bombardier Inc. received firm orders from Vista for 40 Challenger 3500 aircraft valued at $1.18 bln at 2026 list prices.Order includes options for 120 additional jets; if exercised, total potential value would reach $4.72 bln for 160 aircraft.Deal strengthens Bombardier's backlog in the super-midsize segment and reinforces recurring demand from a longstanding fleet customer.Challenger 3500 has surpassed 99.8% dispatch reliability and reached 100 deliveries faster than prior platforms in its category.\n• Order includes options for 120 additional jets; if exercised, total potential value would reach $4.72 bln for 160 aircraft.\n• Deal strengthens Bombardier's backlog in the super-midsize segment and reinforces recurring demand from a longstanding fleet customer.\n• Challenger 3500 has surpassed 99.8% dispatch reliability and reached 100 deliveries faster than prior platforms in its category."},{"time":"05:02","ticker":"PAX","headline":"Patria Investments to launch next Latin America private credit vintage","body":"• Patria Investments Limited is preparing a new vintage of its Latin America private credit strategy to target structural scarcity in corporate lending across the region.\n• Co builds on a $314 mln prior fund closed in May 2025, which has deployed over 70% of capital into 14 transactions and generated a 15.6% gross unlevered IRR as of Dec. 31, 2025."},{"time":"04:57","ticker":"WIRES","headline":"On The Wires","body":"• DXC Technology (DXC) announced the opening of its new Customer Experience Center in London. The center is designed to create an environment where DXC's experts can work directly with customers to help them move from experimenting with new technologies, including AI, to execution at scale. It will draw on the collective experience of 6,000 multidisciplinary DXC team members in the UK and Ireland including system architects, software engineers, industry specialists, and service delivery teams. Their collective expertise is reinforced by DXC's global network of 40,000 developers, enabling customers across the United Kingdom and Ireland to co-create solutions that deliver measurable, enterprise-scale business outcomes.\n• Vonage, part of Ericsson (ERIC), announced a strategic collaboration with C3 AI (AI) to launch C3 AI Field Services, a module of the C3 AI Asset Performance Suite of products, integrated with Vonage APIs. The AI-first module combines C3 AI's powerful Enterprise AI capabilities with Vonage's cutting-edge Communications APIs and Network APIs, to deliver superior performance, reliability and experiences for mobile enterprise field operations. This collaboration builds on a broader network-powered solutions offering from Vonage where application-aware networking, including advanced connectivity capabilities such as Quality on Demand, can be applied to support critical field workflows. Quality on Demand is the first advanced network API being showcased and represents one component of Vonage's larger vision for network intelligence that aligns network behavior with application intent.\n• Royal Philips (PHG) announced that the SEISMIC research consortium, coordinated by Philips, together with Erasmus MC as academic lead, has been awarded funding from the Innovative Health Initiative to transform neurosurgery through the seamless integration of minimally invasive surgical techniques and advanced imaging technologies. The EUR 23.5 million public funding will be complemented by EUR 14.9 million in in-kind contributions and additional resources from industry partners, supporting a five-year research and innovation program that also includes eight clinical studies.\n• Kanzhun Limited (BZ) announced the continued execution of its share repurchase program, utilizing over RMB40 million to repurchase 650,180 ordinary shares on February 9 and 10, 2026. In 2026, the Company has deployed nearly RMB260 million toward share repurchases. This move underscores the Company's ongoing commitment to shareholder returns. BOSS Zhipin maintains authorization under its existing program to repurchase up to USD250 million worth of its shares, with the program remaining active until the end of August 2026."},{"time":"04:54","ticker":"NTES","headline":"NetEase misses by RMB3.22, misses on revs","body":"• Reports Q4 (Dec) earnings of RMB 10.95 per share, RMB 3.22 worse than the FactSet Consensus of RMB 14.17; revenues rose 3.0% year/year to RMB 27.55 bln vs the RMB 28.72 bln FactSet Consensus."},{"time":"04:45","ticker":"RZLV","headline":"Rezolve AI to acquire Reward for $230 mln in all-cash deal","body":"• Rezolve Ai PLC agreed to acquire Reward for $230 mln in cash to combine conversational commerce with commerce media capabilities.Co will integrate Reward's first-party transaction data and bank distribution with its AI commerce and payments platform to enable closed-loop measurement from discovery through conversion.Reward brings established relationships with global banks and retailers across the UK, Europe, Middle East and Asia, supporting multinational deployment.Combined platform is positioned to expand in the Americas leveraging Rezolve Ai's existing market presence.\n• Co will integrate Reward's first-party transaction data and bank distribution with its AI commerce and payments platform to enable closed-loop measurement from discovery through conversion.\n• Reward brings established relationships with global banks and retailers across the UK, Europe, Middle East and Asia, supporting multinational deployment.\n• Combined platform is positioned to expand in the Americas leveraging Rezolve Ai's existing market presence."},{"time":"04:44","ticker":"WIRES","headline":"On The Wires","body":"• Intercontinental Exchange, Inc. (ICE) announced the launch of Cryptocurrency futures contracts based on seven CoinDesk Indices including CoinDesk 20 and CoinDesk 5 Indices. The CoinDesk indexed contracts are U.S. dollar denominated and cash-settled. Over $40 billion in assets under management are tied to CoinDesk Indices tracking the price of cryptocurrencies including Bitcoin, Ether and Solana.\n• 8x8, Inc. (EGHT) launched 8x8 Silent Mobile Authentication in the Philippines in partnership with PLDT Enterprise, the corporate business arm of PLDT. Recently, PLDT Enterprise introduced SmartSafe SilentAccess, its flagship solution from the SmartSafe API suite that enables fast, secure mobile user verification by validating users through mobile network and SIM-based signals.\n• AST SpaceMobile, Inc. (ASTS) announced the successful unfolding of its next-generation BlueBird 6 satellite. BlueBird 6 features the largest commercial communications array antenna ever deployed in Low Earth Orbit. Spanning approximately 2,400 square feet, the satellite is engineered to support peak data speeds of up to 120 Mbps with plans to deliver up to ten times the bandwidth capacity of the BlueBird 1-5 series. The aperture enables full 4G and 5G cellular broadband services, including voice, data, and video to standard, unmodified smartphones everywhere. The company is on track to launch 45--60 satellites by the end of 2026, with launches planned every one or two months on average.\n• Franklin Templeton, a unit of Franklin Resources (BEN), and Binance, the world's leading cryptocurrency exchange by trading volume and users, announced a new institutional off-exchange collateral program, making digital markets more secure and capital-efficient. Now live, eligible clients can use tokenized money market fund shares issued through Franklin Templeton's Benji Technology Platform as off-exchange collateral when trading on Binance."},{"time":"04:42","ticker":"GTLB","headline":"GitLab transcend showcases how intelligent orchestration helps accelerate innovation velocity across the software lifecycle","body":"All Remote - GitLab Inc., the intelligent orchestration platform for DevSecOps, today hosted GitLab Transcend, an exclusive virtual event for technology leaders highlighting the true potential of agentic AI for software delivery.Click here for full release."},{"time":"04:39","ticker":"FRMI","headline":"Fermi America secures $500 mln MUFG financing to fund gas turbine purchases","body":"• Fermi Inc. secured a $500 mln non-recourse turbine warehouse facility from MUFG Bank to fund acquisition of three Siemens Energy SGT6-5000F gas turbines.Proceeds will also repay an existing loan and support delivery, construction and deployment of additional turbines as the platform scales.Facility is structured as a repeatable financing vehicle to support future gigawatt-scale equipment purchases ahead of project-level financing.Turbine deliveries are expected to begin in 1H 2026, supporting over 2 GW of controlled generation capacity toward an initial 2.3 GW buildout.\n• Proceeds will also repay an existing loan and support delivery, construction and deployment of additional turbines as the platform scales.\n• Facility is structured as a repeatable financing vehicle to support future gigawatt-scale equipment purchases ahead of project-level financing.\n• Turbine deliveries are expected to begin in 1H 2026, supporting over 2 GW of controlled generation capacity toward an initial 2.3 GW buildout."},{"time":"04:35","ticker":"FLNG","headline":"FLEX LNG reports in-line results; beats on revs","body":"• Reports Q4 EPS of $0.43 vs $0.43 FactSet consensus; revs of $87.5 mln vs $84.4 mlnAverage Time Charter Equivalent rate of $70,119 per day for the fourth quarter 2025, compared to $70,921 per day for the third quarter 2025.The Company declared a dividend for the fourth quarter 2025 of $0.75 per share. The dividend is payable on or about March 12, 2026 to shareholders, on record as of February 27, 2026.\n• Average Time Charter Equivalent rate of $70,119 per day for the fourth quarter 2025, compared to $70,921 per day for the third quarter 2025.\n• The Company declared a dividend for the fourth quarter 2025 of $0.75 per share. The dividend is payable on or about March 12, 2026 to shareholders, on record as of February 27, 2026."},{"time":"04:22","ticker":"GLTO","headline":"Galecto prices offering of 14,473,685 shares of common stock at $19.00 per share","body":""},{"time":"04:21","ticker":"CURB","headline":"Curbline Properties prices offering of 8.0 mln shares of common stock for gross proceeds of ~$204 mln","body":""},{"time":"04:07","ticker":"MWH","headline":"SOLV Energy (Nasdaq) prices 20.5 mln share IPO at $25.00 per share, at the high end of the $22-25 expected range","body":""}],"fetchedAt":1770815282012},"savedAt":1770815282013}