{"data":{"updated":"2/10/2026, 2:05:18 PM","entries":[{"time":"09:54","ticker":"OSCR","headline":"CORRECTION: We have edited our prior earnings headline to indicate that the company's FY26 revenue guidance is well above the consensus estimate versus the prior indication of in line","body":""},{"time":"09:38","ticker":"SUMRX","headline":"Earnings/guidance movers","body":"• Gainers: ICHR +31.5%, VSTS +25.1%, SPOT +17.1%, LUXE +16.4%, OSCR +13%, IRMD +11.2%, DDOG +10%, CRDO +8.4%, PHG +9.5%, MAR +8.3%, RLGT +7.3%, RACE +6.8%, ENTA +6.7%, MAS +7.1%, HAS +6.7%, CTS +5.2%, CCSI +4.6%, WMB +4.7%, BLKB +3.9%, DGX +4.2%, AZN +3.9%, HSHP +3.5%, CMCO +4.9%, HOG +2.7%, XIFR +3.1%, ZBH +2%, ON +2.9%, UTL +2.8%, KT +1.9%, TSM +1.1%, NTB +1.5%, ENTG +1.5%, SSD +1.5%, TRMB +1.2%, DD +0.7%, BRX +1.4%, ASX +0.9%, SVM +1.2%, VNO +1%, FRHC +2.7%, CRBG +1%, UDR +0.8%, ACM +1%, CHT +0.8%, DRVN +0.2%, HMC +0.3%, BFH +0%, TGT +0.6%, ECL +1.1%, ARMK +0.6%, DUK +0.2%, AXTA +0.6%\n• Decliners: PAL -17.8%, UPWK -17.4%, GILT -15.3%, GTM -15.4%, MTW -14.4%, JMIA -12.8%, GT -12.5%, AMTM -10.1%, MEDP -10.7%, WCC -8.7%, SPGI -9%, XYL -7.9%, SAIA -8%, BP -5.1%, INCY -5.1%, CINF -3.1%, BCS -2.9%, KRC -2.5%, PFG -2.4%, AMKR -1.1%, KO -1.3%, FISV -2.3%, ACGL -0.5%, CVS -0.1%, ECL 0%, CRBG -0.3%, ASB -0.1%, INMD -0.6%"},{"time":"09:37","ticker":"NBIS","headline":"Nebius Group N.V. confirms agreement to acquire Tavily to add agentic search to its AI cloud platform","body":"• Co announced an agreement to acquire Tavily. The deal brings real-time search infrastructure into Nebius's AI cloud platform as the agentic AI market enters a period of rapid enterprise adoption.\n• This acquisition advances Nebius's strategy to build a unified platform where vertical AI companies and enterprises can build, tune, and run autonomous agents. By adding Tavily's agentic search to its existing AI cloud platform, Nebius is expanding the integrated software stack developers need to assemble and operate enterprise-grade agentic systems.\n• Tavily's technology becomes a critical component of this stack, complementing Nebius Token Factory. While Token Factory provides the high-performance inference required for agents to reason, Tavily provides the real-time web access required for factual accuracy. By combining high-performance inference with real-time grounding, Nebius provides the essential building blocks for the next generation of AI applications.\n• The addition of agentic search capabilities gives Nebius customers critical architecture they need to build autonomous agents that can navigate the web, verify facts, and execute complex real-world tasks, while eliminating the need for developers to patch together disparate vendors.\n• The transaction is expected to close in the next few weeks, subject to customary closing conditions. The transaction value has not been disclosed."},{"time":"09:30","ticker":"WIRES","headline":"On The Wires","body":"• Velo3D (VELO) has been selected as the first qualified additive manufacturing vendor to support the U.S. Army's Ground Vehicle Systems Center's campaign of accelerating qualified AM solutions throughout the Defense Industrial Base. This announcement was made during the Military Additive Manufacturing Summit on February 3, 2026 in Tampa, Florida.\n• BillionToOne (BLLN) announces the launch of Northstar PGx and Northstar Select CH. Northstar PGx and Northstar CH are add-on applications for Northstar Select, the most sensitive therapy selection liquid biopsy for advanced solid tumors, as demonstrated in a head-to-head clinical study, proven to uncover 50%+ more clinically actionable alterations.1 The launch expands the Northstar platform beyond genomic profiling to address chemotherapy safety and clonal hematapoeisis-two critical decision points in selecting the right therapy for patients."},{"time":"09:26","ticker":"UDMY","headline":"Udemy announces a strategic partnership with work AI leader, Glean; integration helps professionals lead AI transformation with real-time, context-aware learning","body":""},{"time":"09:20","ticker":"OPXS","headline":"Optex Systems has been awarded a new contract from a U.S. Government Prime Contractor, in support of a Night Vision Goggle system","body":"The order value is $2.19M with deliveries starting in Q2 of calendar 2026 through early 2027. With this order, the current Optex Systems Holdings' backlog is in excess of $38million."},{"time":"09:18","ticker":"EA","headline":"Electronic Arts disclosed merger waiting period with respect HSR Act expired at 11:59 p.m. Eastern Time on February 9, 2026","body":"The Merger remains subject to other closing conditions, including receipt of other required regulatory clearances. The Merger is expected to close during the first quarter of the Company's fiscal year ending March 31, 2027 (which corresponds to April 1, 2026 to June 30, 2026)."},{"time":"09:18","ticker":"SPSC","headline":"SPS Commerce introduces MAX, new capabilities embedded in SPS' agentic supply chain network","body":""},{"time":"09:15","ticker":"WIRES","headline":"On The Wires","body":"• Domo (DOMO) announced the launch of Domo MMM, a new AI-sidekick for marketers that powers measurement and is designed to help organizations understand which marketing investments are truly driving growth and which are not. Developed in collaboration with Stella Growth Intelligence, Domo MMM brings causal marketing measurement, scenario modeling, and AI-guided recommendations directly into the flow of business decision-making.\n• Smartsheet announced the expanded deployment of Brandfolder by Smartsheet to power Media Manager for Getty Images (GETY). As the technology behind Getty Images' digital asset management (DAM) solution, Brandfolder has become the industry standard for managing the scale, security and velocity required for the world's most significant cultural and sporting events."},{"time":"09:12","ticker":"WIRES","headline":"On The Wires","body":"• Similarweb (SMWB) launches AI Studio, an enterprise AI intelligence solution that fundamentally transforms how organizations access and act on digital market data. AI Studio sits on top of Similarweb's complete digital intelligence infrastructure - 100 million websites, 6 billion keywords, 4 million apps, 20 million companies, 50,000+ stock tickers, 557 million+ SKUs, and 37 months of historical data - making expert-level market research instantly accessible through natural conversation.\n• Evolv Technologies Holdings (EVLV) announces that its flagship product, Evolv Express, has been deployed at Dean E. Smith Center, Kenan Stadium, and select special events at Carmichael Arena. The historic venues are home to the North Carolina Tar Heels men's basketball, football, and women's basketball teams.\n• Butterfly Network (BFLY) announces that its Butterfly iQ+/iQ3 and Compass AI ultrasound solution have achieved GovRAMP and TX-RAMP Authorizations. The certifications authorize the Company to sell cloud services to all state and local government agencies, including in the state of Texas.\n• Mobileye Global Inc. (MBLY) announces that its SuperVision and Surround ADAS hands-free, eyes-on advanced driving assistance systems have been selected by Mahindra & Mahindra Ltd. for at least six upcoming models, with production expected to begin in 2027.\n• Credo Technology Group Holding Ltd (CRDO) announces that its PCIe 6.0 technology-capable Toucan PCIe retimer has earned PCI-SIG compliance at 32.0 GT/s."},{"time":"09:12","ticker":"TT","headline":"Trane to acquire LiquidStack to accelerate endtoend data center thermal management solutions, expected to close in early 2026","body":"• Strengthens Trane Technologies' position as a full-service partner for data center cooling.\n• Scales LiquidStack's advanced liquid cooling technology, to meet next-generation high-density AI-scale workloads."},{"time":"09:10","ticker":"WRAPX","headline":"S&amp;P futures vs fair value: +3.00. Nasdaq futures vs fair value: +29.00.","body":"The stock market is on track for a flattish opening after a sizable batch of economic data this morning. Total retail sales were unchanged month-over-month in December (Briefing.com consensus: 0.4%) following a 0.6% increase in November. Excluding autos, retail sales were also unchanged month-over-month (Briefing.com consensus: 0.4%) following a downwardly revised 0.4% increase (from 0.5%) in November.The key takeaway from the report is that spending on goods was down across most discretionary categories following some decent-sized gains in November. That will foment some concern about consumer spending fatigue at the end of last year, which of course included the holiday shopping period.Separately, the Q4 Employment Cost Index increased 0.7% (Briefing.com consensus: 0.8%), seasonally adjusted, for the three-month period ending in December 2025, following a 0.8% increase for the three-month period ending in September 2025.The key takeaway from the report is that there was some moderation in employment costs on a year-over-year basis that will help temper inflation worries."},{"time":"09:09","ticker":"CCCX","headline":"Churchill Capital Corp X merger partner Infleqtion and NASA to fly the world's first quantum gravity sensor to space","body":"Infleqtion announced its role as a collaborator on NASA's Quantum Gravity Gradiometer Pathfinder (QGGPf) mission. Led by NASA's Jet Propulsion Laboratory (JPL), the mission will fly the first quantum sensor capable of measuring the Earth's gravitational field and its gradients; signals that are used today to monitor mass dynamics on the planet's surface. The quantum instrument will be aboard a dedicated satellite in low Earth orbit (LEO)."},{"time":"09:08","ticker":"WIRES","headline":"On The Wires","body":"• American Express (AXP) and the National Basketball Association announced a multiyear renewal of their longstanding partnership, which also spans the Women's National Basketball Association (WNBA), NBA G League, USA Basketball and NBA Take-Two Media. American Express, the leagues' Official Payment Partner, also maintains team partnerships with the Brooklyn Nets, Chicago Bulls, Los Angeles Lakers, Utah Jazz, and New York Liberty.\n• Codexis (CDXS) announced that it has earned its ISO 9001:2015 certification. The official certification reflects Codexis's dedication to delivering manufacturing excellence by applying a high standard of quality assurance throughout all of its processes, including research and development, product manufacturing and testing, delivery, support, and customer service.\n• Carlsmed (CARL) announced the successful completion of the first posterior lumbar spine surgery using the Company's aprevo Lumbar Bi-lateral Posterior System. The procedure was performed by Orthopedic Spine Surgeon CJ Kleck, M.D. at the University of Colorado Hospital in Denver, Colorado.\n• Churchill Downs (CHDN) announced exciting changes to 152nd Spring Meet and Derby Week racing. The 152nd Spring Meet at the historic Churchill Downs Racetrack will span nine weeks from April 25 to June 28, 2026, and feature 44 racing days. Derby Week will run from April 25 to May 2, 2026."},{"time":"09:08","ticker":"TEX","headline":"Terex completes sale of Midwest Automotive Designs to Alliance RV","body":"Midwest operated within the Recreational Vehicles segment of REV Group. Terex recently completed its merger with REV Group."},{"time":"09:07","ticker":"MKSI","headline":"MKS Inc. increases quarterly dividend by 14% to $0.25/share","body":""},{"time":"09:07","ticker":"VELO","headline":"Velo3D qualified as first additive manufacturing vendor for U.S. Army ground vehicles","body":"• Co announces it has been selected as the first qualified additive manufacturing (AM) vendor to support the U.S. Army's Ground Vehicle Systems Center's (GVSC) campaign of accelerating qualified AM solutions throughout the Defense Industrial Base.\n• Under the company's previously announced Cooperative Research & Development Agreement (CRADA) with the U.S. Army DEVCOM GVSC, Velo3D is partnering with GVSC to rapidly develop and validate additively manufactured complex parts and assemblies, addressing critical supply chain challenges affecting ground combat vehicles and other military systems."},{"time":"09:07","ticker":"GPRO","headline":"GoPro and Freeride World Tour partner to deliver new YouTube (GOOG / GOOGL) series","body":""},{"time":"09:06","ticker":"SJM","headline":"J.M. Smucker announces senior leadership updates effective February 9; expects to maintain its fiscal 2026 full-year outlook","body":"• Tucker Marshall, who has served as Chief Financial Officer, has been promoted to the new role of Chief Financial Officer | Executive Vice President, Frozen Handheld and Spreads and Sweet Baked Snacks. In addition to financial reporting, internal audit, tax and treasury, financial planning and analysis, investor relations, and corporate development, Marshall's oversight has expanded to include the strategic leadership of the U.S. Retail Frozen Handheld and Spreads, Sweet Baked Snacks, and International businesses, which will be led by their respective general managers. Marshall now also oversees the Company's sales function.\n• In addition, the Company has made the decision to eliminate its Chief Operating Officer role, and John Brase has transitioned from the Company. Mark Smucker has re-assumed the President title serving as Chief Executive Officer, President and Chair of the Board.\n• Rob Ferguson, who has served as Senior Vice President and General Manager, Coffee and Procurement, has been promoted to the new role of Chief Product Supply Officer | Executive Vice President, Coffee, Pet, and Away from Home. Jill Penrose, who has served as Chief People and Company Services Officer, has been promoted to the expanded role of Chief People and Administrative Officer | Chief of Staff. Penrose now manages corporate strategy and chief of staff responsibilities in addition to her continued oversight of communications, public relations, government and industry relations, human resources, community relations, and philanthropy.\n• The Company expects to maintain its fiscal 2026 full-year outlook, which is based on non-GAAP financial measures, as communicated in its most recent quarterly earnings announcement on November 25, 2025, and it will provide an update following completion of its quarter-end financial close and forecast activities on its third quarter earnings call on February 26, 2026.\n• Prior guidance included: FY26 (Apr), sees EPS of $8.75-$9.25, excluding non-recurring items, vs. $8.99 FactSet Consensus; sees FY26 (Apr) revs of $9.03-$9.12 bln vs. $9.06 bln FactSet Consensus."},{"time":"09:05","ticker":"RTX","headline":"RTX's BBN Technologies has been awarded a contract by the Department of War, in partnership with the National Spectrum Consortium, to support its Advanced Spectrum Coexistence Demonstration program","body":"• Team to build prototype that protects defense radars when the 3.1 to 3.45 GHz band is opened for commercial use.\n• This initiative addresses concerns about maintaining the operational readiness of critical national security radars when they share the same radio frequencies with commercial 5G networks."},{"time":"09:05","ticker":"CDNS","headline":"Cadence Design announces the launch of the ChipStack AI Super Agent","body":"• Co announces a transformative step forward in redefining how semiconductors are designed with the launch of the ChipStack AI Super Agent-an agentic AI solution for front-end silicon design and verification. The Cadence ChipStack AI Super Agent is the world's first agentic workflow for automating chip design and verification. It provides up to 10X productivity improvements for coding designs and testbenches, creating test plans, orchestrating regression testing, debugging and automatically fixing issues.\n• The newly launched ChipStack AI Super Agent exemplifies Cadence's approach to Intelligent System Design, where AI orchestration, principled simulation and accelerated computing work seamlessly together to deliver transformative solutions for semiconductor and system innovation.\n• This agentic AI solution orchestrates multiple virtual engineers, all using Cadence's foundational EDA tools. The technology integrates agentic AI with proven Cadence optimization AI and AI assistant solutions, which have been used in over 1,000 tapeouts to date, including the Verisium Verification Platform and Cadence Cerebrus Intelligent Chip Explorer, as well as Cadence's JedAI data and AI platform."},{"time":"09:04","ticker":"WW","headline":"WW announces a strategic partnership with PVOLVE, the clinically validated workout method, designed to support longevity through strength, mobility, and stability training","body":"The new partnership combines Weight Watchers' scientifically-backed medical and behavioral expertise with PVOLVE's clinically-studied method to support members at every age and stage of life."},{"time":"09:04","ticker":"BLLN","headline":"BillionToOne expands Northstar platform with launch of two new add-on liquid biopsy applications for Northstar Select","body":"• Co announces the launch of Northstar PGx and Northstar Select CH. Northstar PGx and Northstar CH are add-on applications for Northstar Select, the most sensitive therapy selection liquid biopsy for advanced solid tumors, as demonstrated in a head-to-head clinical study, proven to uncover 50%+ more clinically actionable alterations.\n• The launch expands the Northstar platform beyond genomic profiling to address chemotherapy safety and clonal hematapoeisis-two critical decision points in selecting the right therapy for patients."},{"time":"09:03","ticker":"SNY","headline":"Sanofi completes acquisition of Dynavax (DVAX)","body":"• The acquisition includes Dynavax's adult hepatitis B vaccine HEPLISAV-B, which is currently marketed in the US and is differentiated by its two-dose regimen over one month. It also includes Dynavax's shingles vaccine candidate (Z-1018), which is currently in phase 1/2 studies, and additional vaccine pipeline projects."},{"time":"09:02","ticker":"CXDO","headline":"Crexendo launches Crexendo Marketplace, a centralized environment designed to help service providers more easily expand, package, and monetize solutions across the Crexendo ecosystem","body":"The Marketplace is expected to increase partner activation rates, expand average revenue per licensee, and enhance monetization across Crexendo's growing base of NetSapiens licensees and service provider partners."},{"time":"09:01","ticker":"WRAPX","headline":"S&amp;P futures vs fair value: +1.00. Nasdaq futures vs fair value: +22.00.","body":"• In economic data:Japan's M2 Money Stock 1.6% yr/yr (expected 1.7%; prior 1.7%); Machine Tool Orders 25.3% yr/yr (prior 10.9%)Australia's February Westpac Consumer Sentiment 90.5 (prior 92.9); January NAB Confidence 3 (prior 2)\n• Japan's M2 Money Stock 1.6% yr/yr (expected 1.7%; prior 1.7%); Machine Tool Orders 25.3% yr/yr (prior 10.9%)\n• Australia's February Westpac Consumer Sentiment 90.5 (prior 92.9); January NAB Confidence 3 (prior 2)\n• Japan's Nikkei: +2.2%\n• Hong Kong's Hang Seng: +0.6%\n• China's Shanghai Composite: +0.1%\n• India's Sensex: +0.3%\n• South Korea's Kospi: +0.1%\n• Australia's All Ordinaries: +0.1%\n• In economic data:UK's January Retail Sales Monitor 2.3% yr/yr (expected 1.3%; prior 1.0%)France's Q4 Unemployment Rate 7.9% (expected 7.8%; prior 7.7%)\n• UK's January Retail Sales Monitor 2.3% yr/yr (expected 1.3%; prior 1.0%)\n• France's Q4 Unemployment Rate 7.9% (expected 7.8%; prior 7.7%)\n• STOXX Europe 600: flat\n• Germany's DAX: flat\n• U.K.'s FTSE 100: -0.5%\n• France's CAC 40: +0.1%\n• Italy's FTSE MIB: +0.2%\n• Spain's IBEX 35: +0.3%"},{"time":"09:01","ticker":"WBD","headline":"Warner Bros. Discovery: Paramount (PSKY) announced it has amended its $30/share, all-cash tender offer to acquire WBD with enhancements that surpass the standard needed for the WBD Board to engage on Paramount's superior proposal","body":"• Paramount's enhanced offer provides definitively superior value and certainty, as reflected in the following added provisions and distinguishing elements:Ticking fee: To underscore confidence in the speed and certainty of its regulatory pathway, Paramount is adding an incremental cash consideration to WBD shareholders of $0.25 per share -- equivalent to approximately $650 million cash value each quarter -- for every quarter the transaction is not closed beyond December 31, 2026.Termination fee: Paramount will fund the payment of the $2.8 billion termination fee due to Netflix concurrent with the termination of the Netflix agreement as set forth in the revised proposed merger agreement filed with the amended tender offer.Debt financing cost: Paramount will eliminate WBD's potential $1.5 billion financing cost associated with its debt exchange offer by fully backstopping an exchange offer that relieves WBD of its contractual bondholder obligations. Paramount will fully reimburse WBD's shareholders for the $1.5 billion fee, without reduction to the separate $5.8 billion reverse termination fee, in the unlikely event that (i) the exchange is not successful, and (ii) the Paramount transaction does not close.Bridge loan refinancing: If WBD's financing sources will not extend the maturity of WBD's existing $15 billion bridge loan, Paramount's debt financing sources are fully prepared to do so (with any incremental costs covered by Paramount). Alternatively, Paramount will permit WBD to structure permanent financing in any way it chooses so long as the debt is redeemable at a commercially reasonable cost.Interim operating covenants: Paramount will provide WBD flexibility between signing and closing, including by matching any comparable Netflix interim operating covenants.Discovery Global Business Protections: To provide WBD shareholders further certainty of closing, Paramount is open to discussing with the WBD Board of Directors contractual solutions to account for the possibility of continuing deteriorating financial performance beyond what WBD is currently projecting for its linear network business.Fully Financed Offer with No Financing Condition: Paramount's amended offer is fully financed by an increased $43.6 billion of equity commitments from the Ellison Family and RedBird Capital Partners and $54.0 billion of debt commitments from Bank of America, Citigroup and Apollo.Personal Guarantee from Larry Ellison: As with Paramount's December 22 offer, Paramount's financing includes an irrevocable personal guarantee from Larry Ellison of $43.3 billion, covering the equity financing for Paramount's amended offer as well any damages claims against Paramount.Netflix's (NFLX) Uncertain Range of Cash Plus Equity in the Declining Discovery Global: In sharp contrast to the value and regulatory certainty provided by Paramount's offer, the Netflix deal asks WBD shareholders to approve a transaction where they do not have any idea how much actual cash consideration they will receive, since it is predicated upon the financial condition of Discovery Global at the time of separation and its resulting debt capacity.\n• Ticking fee: To underscore confidence in the speed and certainty of its regulatory pathway, Paramount is adding an incremental cash consideration to WBD shareholders of $0.25 per share -- equivalent to approximately $650 million cash value each quarter -- for every quarter the transaction is not closed beyond December 31, 2026.\n• Termination fee: Paramount will fund the payment of the $2.8 billion termination fee due to Netflix concurrent with the termination of the Netflix agreement as set forth in the revised proposed merger agreement filed with the amended tender offer.\n• Debt financing cost: Paramount will eliminate WBD's potential $1.5 billion financing cost associated with its debt exchange offer by fully backstopping an exchange offer that relieves WBD of its contractual bondholder obligations. Paramount will fully reimburse WBD's shareholders for the $1.5 billion fee, without reduction to the separate $5.8 billion reverse termination fee, in the unlikely event that (i) the exchange is not successful, and (ii) the Paramount transaction does not close.\n• Bridge loan refinancing: If WBD's financing sources will not extend the maturity of WBD's existing $15 billion bridge loan, Paramount's debt financing sources are fully prepared to do so (with any incremental costs covered by Paramount). Alternatively, Paramount will permit WBD to structure permanent financing in any way it chooses so long as the debt is redeemable at a commercially reasonable cost.\n• Interim operating covenants: Paramount will provide WBD flexibility between signing and closing, including by matching any comparable Netflix interim operating covenants.\n• Discovery Global Business Protections: To provide WBD shareholders further certainty of closing, Paramount is open to discussing with the WBD Board of Directors contractual solutions to account for the possibility of continuing deteriorating financial performance beyond what WBD is currently projecting for its linear network business.\n• Fully Financed Offer with No Financing Condition: Paramount's amended offer is fully financed by an increased $43.6 billion of equity commitments from the Ellison Family and RedBird Capital Partners and $54.0 billion of debt commitments from Bank of America, Citigroup and Apollo.\n• Personal Guarantee from Larry Ellison: As with Paramount's December 22 offer, Paramount's financing includes an irrevocable personal guarantee from Larry Ellison of $43.3 billion, covering the equity financing for Paramount's amended offer as well any damages claims against Paramount.\n• Netflix's (NFLX) Uncertain Range of Cash Plus Equity in the Declining Discovery Global: In sharp contrast to the value and regulatory certainty provided by Paramount's offer, the Netflix deal asks WBD shareholders to approve a transaction where they do not have any idea how much actual cash consideration they will receive, since it is predicated upon the financial condition of Discovery Global at the time of separation and its resulting debt capacity.\n• Letter to the WBD Board of Directors details Paramount's amended offer and urges the Board to exercise its contractual right to negotiate with Paramount by declaring that the amended offer could reasonably be expected to result in a superior proposal\n• Paramount reiterates intention to solicit proxies against approval of Netflix transaction at WBD special shareholder meeting."},{"time":"08:41","ticker":"ZENA","headline":"ZenaTech announces its integration of drone-based workflows into land surveying services for homebuilders","body":"• Co announces its integration of drone-based workflows into land surveying services for national homebuilders, providing improved speed, precision and reliability to facilitate permits.\n• The company plans to expand its builder services through DaaS operations enablement via the specialized skills of one of its recently acquired land surveying firms, Cardinal Civil Resources, which offers a strong history of serving major U.S. homebuilders to expand the company's access into the homebuilding sector.\n• Drone as a Service's builder service offerings include critical surveying tasks such as topography, plot plans, boundary validation, zoning compliance, and jurisdiction-specific formatting."},{"time":"08:40","ticker":"HI","headline":"Hillenbrand: Lone Star completes acquisition of Hillenbrand; Hillenbrand's common stock has ceased trading and will be delisted from the New York Stock Exchange (halted)","body":"The Company will continue to operate under the Hillenbrand name."},{"time":"08:40","ticker":"IDCC","headline":"InterDigital has initiated litigation against Hisense and TCL over the ongoing infringement of InterDigital's intellectual property, primarily related to InterDigital's joint TV licensing program with Sony","body":"• The patents-in-suit relate to HEVC, VP9 and AV1 video compression, and high dynamic range technologies.\n• Cases have been initiated against the companies at the Munich Local Division of the Unified Patent Court, in the Munich Regional Court in Germany, in Rio de Janeiro State Court in Brazil, and in the Delhi High Court in India."},{"time":"08:39","ticker":"PLYX","headline":"Polaryx announces pre-clinical data related to SOTERIA at the 22nd Annual WORLDSymposium","body":"PARAMUS, NJ, Feb. 10, 2026 (GLOBE NEWSWIRE) -- Polaryx Therapeutics (Nasdaq: PLYX), a clinical-stage biotechnology company developing novel, disease-modifying therapies for rare, pediatric lysosomal storage disorders (\"LSDs\"), announced that the late-breaking presentation of new data for PLX-200, an investigational therapy for the treatment of Krabbe disease (globoid cell leukodystrophy) at the 22nd Annual WORLDSymposium, was given on February 6, 2026 in San Diego, Calif.Click here for full release."},{"time":"08:39","ticker":"FTHM","headline":"Fathom Holdings announces the appointment of Lori Muller as President of Fathom Realty, effective February 9, 2026","body":"• Muller succeeds Samantha Giuggio, who will be stepping down from her roles as President of Fathom Realty and Chief Operating Officer of Fathom Holdings.\n• Muller brings more than two decades of leadership experience in residential real estate, most recently serving as President of the U.S. Organization at EXIT Realty Corp. International, where she oversaw brokerage operations, agent growth, and strategic initiatives nationwide with over 25,000 agents. Throughout her career, she has been recognized for driving agent success, fostering strong company culture, and leading large-scale operational growth."},{"time":"08:38","ticker":"WAVE","headline":"Eco Wave Power Global AB signed a Letter of Intent with Wavefront Asset Management Limited","body":"Under the LOI, Wavefront is expected to provide structured equipment financing and leasing solutions to support the deployment of Eco Wave Power's proprietary wave energy generation equipment across its global project portfolio. The arrangement is intended to facilitate customer access to flexible financing solutions for wave energy installations, supporting Eco Wave Power's transition from pilot and demonstration projects to commercial-scale deployments."},{"time":"08:38","ticker":"LULU","headline":"lululemon athletica introduces Unrestricted Power, a new sensation for strength training","body":"• Co unveils Unrestricted Power, a new innovation platform engineered for heavy lifts and demanding gym sessions. The assortment, which launches this morning in North America, is backed by thousands of hours of research and development, providing secure support without compromising comfort and mobility, enabling a distraction-free fit built to match every move.\n• The product features a new lululemon proprietary performance fabric called PowerLu, which is crafted with the brand's highest filament-count yarn to provide the ideal balance of engineered stretch, unrestricted motion, and stability."},{"time":"08:37","ticker":"RXO","headline":"RXO, Inc. to issue $400 mln aggregate principal amount of senior notes due 2031","body":"Additionally, the Company today issued a notice of conditional full redemption for all of the Company's outstanding 2027 Notes on February 20, 2026 (the \"Redemption Date\"), at a redemption price of 101.875% of the principal amount thereof, plus accrued and unpaid interest."},{"time":"08:37","ticker":"JYD","headline":"Jayud Global Logistics has signed a three-year cooperation agreement with Guanghong Electronics, a wholly-owned subsidiary of DBG Technology Co., Ltd.","body":"• The Agreement focuses on providing comprehensive logistics and transportation services, including land and air freight from China to Hong Kong, as well as customs-related processes.\n• This collaboration leverages Jayud's extensive logistics network and expertise in cross-border trade to support DBG Technology's expanding global operations. DBG, a prominent Electronic Manufacturing Services (EMS) provider with 2024 revenue of 6.88 billion RMB (approximately US$982 million), serves top-tier brands such as Huawei, Xiaomi, and Honor, as well as major automotive leaders like BMW and Volkswagen through Tier-1 suppliers. The Agreement is expected to enhance the efficiency and reliability of Guanghong Electronics' supply chainas it expands its footprint in Hong Kong, India, and Vietnam, where Jayud provides significant logistics support. Transportation plans from China to Hong Kong by land and air, as well as full customs processes, will be part of the services offered which, in turn, is expected to enable a smoother and quicker movement of goods."},{"time":"08:36","ticker":"NDAQ","headline":"NASDAQ launches new private capital indexes, expanding its private capital solutions platform","body":"• Co announces the launch of the Nasdaq Private Capital Indexes, a new suite of benchmarks designed to deliver transparency, representativeness, and robustness to private markets. Built to help institutional investors and consultants benchmark performance, analyze exposures, and navigate private capital markets with precision, the indexes introduce rules-based rigor and consistent measurement to segments that have historically lacked reliable, objective standards.\n• Constructed from more than 14,000 institutional private market funds that represent over $11.4 trillion in global AUM sourced from Nasdaq eVestment's LP reported dataset, the Nasdaq Private Capital Indexes are designed to deliver robust and transparent coverage. The indexes employ a documented, rules-based methodology featuring Modified Dietz quarterly performance measurement, NAV-weighted aggregation, and a standardized two-quarter restatement process designed to align with institutional governance expectations."},{"time":"08:36","ticker":"WRAPX","headline":"S&amp;P futures vs fair value: -3.00. Nasdaq futures vs fair value: -12.00.","body":"The S&P 500 futures currently trade three points below fair value. Just released, total retail sales were flat month-over-month in December (Briefing.com consensus: 0.4%) following a 0.6% increase in November. Excluding autos, retail sales were also flat (Briefing.com consensus: 0.4%) following a downwardly revised 0.4% increase (from 0.5%) in November. Compensation costs for civilian workers increased 0.7% (Briefing.com consensus: 0.8%), seasonally adjusted, for the 3-month period ending in December 2025, from a 0.8% increase in the third quarter. Import prices increased 0.1% in December. Excluding oil, import prices increased 0.3%. Export prices increased 0.3% in December. Excluding agriculture, export prices increased 0.3%."},{"time":"08:35","ticker":"ONB","headline":"Old National Bancorp and Axletree Solutions announce the completion of a partnership to, through the implementation of Symmetree by Axletree, host Old National's updated SWIFT (Society for Worldwide Interbank Financial Telecommunication) architecturethe completion of a partnership to, through the implementation of Symmetree by Axletree, host Old National's updated SWIFT architecture","body":""},{"time":"08:35","ticker":"VWAV","headline":"VisionWave Holdings' wholly owned subsidiary, Solar Drone, is continuing business development discussions regarding possible opportunities in Middle Eastern markets, including Egypt and the United Arab Emirates, following a series of executive meetings held last week in Naples, Italy","body":"• The meetings were led by Solar Drone's CEO, CTO, and COO, who met with leading prospective customers and partners from Egypt and the Emirates. These discussions followed successful live demonstrations in Italy, where Solar Drone's drone-based cleaning operations are already deployed in active commercial environments.\n• During the demonstrations, the company showcased its patented high-pressure drone payload system, which enables fast, safe, and water-efficient cleaning of solar panels and electrical insulators without ground access, line shutdowns, or hazardous manual labor. Solar Drone's technology is currently operating across multiple sites in Italy and continues to expand as demand grows."},{"time":"08:34","ticker":"INTU","headline":"Intuit announces a set of Mailchimp product innovations","body":"• Co announces a set of Mailchimp product innovations that unlock profitable growth for ecommerce businesses. Powered by the Intuit platform, the enhancements include more ways for merchants to connect their data and activate omnichannel campaigns without the added price or complexity.\n• The newly-introduced capabilities directly address the core problems ecommerce businesses report today: limited time, lack of marketing expertise, uncertainty about ROI, and fragmented data across multiple platforms."},{"time":"08:31","ticker":"ALGM","headline":"Allegro Microsystems introduces the ACS37017, a new Hall-effect current sensor that sets the industry benchmark for accuracy","body":"With the launch of the ACS37017, Allegro completes a strategic expansion of its high-performance portfolio that now includes definitive, market-leading solutions for the three critical challenges in modern power electronics: Speed (ACS37100), Power Density (ACS37200), and Accuracy (ACS37017)."},{"time":"08:31","ticker":"ECONX","headline":"December Import/Export prices","body":"• December Import Prices 0.1%\n• Decemner Import Prices Ex-Oil 0.4%\n• December Export Prices 0.3%\n• December Export Prices Ex-Ag +0.3%"},{"time":"08:30","ticker":"ECONX","headline":"Q4 Employment Cost Index 0.7% vs. 0.8% Briefing.com consensus; prior 0.8%","body":""},{"time":"08:30","ticker":"ECONX","headline":"December Retail Sales Ex-Auto 0.0% vs. 0.4% Briefing.com consensus; prior revised to 0.4% from 0.5%","body":""},{"time":"08:30","ticker":"ECONX","headline":"December Retail Sales 0.0% vs. 0.4% Briefing.com consensus; prior 0.6%","body":""},{"time":"08:21","ticker":"ECONX","headline":"ADP says For the four weeks ending January 24, 2026, U.S. private employers added an average of 6,500 jobs per week, according to the NER Pulse","body":""},{"time":"08:20","ticker":"WIRES","headline":"On The Wires","body":"• Septerna (SEPN) announced that the company will present data from its Phase 1 clinical trial of SEP-631 at the 2026 American Academy of Allergy Asthma & Immunology Annual Meeting, taking place February 27-March 2, 2026, in Philadelphia. SEP-631 is a selective oral small molecule Mas-related G protein-coupled receptor X2 negative allosteric modulator being developed for the treatment of chronic spontaneous urticaria and other mast cell-driven diseases.\n• Bell Canada (BCE) and SAP Canada (SAP) announced a Memorandum of Understanding to jointly deliver a comprehensive Canadian-operated cloud solution designed to meet high standards of data protection and strengthen Canada's digital sovereignty."},{"time":"08:20","ticker":"CHT","headline":"Chunghwa Telecom reported Jan revenue was approximately NT$20.41 bln, income from operation was approximately NT$4.41 bln, net income attributable to stockholders of the parent was approximately NT$3.37 bln, EBITDA was approximately NT$7.80 bln and EPS NT$0.43","body":""},{"time":"08:18","ticker":"HII","headline":"Huntington Ingalls and The Australian Maritime College announce a major reliability milestone for AMC's Legacy REMUS 100 autonomous underwater vehicle","body":"• Over seven years, the AMC REMUS 100 completed 935 operational deployments with only two days of downtime caused by material issues. During this period the AUV supported the training of more than 400 Royal Australian Navy AUV operators.\n• Despite frequent use in challenging environments, the system maintained operational availability above 99.9%, which is a standout result for autonomous maritime technology.\n• This performance record reinforces the REMUS 100's reputation as one of the most dependable autonomous underwater systems operating today. In 2026, HII REMUS will celebrate 25 years of reliable, innovative service to customers worldwide. To date, more than 750 REMUS AUVs have been delivered to customers in over 30 countries, with more than 90% still in active service."},{"time":"08:18","ticker":"FTW","headline":"EQV Ventures Acquisition Corp. and Presidio announced that Presidio has mandated an affiliate of Goldman (GS) to arrange up to $1.0 bln in potential acquisition financing","body":"• Goldman Sachs Bank USA with one or more of its affiliates is expected to serve as sole lead arranger, structuring agent and syndication agent in up to $1.0 billion of potential acquisition financing (the \"Facility\"). The parties have reached commercial agreement on certain high-level terms for the Facility. The closing of the Facility remains subject to the negotiation and execution of terms and definitive transaction agreements, future acquisitions of producing properties, and is subject to acquisition diligence and funding and other relevant approvals, and customary closing conditions. The Facility is expected to provide Presidio with significant capital flexibility to pursue acquisitions of producing oil and gas assets.\n• The Facility is designed to support the aggregation of assets prior to issuing long-term investment grade asset-backed securities, which may be used to repay such Facility. Presidio intends to deploy the Facility to drive dividend growth and long-term shareholder returns by acquiring producing, cash-flowing assets and harvesting meaningful upside through Presidio's strategy of operational optimization. Presidio's business model drives value through the application of modern oilfield practices, proprietary technology including machine learning and AI, and strategic consolidation."},{"time":"08:17","ticker":"BTDR","headline":"Bitdeer announces January 2026 production and operations update","body":"SINGAPORE, Feb. 10, 2026 (GLOBE NEWSWIRE) -- Bitdeer Technologies Group (NASDAQ: BTDR) (\"Bitdeer\" or the \"Company\"), a world-leading technology company for Bitcoin mining and AI infrastructure, today announced its unaudited mining and operations updates for January 2026.Click here for full release."},{"time":"08:16","ticker":"DDL","headline":"Dingdong Ltd announces intention to utilize substantial majority of proceeds from sale of China operations for share repurchase plans and/or dividends upon closing of transaction","body":"• Pursuant to the terms of the Share Purchase Agreement, Buyer will pay cash consideration of $717 million in the Transaction. In addition, Dingdong Cayman will have the right to receive prior to August 31, 2026 total cash not exceeding $280 million from Dingdong BVI and its subsidiaries (provided that the total net cash of Dingdong BVI and its subsidiaries on a consolidated basis as of December 31, 2025 minus such amounts received by Dingdong Cayman shall not be less than $150 million). As such, Dingdong Cayman expects that it will receive up to $997 million in cash proceeds from the Transaction.\n• This amount is subject to certain adjustments, including those based on certain net cash, net working capital and other financial line item thresholds of Dingdong BVI and its subsidiaries as of certain agreed upon dates.\n• In the event that the net cash of Dingdong BVI and its subsidiaries on a consolidated basis as of December 31, 2025 minus the amounts received by Dingdong Cayman as described above is less than $150 million, the Buyer has the right to adjust the purchase price cash consideration at closing for any such shortfalls."},{"time":"08:16","ticker":"IVZ","headline":"Invesco announces preliminary month-end assets under management of $2,231.7 bln, an increase of 2.8% versus previous month-end","body":"The firm delivered net long-term inflows of $16.9 bln in the month. Non-management fee earning net inflows were $0.3 bln and money market net outflows were $0.2 bln. AUM was positively impacted by favorable market returns which increased AUM by $39 bln. FX increased AUM by $6.0 bln. Preliminary average total AUM for the quarter through January 31 was $2,209.8 bln, and preliminary average active AUM for the quarter through January 31 was $1,127.4 bln."},{"time":"08:15","ticker":"WIRES","headline":"On The Wires","body":"• FactSet (FDS) announced a partnership with Kepler Cheuvreux to integrate Kepler Cheuvreux's Aftermarket Research into the FactSet platform. Enhanced by FactSet's proprietary AI capabilities, Kepler Cheuvreux's premium sell-side research advances FactSet's commitment to delivering best-in-class AMR content across EMEA.\n• Dayforce (DAY) announced it has achieved ISO 42001 certification and attained NIST AI RMF attestation. Together, these independent validations underscore Dayforce's disciplined enterprise-wide approach to developing, deploying, and managing AI systems in ways that promote fairness, security, and trust."},{"time":"08:15","ticker":"EVGN","headline":"Evogene announces an expanded phase of its collaboration with Google Cloud","body":"• Under this new phase, the collaboration will focus on developing and integrating advanced AI Agents into Evogene's ChemPass AI platform, its proprietary engine for small-molecule discovery and optimization, using Google Cloud's Vertex AI platform. The goal is to increase the speed, precision, and efficiency of identifying and optimizing small molecules for drug and ag-chemical development.\n• This announcement marks the second major milestone in the partnership between Evogene and Google Cloud, following the successful collaboration announced in October 2024. The initial phase focused on building a generative AI foundation model that now serves as a core component of ChemPass AI. This powerful capability drove Evogene's recent collaborations, and the addition of our new agent technology positions the company to broaden its offering and accelerate future partnerships."},{"time":"08:14","ticker":"OSUR","headline":"OraSure announces its OraQuick HIV Self-Test has received a license from Health Canada for use in Canada","body":"• The OraQuick HIV Self-Test is a point-of-care rapid antibody test. It is Canada's first oral HIV self-test and detects antibodies for both HIV-1 and HIV-2, enabling individuals to find out their HIV status with a simple oral swab in as little as 20 minutes.\n• The simplicity of the product makes it ideal for testing in a range of locations, including in the privacy of one's home, at the pharmacy, or at community-based testing events."},{"time":"08:14","ticker":"WIRES","headline":"On The Wires","body":"• CMB.TECH NV (CMBT) has sold two vessels, generating a capital gain of approximately 98.2 million USD in total. Euronav CMB.TECH has sold two VLCCs: Ingrid (2012, 314,000 dwt) and Ilma (2012, 314,000 dwt). The sale will generate a capital gain of approximately 98.2 million USD in Q2 2026, based on the net sales price and book values. The vessels will be delivered to their new owner in Q2 2026.\n• Coya Therapeutics (COYA) will host a live webinar on February 17, 2026 at 3:00 p.m. ET/ 12:00 p.m. PT exploring the evolving ALS treatment landscape.\n• Main Street Capital Corporation (MAIN) announces the expansion in total commitments under its multi-year revolving credit facility (the \"Corporate Facility\") from $1.145 billion to $1.175 billion, with the $30.0 million increase in total commitments resulting from the addition of a new lender relationship."},{"time":"08:13","ticker":"HZO","headline":"MarineMax responds to The Donerail Group's public letter to shareholders","body":"MarineMax, Inc. (NYSE: HZO) (\"MarineMax\" or the \"Company\"), the world's largest recreational boat and yacht retailer, marina operator and superyacht services company, today issued the following statement in response to the recent public letter to shareholders from The Donerail Group, Inc. (together with its affiliates, \"Donerail\"):Click here for full release."},{"time":"08:12","ticker":"YEXT","headline":"Yext launches $180 mln modified Dutch auction tender offer","body":"• Yext, Inc. commenced a modified Dutch auction tender offer to repurchase up to $180 mln of its common stock.\n• Co intends to purchase shares at prices ranging from $5.75 to $6.50 per share, subject to the number of shares tendered and not withdrawn."},{"time":"08:12","ticker":"GENI","headline":"Genius Sports announces a partnership with WPP Media (WPP) to help brands invest in sports with greater precision, leveraging Genius Sports' Fan Graph and FANHub to deliver end-to-end intelligence across media planning, activation, and measurement","body":"The partnership results in the creation of the WPP Brand Sports Momentum Score, a new intelligence tool that identifies the right sports, audiences, and moments to invest in to drive year-round engagement and ROI."},{"time":"08:11","ticker":"SPRY","headline":"ARS Pharmaceuticals announces that five poster presentations, one healthcare professional case report, plus two late breakers from partners at ALK-Abell A/S centered on neffy, will be featured at the 2026 American Academy of Allergy, Asthma and Immunology Annual Scientific Meeting","body":"• Five poster presentations highlight clinical advancement of neffy, real-world usability and advantages of needle-free epinephrine delivery.\n• Longer shelf life of nasal epinephrine compared with epinephrine auto-injectors translates into a more affordable, value-based price.\n• When factoring in patients' dislike of needle-based administration, the value of a nasal option increased by more than 25%."},{"time":"08:10","ticker":"WIRES","headline":"On The Wires","body":"• QVIA (IQV) and the Duke Clinical Research Institute are pleased to announce their new collaboration to enhance the conduct of clinical research in obesity and related cardiometabolic trials.\n• Evolv Technologies Holdings (EVLV) announced that its flagship product, Evolv Express, has been deployed at Dean E. Smith Center, Kenan Stadium, and select special events at Carmichael Arena. The historic venues are home to the North Carolina Tar Heels men's basketball, football, and women's basketball teams.\n• BioRestorative Therapies (BRTX) announced completion of patient enrollment in its Phase 2 clinical trial evaluating the safety and efficacy of BRTX-100 for the treatment of chronic lumbar disc disease.\n• YCharts announced the introduction of benchmark data from leading global private markets investment firm Hamilton Lane (HLNE). The addition brings new visibility into private markets, helping financial advisors benchmark private fund performance, evaluate portfolio diversification and explain the role of private markets in client strategies.\n• Toast (TOST) and Instacart (CART) announced a strategic partnership designed to streamline operations for businesses across the United States. The collaboration will enable retailers to easily onboard and sync their brick-and-mortar inventory to the Instacart Marketplace, and will provide restaurants a \"just-in-time\" solution for essential supplies."},{"time":"08:09","ticker":"FOUR","headline":"Shift4 Payments is now a single share class company, removing super-voting stock, and eliminating tax receivable obligations to founder","body":"Shift4 Payments, Inc. (the \"Company\") is pleased to announce the completion of a simplification of its corporate structure (the \"Simplification Transaction\") that the Company previously announced was being negotiated. The Simplification Transaction collapsed the Company's multi-share class structure into a single Class A share class structure and resulted in our Founder and former CEO, Jared Isaacman, simultaneously assigning and waiving his rights under the Tax Receivable Agreement (the \"TRA\") with the Company.Click here for full release."},{"time":"08:09","ticker":"GRO","headline":"Brazil Potash Corp advances Autazes project with federal water rights and financing momentum","body":"• Brazil Potash Corp. received 10-year federal approval from Brazil's National Water and Sanitation Agency to extract surface water from the Rio Madeira for the Autazes potash project.Co said the approval eliminates the need for 16 deep groundwater wells, simplifying project design and reducing construction costs.Co reported WSP Global has begun demographic and needs assessments across 36 Mura Indigenous communities to support development of a Wellbeing Plan tied to licensed construction activities.Co stated it has received third-party BOOT proposals for port, steam plant, and 20 MW construction power infrastructure, potentially lowering upfront capital requirements.Co said discussions with development finance institutions, export credit agencies, and equipment suppliers are progressing as it advances toward full construction financing.\n• Co said the approval eliminates the need for 16 deep groundwater wells, simplifying project design and reducing construction costs.\n• Co reported WSP Global has begun demographic and needs assessments across 36 Mura Indigenous communities to support development of a Wellbeing Plan tied to licensed construction activities.\n• Co stated it has received third-party BOOT proposals for port, steam plant, and 20 MW construction power infrastructure, potentially lowering upfront capital requirements.\n• Co said discussions with development finance institutions, export credit agencies, and equipment suppliers are progressing as it advances toward full construction financing."},{"time":"08:09","ticker":"JACK","headline":"Jack in the Box Inc. reiterates confidence in David Goebel-led Board of Directors in overseeing successful execution of 'JACK on Track' plan","body":"SAN DIEGO--(BUSINESS WIRE)-- Jack in the Box Inc. (\"Jack in the Box\" or the \"Company\") (NASDAQ: JACK), today mailed a letter to shareholders in connection with its upcoming Annual Meeting of Shareholders scheduled to be held on February 27, 2026 (the \"Annual Meeting\"). Shareholders of record as of January 2, 2026, will be entitled to vote at the Annual Meeting. Click here for full release."},{"time":"08:09","ticker":"RZLV","headline":"Rezolve AI Limited expands core AI commerce platform with acquisition of Reward Loyalty UK Limited for $230 mln","body":"• Co announces the acquisition of 100% of Reward Loyalty UK Limited for US$230 million, payable entirely in cash from existing resources, strengthening Rezolve Ai's core AI-commerce platform with profitable, self-financing growth at scale, supported by Reward's live enterprise deployments across banking and retail.\n• The Reward transaction is fully non-dilutive, requires no equity issuance, no seller paper, and no financing and when combined with Rezolve Ai's business, is expected to be EBITDA-accretive, self-financing, and supportive of profitable top-line growth from completion.Approximately $90 million of EBITDA-accretive revenue for fiscal year 2025.\n• Approximately $90 million of EBITDA-accretive revenue for fiscal year 2025.\n• The acquisition of Reward directly strengthens Rezolve Ai's core Brain Commerce platform, embedding AI-driven discovery, engagement, transaction and loyalty into a unified operating model. Reward's customer engagement and commerce media capabilities sit upstream of payment and fulfilment, making the platform a natural extension of Rezolve Ai's agentic commerce architecture rather than an adjacent or standalone business.\n• Reward's senior leadership team is expected to remain in place, ensuring continuity and operational stability. Rezolve Ai plans a phased integration approach focused on preserving Reward's profitability while selectively introducing platform synergies."},{"time":"08:08","ticker":"RZLV","headline":"Rezolve AI Limited expands core AI Commerce platform with acquisition of Reward Loyalty UK Limited for $230 million all-cash","body":"• $230 million all-cash, non-dilutive transaction adds approximately $90 million of EBITDA-accretive revenue, self-financing profitable growth and immediate strategic scale.\n• Expected to further expand RezolvePay and agentic Brain Commerce reach across tens of millions of cardholders, hundreds of global retailers and the world's leading payment networks."},{"time":"08:07","ticker":"KTOS","headline":"Kratos Defense and Security selected to participate in Phase 1 Gauntlet for the Office of the Secretary of War's Drone Dominance Program","body":"This opportunity seeks to identify and evaluate platforms capable of demonstrating multiple one-way attack missions through a live competition."},{"time":"08:06","ticker":"AARD","headline":"Aardvark Therapeutics expands Phase 3 Prader-Willi trial eligibility after FDA submission","body":"• Aardvark Therapeutics announced FDA submission and U.S. IRB approval of an amended protocol for its Phase 3 HERO trial of ARD-101 in Prader-Willi syndrome.Co lowered the minimum eligibility age from 10 to 7 years in the U.S., expanding the addressable pediatric patient population.Co said the amendment is intended to reduce enrollment barriers and better capture ARD-101's impact on early-onset hyperphagia.Co stated enrollment is progressing as planned, with topline Phase 3 data still expected in Q3 2026.\n• Co lowered the minimum eligibility age from 10 to 7 years in the U.S., expanding the addressable pediatric patient population.\n• Co said the amendment is intended to reduce enrollment barriers and better capture ARD-101's impact on early-onset hyperphagia.\n• Co stated enrollment is progressing as planned, with topline Phase 3 data still expected in Q3 2026."},{"time":"08:05","ticker":"ECL","headline":"Ecolab beats by $0.01, reports revs in-line; guides Q1 EPS in-line; guides FY26 EPS in-line, revs above consensus","body":"• Reports Q4 (Dec) earnings of $2.08 per share, excluding non-recurring items, $0.01 better than the FactSet Consensus of $2.07; revenues rose 4.8% year/year to $4.2 bln vs the $4.19 bln FactSet Consensus.\n• Co issues in-line guidance for Q1, sees EPS of $1.67-1.73, excluding non-recurring items, vs. $1.70 FactSet Consensus.\n• Co issues guidance for FY26, sees EPS of $8.43-8.63, excluding non-recurring items, vs. $8.46 FactSet Consensus; sees FY26 revenue growth of +7-9%, which computes as $17.20-17.53 bln vs. $17.17 bln FactSet Consensus.\n• \"We are driving better-than-expected savings from our One Ecolab productivity initiatives and now anticipate annualized savings to increase from $225 million to $325 million by 2027. The recent acquisition of Ovivo Electronics ultrapure water business is off to a great start. Including the acquisition of Ovivo Electronics, we expect reported sales to increase 7% to 9% and organic sales to increase 3% to 4% in 2026, with organic growth accelerating through the year. With this, along with 100 to 150 basis points of operating income margin expansion, we expect to deliver 14% to 16% growth in adjusted operating income.\""},{"time":"08:04","ticker":"WRAPX","headline":"S&amp;P futures vs fair value: -7.00. Nasdaq futures vs fair value: -22.00.","body":"• The Trump administration will exempt Microsoft (MSFT 415.54, +1.83, +0.4%), Apple (AAPL 273.45, -1.17, -0.4%), and Amazon (AMZN 209.85, +1.13, +0.5) from upcoming chip tariffs, according to Financial Times.\n• Taiwan's top trade negotiator said it would be impossible to relocate 40% of the island's semiconductor supply chain to the U.S. before the end of President Trump's second term, according to CNBC.\n• Coca Cola (KO 75.01, -2.96, -3.8%) beat EPS expectations by $0.02 and missed revenue expectations. The company delivered its FY26 outlook, expecting to deliver organic revenue growth of 4-5%.\n• Credo Technology Group (CRDO 140.50, +17.09, +13.9%) guides January Q and April Q revenue well above expectations.\n• Marriott International (MAR 340.01, +8.80, +2.7%) missed EPS estimates by $0.02, reported revenues in-line, guided Q1 EPS above consensus, and guided FY26 EPS in line.\n• Taiwan Semiconductor Manufacturing (TSM 365.26, +9.85, +2.8%) saw January revenues rise 37%, its highest monthly revenues ever, according to CNBC.\n• Other markets registered more modest gains, supported in part by the dollar's weakness.\n• Taiwan's top trade negotiator said it would be impossible to relocate 40% of the island's semiconductor supply chain to the U.S. before the end of President Trump's second term, according to CNBC.\n• President Trump and President Xi are expected to meet in China in early April, but a White House official reportedly said that meeting has not yet been finalized.\n• FTSE Russell is going to be postponing its stock index review for Indonesia that had been scheduled for March 2026 due to the potential for adverse turnover and uncertainty in determining accurate free float percentages of Indonesian securities.\n• Japan's M2 Money Stock 1.6% yr/yr (expected 1.7%; prior 1.7%); Machine Tool Orders 25.3% yr/yr (prior 10.9%)\n• Australia's February Westpac Consumer Sentiment 90.5 (prior 92.9); January NAB Confidence 3 (prior 2)\n• Better-than-expected results from French company Kering put a bid in fellow luxury stocks.\n• ECB member Villeroy will be resigning from his post on June 1, 2026, versus the officially scheduled end date of October 2027.\n• UK Prime Minister Starmer has reportedly garnered support to remain in power, although questions remain surrounding his leadership due to the associated fallout from the Epstein scandal.\n• UK's January Retail Sales Monitor 2.3% yr/yr (expected 1.3%; prior 1.0%)\n• France's Q4 Unemployment Rate 7.9% (expected 7.8%; prior 7.7%)"},{"time":"08:03","ticker":"CTS","headline":"CTS Corp announces fourth quarter results with guidance","body":"LISLE, Ill., Feb. 10, 2026 (GLOBE NEWSWIRE) -- CTS Corporation (NYSE: CTS), a leading global designer and manufacturer of highly engineered solutions that \"Sense, Connect and Move,\" today announced fourth quarter and full year 2025 results. CTS expects full-year 2026 sales to be in the range of $550-$580 million and adjusted diluted EPS to be in the range of $2.30-$2.45.Click here for full release."},{"time":"08:03","ticker":"OTEX","headline":"Open Text increases share repurchase program to $500 million","body":""},{"time":"08:02","ticker":"IRMD","headline":"iRadimed reports record fourth quarter financial results and increases its regular quarterly cash dividend to $0.20 per share from $0.17 per share","body":"ORLANDO, Fla., Feb. 10, 2026 (GLOBE NEWSWIRE) -- IRADIMED CORPORATION (the \"Company\" or \"Iradimed\") (NASDAQ: IRMD) announced today its financial results for the quarter and year ended December 31, 2025. The Company is a leader in developing innovative magnetic resonance imaging (\"MRI\") compatible medical devices and products. The Company is a provider of (i) non-magnetic intravenous (\"IV\") infusion pump systems and (ii) non-magnetic patient vital signs monitoring systems that are each designed for use during MRI procedures.Click here for full release."},{"time":"08:00","ticker":"UBER","headline":"Uber and Baidu (BIDU) in partnership with Dubai's Roads and Transport Authority, announce the next phase of their global partnership, bringing the Apollo Go autonomous ride-hailing service to the Uber platform in Dubai","body":"• Expected to launch in the coming month, the fully autonomous vehicles will be available via the Uber app across select locations within the Jumeirah area, and the deployment will expand based on operational learnings and regulatory approvals across the city.\n• This collaboration also aligns directly with Dubai's ambitious goal of having 25% of all transportation trips be autonomous by 2030."},{"time":"08:00","ticker":"PFE","headline":"Pfizer becomes newest partner added to BaseLaunch's biotech venture incubator","body":"Adding Pfizer as a partner helps BaseLaunch further develop its portfolio companies, which have collectively raised over $1 billion."},{"time":"07:51","ticker":"UAMY","headline":"U.S. Antimony confirms its Chairman/CEO Gary C. Evans, is being featured live this morning on FOX News with Maria Bartiromo at approximately 8:30 a.m. ET","body":""},{"time":"07:49","ticker":"BONDX","headline":"Overnight Treasury Market Summary","body":"• U.S. Treasuries found a bid overnight, comforted by the calming seen in Japan's bond market following the LDP's convincing election victory over the weekend. That comfort has extended to other sovereign bond markets, as lower rates can be seen today around the globe. The U.S. market is waiting on key economic data this morning, namely the January Retail Sales report and Q4 Employment Cost Index at 8:30 a.m. ET, as well as some new supply. Results from the $58 billion 3-yr note auction will be announced at 1:00 p.m. ET.\n• Yield Check: 2-yr: -1 bp to 3.47% 3-yr: -1 bp to 3.54% 5-yr: -2 bps to 3.72% 10-yr: -2 bps to 4.18% 30-yr: -3 bps to 4.82%\n• 2-yr: -1 bp to 3.47%\n• 3-yr: -1 bp to 3.54%\n• 5-yr: -2 bps to 3.72%\n• 10-yr: -2 bps to 4.18%\n• 30-yr: -3 bps to 4.82%\n• News: President Trump and President Xi are expected to meet in China in early April, but a White House official reportedly said that meeting has not yet been finalized.Republicans are preparing a continuing resolution on DHS funding, but passage is not guaranteed. PoliticoHouse Democrats will force a vote Wednesday to revoke President Trump's tariffs on Canada, but the vote is largely symbolic because President Trump will veto it. PoliticoHouse passes bipartisan bill to reduce regulations and increase housing supply. The Senate will likely make changes to the bill. The HillThe White House wants data center agreements with technology companies so energy prices do not increase for consumers. PoliticoThe Trump administration plans to remove the legal basis for federal greenhouse gas regulation this week. WSJECB member Villeroy will be resigning from his post on June 1, 2026, versus the officially scheduled end date of October 2027.UK Prime Minister Starmer has reportedly garnered support to remain in power, although questions remain surrounding his leadership due to the associated fallout from the Epstein scandal.Taiwan's top trade negotiator said it would be impossible to relocate 40% of the island's semiconductor supply chain to the U.S. before the end of President Trump's second term, according to CNBC.\n• President Trump and President Xi are expected to meet in China in early April, but a White House official reportedly said that meeting has not yet been finalized.\n• Republicans are preparing a continuing resolution on DHS funding, but passage is not guaranteed. Politico\n• House Democrats will force a vote Wednesday to revoke President Trump's tariffs on Canada, but the vote is largely symbolic because President Trump will veto it. Politico\n• House passes bipartisan bill to reduce regulations and increase housing supply. The Senate will likely make changes to the bill. The Hill\n• The White House wants data center agreements with technology companies so energy prices do not increase for consumers. Politico\n• The Trump administration plans to remove the legal basis for federal greenhouse gas regulation this week. WSJ\n• ECB member Villeroy will be resigning from his post on June 1, 2026, versus the officially scheduled end date of October 2027.\n• UK Prime Minister Starmer has reportedly garnered support to remain in power, although questions remain surrounding his leadership due to the associated fallout from the Epstein scandal.\n• Taiwan's top trade negotiator said it would be impossible to relocate 40% of the island's semiconductor supply chain to the U.S. before the end of President Trump's second term, according to CNBC.\n• Commodities: WTI crude: +0.1% to $64.44/bbl Gold: -0.2% to $5068.90/ozt Copper: -0.8% to $5.91/lb\n• WTI crude: +0.1% to $64.44/bbl\n• Gold: -0.2% to $5068.90/ozt\n• Copper: -0.8% to $5.91/lb\n• Currencies: EUR/USD: -0.1% to 1.1901GBP/USD: -0.1% to 1.3676USD/CNH: flat at 6.9126USD/JPY: -0.5% to 155.12\n• EUR/USD: -0.1% to 1.1901\n• GBP/USD: -0.1% to 1.3676\n• USD/CNH: flat at 6.9126\n• USD/JPY: -0.5% to 155.12\n• The Day Ahead:08:30 ET: Q4 Employment Cost Index (Briefing.com consensus 0.8%; prior 0.8%), December Retail Sales (Briefing.com consensus 0.4%; prior 0.6%), Retail Sales ex-auto (Briefing.com consensus 0.4%; prior 0.5%), and December Import/Export Prices 10:00 ET: November Business Inventories (Briefing.com consensus 0.2%; prior 0.3%)\n• 08:30 ET: Q4 Employment Cost Index (Briefing.com consensus 0.8%; prior 0.8%), December Retail Sales (Briefing.com consensus 0.4%; prior 0.6%), Retail Sales ex-auto (Briefing.com consensus 0.4%; prior 0.5%), and December Import/Export Prices\n• 10:00 ET: November Business Inventories (Briefing.com consensus 0.2%; prior 0.3%)\n• Treasury Auctions: 13:00 ET: $58 bln 3-yr Treasury note auction results\n• 13:00 ET: $58 bln 3-yr Treasury note auction results"},{"time":"07:45","ticker":"J","headline":"Jacobs Solutions awarded a contract under the U.S. Missile Defense Agency's Scalable Homeland Innovative Enterprise Layered Defense indefinite-delivery/indefinite-quantity contract, which has a ceiling value of $151 billion","body":"The contract encompasses a broad range of work areas that allows for the rapid delivery of innovative capabilities with increased speed and agility."},{"time":"07:43","ticker":"CRDL","headline":"Cardiol Therapeutics announced the publication of results from its Phase II ARCHER study in ESC Heart Failure, a journal of the European Society of Cardiology","body":"• The peer-reviewed article reports results from a randomized, double-blind, placebo-controlled trial evaluating CardiolRx, Cardiol's lead oral drug candidate, in 109 patients with acute myocarditis using advanced cardiac magnetic resonance (CMR) imaging measures of myocardial inflammation and remodelling.\n• In the study, treatment with CardiolRx produced a significant reduction in left ventricular mass versus placebo (-9.2 g; p=0.0117), along with a decrease in left atrial remodelling, and favorable trends across multiple markers of myocardial inflammation. CardiolRx was also shown to be safe and well tolerated. Reduction in left ventricular mass is widely considered consistent with decreased myocardial edema and inflammatory burden in myocarditis and improved clinical outcomes.\n• The biological signals observed in ARCHER are directly relevant to Cardiol's ongoing pivotal Phase III MAVERIC trial in recurrent pericarditis. Myocarditis and pericarditis are inflammatory diseases of the myocardium and pericardium, respectively, and are recognized to fall within the spectrum of inflammatory myopericardial syndrome, an umbrella term describing the potential myocarditis-pericarditis overlap: similar causes, anatomical contiguous structures, and mixed forms with possible reciprocal involvement, such as myopericarditis and perimyocarditis."},{"time":"07:41","ticker":"EVMN","headline":"Evommune announces top-line Data from Phase 2a proof-of-concept trial of EVO301 in moderate-to-severe atopic dermatitis","body":"Evommune, Inc. (NYSE: EVMN) (the \"Company\" or \"Evommune\"), a clinical-stage biotechnology company developing innovative therapies that target key drivers of chronic inflammatory diseases, today announced positive top-line results from its randomized, double-blind, placebo-controlled Phase 2a trial evaluating EVO301. This long-acting fusion protein consisting of an interleukin-18 (IL-18) binding protein and an anti-serum albumin Fab-associated domain, achieved highly statistically significant outcomes in adult patients with moderate-to-severe atopic dermatitis (AD). The 70-patient trial was designed to evaluate the safety and efficacy of intravenous dosing of 5mg/kg on day 1 and day 28 (n=48 active, n=22 placebo) over 12 weeks.Click here for full release."},{"time":"07:39","ticker":"STEX","headline":"Streamex Corp.'s Co-Founder &amp; Executive Chairman provides corporate update","body":"WINTER PARK, Fla., Feb. 10, 2026 (GLOBE NEWSWIRE) -- Streamex Corp. (\"Streamex\" or the \"Company\") (NASDAQ: STEX), an institutional-grade digital asset and real-world asset tokenization company, today provided a corporate update from its Co-Founder & Executive Chairman, Morgan Lekstrom, highlighting recent strategic progress, balance sheet strength, insider alignment, preparations for the upcoming launch of GLDY, and the 2026 strategic roadmap.Click here for full release."},{"time":"07:33","ticker":"HAS","headline":"Hasbro announces new multi-year licensing partnership with Warner Bros. Discovery Global Consumer Products, making Hasbro the global primary toy licensee for Harry Potter","body":"• Co announces a new multi-year licensing partnership starting in 2027 with Warner Bros. Discovery (WBD) Global Consumer Products, making Hasbro the global primary toy licensee for the world of Harry Potter and the upcoming HBO Original HARRY POTTER series.\n• HAS's innovative team will bring the Harry Potter universe to life through a range of film and HBO Original series-inspired products featuring dolls, role play, action figures & collectibles, interactive plush, board games and more to be revealed later this year.\n• \"The world of Harry Potter and its unforgettable characters align perfectly with our mission to deliver a lifetime of play to generations of fans,\" said Tim Kilpin, President of Toys, Games, Licensing and Entertainment at Hasbro. \"As longtime fans ourselves, we're honored to partner with Warner Bros. Discovery Global Consumer Products as the official global master toy licensee.\""},{"time":"07:33","ticker":"WIRES","headline":"On The Wires","body":"• Starlab Space (VOYG) announced a partnership with Auxilium Biotechnologies. This agreement represents a significant advancement in 3D bioprinting and biofabrication in orbit and underscores Starlab's commitment to growing scientific discovery beyond the limits of Earth.\n• Soluna Holding (SLNH) announced that it has received ERCOT approval to begin the initial energizing and phased commissioning of Project Kati 1 on schedule."},{"time":"07:32","ticker":"SAIA","headline":"Saia misses by $0.13, beats on revs","body":"• Reports Q4 (Dec) earnings of $1.77 per share, $0.13 worse than the FactSet Consensus of $1.90; revenues rose 0.1% year/year to $789.95 mln vs the $776.26 mln FactSet Consensus.\n• \"Results from our core business operations were in line with our expectations for the quarter. However, the quarter was impacted by unexpected adverse developments late in the quarter related to accidents that occurred in prior years, driving approximately $4.7 million in elevated self-insurance related costs. Excluding these costs, the performance in the quarter reflected our team's strong commitment to customer service and disciplined execution despite a dynamic operating environment. Our team's commitment to the customer was evidenced by our claims ratio of 0.47%, which was a record for any quarter in our company's history.\""},{"time":"07:32","ticker":"HAS","headline":"Hasbro and Warner Bros Discovery (WBD) Global Consumer Products announce multi-year partnership to bring the 'Harry Potter' universe to life through licensed toys &amp; games","body":"Hasbro's innovative team will bring the Harry Potter universe to life through a range of film and HBO Original series-inspired products featuring dolls, role play, action figures & collectibles, interactive plush, board games and more to be revealed later this year."},{"time":"07:32","ticker":"UAMY","headline":"U.S. Antimony confirms significant new joint venture with Americas Gold and Silver Corporation (USAS)","body":"Under the Agreement, once the JV Facility is operational, Americas will be paid for the antimony we mine at market terms. On top of that, Americas will also capture 51% of the profits from the processing side of the JV business. In other words, in the future, Americas and its shareholders will have exposure to the downstream profits from antimony production that is not currently being realized."},{"time":"07:30","ticker":"SUMRX","headline":"European Markets Update: DAX +0.1%, FTSE -0.3%, CAC +0.2%","body":"• In economic data:UK's January Retail Sales Monitor 2.3% yr/yr (expected 1.3%; prior 1.0%)France's Q4 Unemployment Rate 7.9% (expected 7.8%; prior 7.7%)\n• UK's January Retail Sales Monitor 2.3% yr/yr (expected 1.3%; prior 1.0%)\n• France's Q4 Unemployment Rate 7.9% (expected 7.8%; prior 7.7%)\n• STOXX Europe 600: +0.1%\n• Germany's DAX: +0.1%\n• U.K.'s FTSE 100: -0.3%\n• France's CAC 40: +0.2%\n• Italy's FTSE MIB: +0.3%\n• Spain's IBEX 35: +0.3%\n• EUR/USD: -0.1% to 1.1904\n• GBP/USD: -0.1% to 1.3674\n• USD/CHF: flat at 0.7662"},{"time":"07:22","ticker":"SCANX","headline":"Gapping up/Gapping down","body":"• CRDO +18.1% (guidance), ICHR +16.7%, DDOG +10.7%, SPOT +10.2%, ENTG +8.4%, OSCR +8.3%, PHG +7.8%, RACE +6.8%, UTL +5.9%, VSTS +5.5%, RLGT +5.4%, MAS +5.4%, BLKB +4.7%, CMCO +4.5% (also withdraws guidance), SSD +4.5%, ACM +4.2%, AMKR +3.6%, LUXE +3.5%, TSM +3.1% (Jan revs), CCSI +2.7%, CRBG +2.6%, DD +2%, HAS +2%, ASX +1.8% (Jan revs), AZN +1.8%, MAR +1.6%, ZBH +1.5%, UDR +1.4% (also increases dividend), DGX +1.4%, KT +1%\n• PSNL +11.9% (announces Medicare coverage for the company's NeXT Personal molecular residual disease test for surveillance of patients with Stage I to III non-small cell lung cancer)\n• TII +11.1% (delivers record zinc production in 2025 and provides guidance for 2026)\n• CCO +9.1% (agrees to be acquired by Mubadala Capital for $6.2 bln)\n• YMT +6.7% (files for 5,567,928 share ADS offering, relates to warrants)\n• STRO +4.5% (pricing of an underwritten offering of 7,868,383 shares of its common stock at a price of $13.98/share)\n• NKTR +3.9% (New REZOLVE-AD maintenance data in atopic dermatitis demonstrate rezpegaldesleukin resulted in durable and new responses across key disease measurements with both monthly and quarterly dosing)\n• RNG +3% (to join S&P SmallCap 600)\n• SLP +3% (extends FDA and NIEHS research collaborations on computational safety models)\n• HGTY +2% (announces debt on Prime Video)\n• UAMY +1.3% (Americas Silver entered into a definitive agreement with United States Antimony (UAMY) forming a Joint Venture)\n• IQ +1% (announces repurchase right notification for 6.50% Convertible Senior Notes due 2028) .\n• SHOP +4.2% (upgraded to Buy from Neutral at MoffettNathanson)\n• SNAP +2.7% (upgraded to Buy from Neutral at Arete)\n• TTWO +2.5% (upgraded to Strong Buy from Outperform at Raymond James)\n• PLTR +1.8% (upgraded to Buy from Neutral at Daiwa)\n• UPWK -25.6%, GTM -13.9%, HOG -11.3%, GT -10%, AMTM -9.5%, ASB -7.6% (guidance), PAL -7.2%, WCC -6.6%, JMIA -6.3%, SPGI -6.1%, ON -4.9%, MEDP -4.4%, INCY -4.3%, XYL -4.1%, BP -3.9%, KO -3.9%, VNO -3.8% (also completes refinancing of One Park Ave), FISV -3.6%, INMD -3.1%, CVS -2.9%, MTW -2.5%, BCS -2%\n• RGNX -12.2% (FDA issues complete response letter regarding its biologics license application for RGX-121)\n• DC -6.2% (prices offering of 12,336,000 shares of its common stock for gross proceeds of $75 mln)\n• NISN -5% (filed a prospectus supplement relating to the offer and sale by the Company of 167,281 shares of the Company's common stock to John Cary, a former equityholder of Tech-X Corporation)\n• LTM -3.7% (stock offering by selling shareholders)\n• ELVR -1.6% (outlines potential Canadian offtake for spodumene concentrate with supply agreement with Mangrove Lithium)\n• VALE -1.1% (updates on asset freeze requests by authorities)\n• UAA -5.3% (downgraded to Sell from Neutral at Citigroup)\n• MNDY -0.7% (downgraded to Neutral from Outperform at Robert Baird)"},{"time":"07:19","ticker":"ECX","headline":"ECARX Holdings announces that the aggregate $100 million in convertible notes contemplated by the convertible note purchase agreement entered into on November 3, 2025","body":""},{"time":"07:16","ticker":"GILT","headline":"Gilat Reports Fourth Quarter and Full Year 2025 Results","body":"Q4 Revenue of $ 137 .0 million, GAAP Operating Income of $ 13 . 0 million and Adjusted EBITDA of $ 1 8 .2 m illionClick here for full release."},{"time":"07:16","ticker":"WIRES","headline":"On The Wires","body":"• Intercontinental Exchange (ICE) announces a significant milestone in the modernization of its MSP mortgage servicing system with the launch of an enhanced user experience. The new UX completes the first phase of a broader modernization initiative, establishing the groundwork for second-phase enhanced workflow automations and productivity agents already being introduced.\n• Abu Dhabi Health Data Services, part of the M42 group, and TELUS Health (TU), announce a strategic agreement to introduce new personalized employee wellbeing solutions in the UAE that combine wellness, precision medicine and AI-driven healthcare innovation. As part of M42's mission to shift health from reactive care to predictive, personalized wellbeing at scale, ADHDS will work with TELUS Health on an Employee Assistance Program that currently includes more than 40 modules addressing emotional, lifestyle and wellbeing support. Delivered in local languages for enhanced user experience, the EAP will help improve workplace focus, lowering absenteeism rates while also enabling employers to achieve measurable improvements\n• Parsons Corporation (PSN) has been awarded a $125 million single-award Task Order contract over five years to support the U.S. Army Combat Capabilities Development Command Army Research Laboratory, High Performance Computing Modernization Program, and Defense Research and Engineering Network. This recompeted award highlights Parsons' commitment to advancing research and development in the military sector and continues a partnership with the DEVCOM Army Research Laboratory that has spanned over 20 years."},{"time":"07:14","ticker":"SPGI","headline":"S&amp;P Global misses by $0.03, reports revs in-line; guides FY26 EPS below consensus","body":"• Reports Q4 (Dec) earnings of $4.30 per share, excluding non-recurring items, $0.03 worse than the FactSet Consensus of $4.33; revenues rose 9.0% year/year to $3.92 bln vs the $3.91 bln FactSet Consensus.\n• Revenue from subscription products increased 8%.\n• Co issues downside guidance for FY26, sees EPS of $19.40-$19.65, excluding non-recurring items, vs. $20.02 FactSet Consensus. Sees organic, constant currency revenue growth of 6-8%."},{"time":"07:14","ticker":"MRNA","headline":"Moderna to enter into long-term strategic agreement with the Government of Mexico","body":"• Co announced it has signed a Memorandum of Understanding (MoU) for a long-term strategic agreement with the Mexican Government, Laboratorios de Biolgicos y Reactivos de Mexico (BIRMEX), and Laboratorios Liomont (Liomont), to enhance Mexico's health sovereignty and mRNA manufacturing resilience.\n• The five-year agreement will include the supply of Moderna's respiratory vaccine portfolio, as well as technology transfer to Liomont, a Mexican pharmaceutical company with state-of-the-art manufacturing facilities, to produce mRNA-1273, Moderna's COVID-19 vaccine, and establish a reliable in-country supply of respiratory vaccines.\n• In alignment with \"Plan Mexico,\" a Mexican government initiative to increase investment and build local production capacity, Moderna and the Mexican Government will also collaborate on local clinical research and development programs based on Mexico's health priorities and work to strengthen its pandemic preparedness framework."},{"time":"07:13","ticker":"LOAN","headline":"Manhattan Bridge Capital declares a quarterly dividend of $0.11/share","body":""},{"time":"07:13","ticker":"ICE","headline":"Intercontinental Exchange announces that the European Securities and Markets Authority has granted recognition to ICE Benchmark Administration Limited as a third-country benchmark administrator under Article 32 of the EU Benchmarks Regulation","body":"• ESMA's recognition decision means that IBA's 'significant' EU benchmarks -- the ICE Swap Rate and the LBMA Gold Price -- remain available for use by 'supervised entities' in the European Union under the EU BMR.\n• In addition to being recognised by ESMA, ICE Benchmark Administration is authorised and regulated by the U.K. Financial Conduct Authority for the regulated activity of administering a benchmark. ICE Benchmark Administration administers a number of other benchmarks pursuant to this authorisation, including the LBMA Silver Price, the ICE Term Reference Rates, and the ICE RFR Indexes. These benchmarks are not currently in scope of the EU BMR and, accordingly, are not currently subject to any EU-usage restrictions."},{"time":"07:13","ticker":"VSTS","headline":"Vestis beats by $0.04, reports revs in-line; reaffirms FY26 revs guidance","body":"• Reports Q1 (Dec) earnings of $0.10 per share, $0.04 better than the FactSet Consensus of $0.06; revenues fell 3.0% year/year to $663.39 mln vs the $664.2 mln FactSet Consensus.\n• Co reaffirms guidance for FY26, sees FY26 revenue of flat to down 2%, which computes as $2.68-2.73 bln vs. $2.64 bln FactSet Consensus."},{"time":"07:12","ticker":"STRO","headline":"Sutro Biopharma announces the pricing of an underwritten offering of 7,868,383 shares of its common stock at a price of $13.98/share","body":"• The gross proceeds from this offering are expected to be approximately $110.0 million, before deducting underwriting discounts and commissions and other offering expenses payable by Sutro. All of the shares of common stock are being offered by Sutro. The offering is expected to close on or about February 11, 2026, subject to the satisfaction of customary closing conditions.\n• Sutro intends to use the net proceeds of this offering, together with its existing cash, cash equivalents and marketable securities, primarily for general corporate purposes, which may include funding research, clinical and process development and manufacturing of its product candidates, increasing its working capital, acquisitions or investments in businesses, products or technologies that are complementary to the Company, capital expenditures and other general corporate purposes."},{"time":"07:10","ticker":"AIRO","headline":"AIRO Group's training division awarded $1.9 million U.S. Navy contract to support flight and JTAC training","body":""},{"time":"07:09","ticker":"NKTR","headline":"Nektar Therapeutics: New REZOLVE-AD maintenance data in atopic dermatitis demonstrate rezpegaldesleukin resulted in durable and new responses across key disease measurements with both monthly and quarterly dosing","body":"71% and 83% of patients maintained EASI-75 responses and 85% and 63% maintained vIGA-AD 0/1 responses with 24 g/kg monthly and quarterly dosing, respectivelyClick here for full release."},{"time":"07:09","ticker":"MAR","headline":"Marriott misses by $0.02, reports revs in-line; guides Q1 EPS above consensus; guides FY26 EPS in-line","body":"• Reports Q4 (Dec) earnings of $2.58 per share, excluding non-recurring items, $0.02 worse than the FactSet Consensus of $2.60; revenues rose 4.1% year/year to $6.69 bln vs the $6.67 bln FactSet Consensus.\n• Co issues upside guidance for Q1, sees EPS of $2.50-2.55, excluding non-recurring items, vs. $2.48 FactSet Consensus.\n• Co issues in-line guidance for FY26, sees EPS of $11.32-11.57, excluding non-recurring items, vs. $11.37 FactSet Consensus."},{"time":"07:09","ticker":"BROS","headline":"Dutch Bros CPG products expand to more stores and online","body":"Dutch Bros' at home assortment is available now through Amazon and on shelves in select Walmart (WMT), H.E.B, and Albertsons (ACI) locations nationwide. Expanded availability is expected to continue rolling out across additional grocery, mass, and ecommerce retailers."},{"time":"07:08","ticker":"INCY","headline":"Incyte misses by $0.11, beats on revs","body":"• Reports Q4 (Dec) earnings of $1.80 per share, excluding non-recurring items, $0.11 worse than the FactSet Consensus of $1.91; revenues rose 27.8% year/year to $1.51 bln vs the $1.35 bln FactSet Consensus.\n• Co sees FY26 total net product revenue of $4.77-4,94 billion. Jakafi net product revenue of $3,220 to $3,270 million and includes the initial launch of Jakafi XR, if approved; Opzelura net product revenue of $750 to $790 million and includes the anticipated ex-U.S. launch of Opzelura in moderate AD in late-2026; and Hematology and Oncology net product revenue of $800 to $880 million."},{"time":"07:08","ticker":"TGT","headline":"Target reshapes executive team under new CEO and reiterates Q4 outlook","body":"• Co announced executive leadership changes effective Feb. 15 aimed at accelerating growth under new CEO Michael Fiddelke.Co named Cara Sylvester as chief merchandising officer and Lisa Roath as chief operating officer, consolidating merchandising authority and streamlining operating structure.Co said chief commercial officer Rick Gomez will depart and Jill Sando will retire, with both supporting transition periods.Co is conducting an external search for a chief guest experience and marketing officer.\n• Co named Cara Sylvester as chief merchandising officer and Lisa Roath as chief operating officer, consolidating merchandising authority and streamlining operating structure.\n• Co said chief commercial officer Rick Gomez will depart and Jill Sando will retire, with both supporting transition periods.\n• Co is conducting an external search for a chief guest experience and marketing officer.\n• Co reaffirms guidance for FY26 (Jan), sees EPS of $7.00-8.00, excluding non-recurring items, vs. $7.28 FactSet Consensus.For the fourth quarter of 2025, the Company is maintaining its expectation of a low-single digit decline in sales.\n• For the fourth quarter of 2025, the Company is maintaining its expectation of a low-single digit decline in sales."},{"time":"07:08","ticker":"BFH","headline":"Bread Financial provides performance update for January 2026; End-of-period credit card and other loans of $18.4 bln vs. $18.4 last year; Delinquency rate of 5.9% versus 6.1% last year","body":""},{"time":"07:06","ticker":"BTGO","headline":"BitGo  Bank &amp; Trust, N.A. and InvestiFi partner to support nationwide digital asset investing for banks and credit unions","body":""},{"time":"07:05","ticker":"FISV","headline":"Fiserv beats by $0.09, beats on revs; guides FY26 EPS in-line","body":"• Reports Q4 (Dec) earnings of $1.99 per share, excluding non-recurring items, $0.09 better than the FactSet Consensus of $1.90; revenues rose 0.6% year/year to $5.28 bln vs the $4.90 bln FactSet Consensus.\n• Co issues in-line guidance for FY26, sees EPS of $8.00-8.30, excluding non-recurring items, vs. $8.17 FactSet Consensus. Co guides to FY26 organic revenue growth of +1-3%."},{"time":"07:05","ticker":"WIRES","headline":"On The Wires","body":"• IHG Hotels & Resorts (IHG) has announced the signing of a franchise agreement for Garner Bhiwadi, continuing the rapid rollout of its newest midscale conversion brand in India. Scheduled to open in 2027, the 45-key hotel will be developed by Modest Structures Private Limited and will be managed by United Hospitality Management, one of IHG's trusted third-party management company in India and Middle East.\n• Johnson Matthey, Sibanye-Stillwater (SBSW), and Valterra Platinum launch a new program to develop innovative technologies enabled by Platinum Group Metals -- versatile, high-performance metals that can power solutions to global challenges and unlock new industrial growth. The collaboration brings together leading PGM producers and world-class R&D and industry expertise to accelerate the journey of new PGM-based products and technologies from research lab to commercialization."},{"time":"07:05","ticker":"BLKB","headline":"Blackbaud beats by $0.03, reports revs in-line; guides FY26 EPS above consensus, revs in-line","body":"• Reports Q4 (Dec) earnings of $1.19 per share, excluding non-recurring items, $0.03 better than the FactSet Consensus of $1.16; revenues fell 2.3% year/year to $295.26 mln vs the $293.5 mln FactSet Consensus.\n• Stock Repurchase Program: As of December 31, 2025, Blackbaud had approximately $961 million remaining under its common stock repurchase program that was expanded, replenished and reauthorized in December 2025. Based on our current plans, we expect total repurchases during 2026 to represent between 5.0% and 10.0% of our outstanding common stock as of December 31, 2025.\n• Co issues guidance for FY26, sees EPS of $5.15-$5.25, excluding non-recurring items, vs. $5.06 FactSet Consensus; sees FY26 revs of $1.173-$1.179 bln vs. $1.17 bln FactSet Consensus."},{"time":"07:05","ticker":"INMD","headline":"InMode beats by $0.04, beats on revs; guides FY26 EPS below consensus, revs below consensus","body":"• Reports Q4 (Dec) earnings of $0.46 per share, excluding non-recurring items, $0.04 better than the FactSet Consensus of $0.42; revenues rose 6.1% year/year to $103.9 mln vs the $101.72 mln FactSet Consensus.\n• \"While conditions across our industry remain challenging, we are seeing early signs of stabilization,\" said Moshe Mizrahy, Chief Executive Officer of InMode. \"While the global uncertainties, particularly in North America, continue to weigh on overall demand, and the industry has yet to fully rebound, we are encouraged by the initial growth in Europe.\"\n• Co issues downside guidance for FY26, sees EPS of $1.43-1.48, excluding non-recurring items, vs. $1.64 FactSet Consensus; sees FY26 revs of $365-375 mln vs. $376.76 mln FactSet Consensus."},{"time":"07:05","ticker":"TRAK","headline":"ReposiTrak announces its patent-pending system and methods for automated error detection and context-aware correction of food traceability data, to address average data error rates of 40% in all traceability records","body":"• The patent-pending technology addresses a critical industry problem: traceability and transactional files that technically conform to standards but contain content errors such as missing or incorrect lot codes, inaccurate product identifiers, and inconsistent shipping details-issues that typically require costly and time-consuming manual correction.\n• ReposiTrak's patent-pending system ingests heterogeneous data formats, including EDI, CSV, XLSX, XML, JSON, and API feeds, and normalizes them into a canonical data model. A hybrid engine combining deterministic expert rules and AI-driven inference identifies structural, semantic, and contextual anomalies. The system then generates, ranks, and applies candidate corrections using historical records and cross-document correlation, with confidence scoring to determine whether corrections are applied automatically or routed for human review. All actions are recorded with a complete audit trail to support regulatory compliance."},{"time":"07:04","ticker":"MAS","headline":"Masco beats by $0.03, misses on revs; guides FY26 EPS in-line; authorizes new $2 bln share repurchase program","body":"• Reports Q4 (Dec) earnings of $0.82 per share, excluding non-recurring items, $0.03 better than the FactSet Consensus of $0.79; revenues fell 1.9% year/year to $1.79 bln vs the $1.82 bln FactSet Consensus.\n• Co issues in-line guidance for FY26, sees EPS of $4.10-4.30, excluding non-recurring items, vs. $4.16 FactSet Consensus.\n• For 2026, co believes sales across the global repair and remodel markets will be roughly flat. Co expects its sales to be roughly flat to up low-single digits when adjusted for currency.\n• The Board also authorized a new $2.0 billion share repurchase program effective February 10, 2026, replacing the existing authorization."},{"time":"07:04","ticker":"COO","headline":"CooperVision launches MiSight 1 day in Japan; becomes first myopia control contact lens in leading vision care market","body":""},{"time":"07:04","ticker":"EWCZ","headline":"European Wax Center has entered into a definitive agreement to be taken private by General Atlantic, a leading global investor, in an all-cash transaction with an implied equity value of approximately $330 mln","body":"• General Atlantic has been a strategic partner to the Company since its initial investment in 2018 and is currently the beneficial owner of approximately 42% of the Company's outstanding shares of the Company's common stock.\n• Under the terms of the agreement, General Atlantic will acquire 100% of the outstanding shares of class A common stock that it does not already own. European Wax Center stockholders (other than affiliates of General Atlantic) will receive $5.80 per share in cash for each share of European Wax Center class A common stock they own. The purchase price represents a 45% premium to European Wax Center's closing stock price on February 9, 2026, the last full trading day prior to the transaction announcement, and a 51% premium to the Company's 90-day volume-weighted average share price for the period ended February 9, 2026.\n• The transaction is expected to close in mid-2026, subject to certain closing conditions, including approval by a majority of the votes cast by holders of shares of the Company's common stock that are not affiliated with General Atlantic and the satisfaction of regulatory approvals.\n• Upon completion of the transaction, European Wax Center's class A common stock will no longer be publicly listed, and European Wax Center will become a privately-held company."},{"time":"07:03","ticker":"DDOG","headline":"Datadog beats by $0.04, beats on revs; guides Q1 EPS below consensus, revs above consensus; guides FY26 EPS below consensus, revs below consensus","body":"• Reports Q4 (Dec) earnings of $0.59 per share, excluding non-recurring items, $0.04 better than the FactSet Consensus of $0.55; revenues rose 29.2% year/year to $953.19 mln vs the $918.7 mln FactSet Consensus.\n• Co issues mixed guidance for Q1, sees EPS of $0.49-0.51, excluding non-recurring items, vs. $0.53 FactSet Consensus; sees Q1 revs of $951-961 mln vs. $935.61 mln FactSet Consensus.\n• Co issues downside guidance for FY26, sees EPS of $2.08-2.16, excluding non-recurring items, vs. $2.33 FactSet Consensus; sees FY26 revs of $4.06-4.10 bln vs. $4.11 bln FactSet Consensus."},{"time":"07:03","ticker":"IBM","headline":"IBM introduces autonomous storage with new flashsystem portfolio powered by agentic AI","body":"• Three new enterprise storage systems - IBM FlashSystem 5600, 7600, and 9600 -- significantly reduce storage management efforts.\n• FlashSystem.ai brings AI agents to storage arrays as co-administrators.\n• Fifth-generation FlashCore Module detects ransomware in under 1 minute, offers new advances in system resiliency and data management."},{"time":"07:03","ticker":"ENTG","headline":"Entegris beats by $0.03, beats on revs; guides Q1 EPS above consensus, revs mostly above consensus","body":"• Reports Q4 (Dec) earnings of $0.70 per share, excluding non-recurring items, $0.03 better than the FactSet Consensus of $0.67; revenues fell 3.0% year/year to $823.9 mln vs the $811.34 mln FactSet Consensus.\n• Co issues guidance for Q1, sees EPS of $0.70-0.78, excluding non-recurring items, vs. $0.64 FactSet Consensus; sees Q1 revs of $785-825 mln vs. $785.04 mln FactSet Consensus.The Company also expects Adjusted EBITDA of approximately 26.5% to 27.5% of sales.\n• The Company also expects Adjusted EBITDA of approximately 26.5% to 27.5% of sales."},{"time":"07:02","ticker":"TRMB","headline":"Trimble beats by $0.04, beats on revs; guides Q1 EPS in-line, revs in-line; guides FY26 EPS in-line, revs in-line","body":"• Reports Q4 (Dec) earnings of $1.00 per share, excluding non-recurring items, $0.04 better than the FactSet Consensus of $0.96; revenues fell 1.4% year/year to $969.8 mln vs the $950.01 mln FactSet Consensus.\n• Co issues in-line guidance for Q1, sees EPS of $0.69-$0.74, excluding non-recurring items, vs. $0.72 FactSet Consensus; sees Q1 revs of $893-$918 mln vs. $897.47 mln FactSet Consensus.\n• Co issues in-line guidance for FY26, sees EPS of $3.42-$3.62, excluding non-recurring items, vs. $3.46 FactSet Consensus; sees FY26 revs of $3.81-$3.91 bln vs. $3.84 bln FactSet Consensus."},{"time":"07:00","ticker":"SUMRX","headline":"Asian Markets Close: Nikkei +2.2%, Hang Seng +0.6%, Shanghai +0.1%","body":"• In economic data:Japan's M2 Money Stock 1.6% yr/yr (expected 1.7%; prior 1.7%); Machine Tool Orders 25.3% yr/yr (prior 10.9%)Australia's February Westpac Consumer Sentiment 90.5 (prior 92.9); January NAB Confidence 3 (prior 2)\n• Japan's M2 Money Stock 1.6% yr/yr (expected 1.7%; prior 1.7%); Machine Tool Orders 25.3% yr/yr (prior 10.9%)\n• Australia's February Westpac Consumer Sentiment 90.5 (prior 92.9); January NAB Confidence 3 (prior 2)\n• Japan's Nikkei: +2.2%\n• Hong Kong's Hang Seng: +0.6%\n• China's Shanghai Composite: +0.1%\n• India's Sensex: +0.3%\n• South Korea's Kospi: +0.1%\n• Australia's All Ordinaries: +0.1%\n• USD/JPY: -0.4% to 155.23\n• USD/CNH: -0.1% to 6.9101\n• USD/INR: -0.3% to 90.436"},{"time":"06:59","ticker":"KO","headline":"Coca-Cola beats by $0.02, misses on revs; Issues FY26 outlook, expects to deliver organic revenue growth of 4-5%","body":"• Reports Q4 (Dec) earnings of $0.58 per share, excluding non-recurring items, $0.02 better than the FactSet Consensus of $0.56; revenues rose 2.2% year/year to $11.8 bln vs the $12.03 bln FactSet Consensus.\n• Organic revenues grew 5%, driven by a 4% increase in concentrate sales and 1% growth in price/mix.\n• Unit case volume grew 1% for the quarter, led by growth in Brazil, the United States and Japan.\n• Comparable operating margin (non-GAAP) was 24.4% versus 24.0% in the prior year.\n• 2026 Outlook: Expects to deliver organic revenue growth of 4% to 5%. Expects to deliver comparable currency neutral EPS excluding acquisitions and divestitures growth of 5% to 6% and comparable EPS (non-GAAP) growth of 7% to 8% versus $3.00 in 2025. The company expects to generate free cash flow of approximately $12.2 billion. This consists of cash flow from operations of approximately $14.4 billion, less capital expenditures of approximately $2.2 billion."},{"time":"06:59","ticker":"XYL","headline":"Xylem beats by $0.01, beats on revs; guides FY26 EPS in-line, revs below consensus; raises dividend","body":"• Reports Q4 (Dec) earnings of $1.42 per share, excluding non-recurring items, $0.01 better than the FactSet Consensus of $1.41; revenues rose 6.3% year/year to $2.4 bln vs the $2.37 bln FactSet Consensus.\n• Co issues guidance for FY26, sees EPS of $5.35-5.60 vs. $5.55 FactSet Consensus; sees FY26 revs of +1-3% yr/yr to ~$9.1-9.2 bln vs. $9.32 bln FactSet Consensus.\n• The Board of Directors of Xylem has declared a first-quarter dividend of $0.43 per share, an increase of 8%. The dividend is payable on March 24, 2026, to shareholders of record as of February 24, 2026."},{"time":"06:56","ticker":"DXF","headline":"Eason Technology Limited announces that its subsidiary entered into a definitive agreement to make a strategic investment of $1 mln in Shou Chang Energy Private Investment Fund, acquiring approximately 30% interest of the fund","body":""},{"time":"06:49","ticker":"RACE","headline":"Ferrari beats by 0.05, beats on revs","body":"• Reports Q4 (Dec) earnings of 2.14 per share, excluding non-recurring items, 0.05 better than the FactSet Consensus of 2.09; revenues rose 3.8% year/year to 1.8 bln vs the 1.77 bln FactSet Consensus.\n• Shipments of 3,152 units, down 173 units.\n• \" ... Demand for Ferrari remains very solid and is managed with discipline in every market reflecting our exclusivity model: our order book extends towards the end of 2027. We remain true to our identity: forward-looking and defined by our will to progress\"."},{"time":"06:49","ticker":"DGX","headline":"Quest Diagnostics beats by $0.05, beats on revs; guides FY26 EPS above consensus, revs above consensus","body":"• Reports Q4 (Dec) earnings of $2.42 per share, excluding non-recurring items, $0.05 better than the FactSet Consensus of $2.37; revenues rose 7.1% year/year to $2.81 bln vs the $2.76 bln FactSet Consensus.\n• Co issues upside guidance for FY26, sees EPS of $10.50-10.70, excluding non-recurring items, vs. $10.40 FactSet Consensus; sees FY26 revs of $11.70-11.82 bln vs. $11.4 bln FactSet Consensus."},{"time":"06:47","ticker":"LAZ","headline":"Lazard reports January 2026 assets under management","body":"• Co reported that its preliminary assets under management as of January 31, 2026 totaled approximately $267.0 billion.\n• The month's AUM included market appreciation of $7.6 billion, net inflows of $2.9 billion and FX appreciation of $2.1 billion."},{"time":"06:47","ticker":"MCHP","headline":"Microchip announces the pricing of $800 million aggregate principal amount of Convertible Senior Notes due 2030 a private offering","body":"• The size of the offering was increased from the previously announced $600 million in aggregate principal amount.\n• The sale of the notes to the initial purchasers is expected to settle on February 11, 2026, subject to customary closing conditions, and is expected to result in approximately $785.1 million in net proceeds to Microchip after deducting the initial purchasers' discounts and commissions and estimated offering expenses payable by Microchip (assuming no exercise of the initial purchasers' option to purchase additional notes).\n• Microchip intends to use approximately $60.5 million of the net proceeds of the offering to pay the cost of the capped call transactions described above. If the initial purchasers exercise their option to purchase additional notes, Microchip expects to use a portion of the net proceeds from the sale of such additional notes to enter into additional capped call transactions. Microchip intends to use the remaining net proceeds to repay notes outstanding under Microchip's commercial paper program."},{"time":"06:42","ticker":"ENTA","headline":"Enanta Pharmaceuticals reports financial results for its fiscal first quarter; cash runway expected to fund operations into fiscal 2029","body":"Enanta Pharmaceuticals, Inc. (NASDAQ:ENTA), a clinical-stage biotechnology company dedicated to creating small molecule drugs for viral infections and immunological diseases, today reported financial results for its fiscal first quarter ended December 31, 2025.Click here for full release."},{"time":"06:39","ticker":"USAS","headline":"Americas Silver  entered into a definitive agreement with United States Antimony (UAMY) forming a Joint Venture","body":"• U.S.-Based Vertical Integration: The JV will construct a new antimony processing plant in Idaho's Silver Valley. This construction and processing business will be overseen by representatives of each company.Americas-Controlled Feedstock and Site: Americas will contribute the site under existing operating permits for the JV Facility at its Galena Complex in Idaho and will sell antimony feed material mined from the Galena Complex to the JV on market terms. While Americas material will have priority, the JV Facility will also have the potential to process from other mines.\n• Operational and Market Expertise: US Antimony will contribute its knowledge and technical expertise in constructing and operating these types of facilities and will provide the JV with access to its extensive antimony marketing network including the U.S. Government. Subject to the completion of supply agreements as contemplated by the JV in the following 90 days, US Antimony will purchase the antimony produced by the JV at market terms."},{"time":"06:38","ticker":"ZBH","headline":"Zimmer Biomet beats by $0.02, reports revs in-line; guides FY26 EPS below consensus, revs below consensus","body":"• Reports Q4 (Dec) earnings of $2.42 per share, excluding non-recurring items, $0.02 better than the FactSet Consensus of $2.40; revenues rose 10.9% year/year to $2.24 bln vs the $2.22 bln FactSet Consensus.\n• Co issues downside guidance for FY26, sees EPS of $8.30-8.45, excluding non-recurring items, vs. $8.46 FactSet Consensus; sees FY26 revs of +2.5-4.0% yr/yr to ~$8.44-8.56 bln vs. $8.62 bln FactSet Consensus."},{"time":"06:36","ticker":"ARMK","headline":"Aramark beats by $0.01, beats on revs; reaffirms FY26 EPS guidance, revs guidance","body":"• Reports Q1 (Dec) earnings of $0.51 per share, excluding non-recurring items, $0.01 better than the FactSet Consensus of $0.50; revenues rose 6.1% year/year to $4.83 bln vs the $4.74 bln FactSet Consensus.\n• Co reaffirms guidance for FY26, sees EPS of $2.18-2.28, excluding non-recurring items, vs. $2.22 FactSet Consensus; sees FY26 revs of $19.55-19.95 bln vs. $19.7 bln FactSet Consensus.\n• The Company is off to a great start to fiscal 2026, with momentum building across the business. New business wins were extensive in the quarter, and the Company delivered unprecedented client retention levels in both FSS United States and International-resulting in currently outpacing the run-rate to achieve Aramark's Net New Business target of 4% to 5% of prior year revenue.\n• The Company is highly committed to expanding its Global Supply Chain network and is actively pursuing meaningful business opportunities in hospitality categories, while continuing to benefit from increased volume and scale. Aramark remains focused on driving profitability from its multiple operating levers, including supply chain initiatives and effective cost management. Among these strategies, AI-driven technology is enhancing the Company's supply chain capabilities, delivering back-end efficiencies and actionable business insights."},{"time":"06:35","ticker":"WIRES","headline":"On The Wires","body":"• Abu Dhabi Health Data Services, part of the M42 group, and TELUS (TU) Health, announced a strategic agreement to introduce new personalized employee wellbeing solutions in the UAE that combine wellness, precision medicine and AI-driven healthcare innovation. As part of M42's mission to shift health from reactive care to predictive, personalized wellbeing at scale, ADHDS will work with TELUS Health on an Employee Assistance Program (EAP) that currently includes more than 40 modules addressing emotional, lifestyle and wellbeing support. Delivered in local languages for enhanced user experience, the EAP will help improve workplace focus, lowering absenteeism rates while also enabling employers to achieve measurable improvements in productivity and engagement.\n• Amrize (AMRZ) disclosed that on February 5, 2026, the it received a Section 107(a) imminent danger Order from MSHA due to a third party contract miner exposed to a fall hazard by straddling a three foot step ladder (i.e., beyond design capacity) at the Ravena cement plant, New York. No injuries occurred as a result of this incident.\n• Sound Point Meridian Capital (SPMC) unaudited estimate of the range of the net asset value per share of Sound Point Meridian Capital common stock as of January 31, 2026, was between $13.35 and $13.45."},{"time":"06:35","ticker":"DGX","headline":"Quest Diagnostics increases quarterly cash dividend 7.5% to $0.86/share from $0.80/share and increases the Company's share repurchase authorization by $1 bln","body":"The increased authority is in addition to the approximately $0.4 bln that was available as of December 31, 2025 under the Company's share repurchase program."},{"time":"06:34","ticker":"HAS","headline":"Hasbro beats by $0.57, beats on revs; Sees FY26 revenue up 3-5% in constant currency, Announces $1 bln share repurchase program","body":"• Reports Q4 (Dec) earnings of $1.51 per share, excluding non-recurring items, $0.57 better than the FactSet Consensus of $0.94; revenues rose 31.3% year/year to $1.45 bln vs the $1.26 bln FactSet Consensus.\n• Growth in Wizards and Digital Gaming (+86%) and Consumer Products (+7%) partially offset by a decline in Entertainment (-5%).\n• Announces $1 bln share repurchase program.\n• 2026 Outlook: Total revenue up 3-5% in constant currency. Adjusted operating margin of 24%-25%. Adjusted EBITDA of $1.40 billion to $1.45 billion."},{"time":"06:33","ticker":"SCANX","headline":"Early premarket gappers","body":"• Gapping up: ICHR +18.3%, CRDO +17.3%, SPOT +13.9%, CCO +8.2%, PHG +7.1%, YMT +6.7%, UTL +5.9%, RLGT +5.4%, TII +4.6%, CMCO +4.5%, SSD +4.5%, ACM +4.2%, AMKR +3.8%, PSNL +3.4%, SLP +3%, RNG +2.8%, TSM +2.8%, CCSI +2.7%, LUXE +2.7%, CRBG +2.6%, DD +2.5%, HGTY +2%, PSN +2%, AZN +2%, KT +2%, ASX +1.8%, CE +1.7%, AXTA +1.5%, TAK +1.4%, UDR +1.4%, HMC +1.4%, EVTL +1.2%, GSK +1%\n• ICHR +18.3%, CRDO +17.3%, SPOT +13.9%, CCO +8.2%, PHG +7.1%, YMT +6.7%, UTL +5.9%, RLGT +5.4%, TII +4.6%, CMCO +4.5%, SSD +4.5%, ACM +4.2%, AMKR +3.8%, PSNL +3.4%, SLP +3%, RNG +2.8%, TSM +2.8%, CCSI +2.7%, LUXE +2.7%, CRBG +2.6%, DD +2.5%, HGTY +2%, PSN +2%, AZN +2%, KT +2%, ASX +1.8%, CE +1.7%, AXTA +1.5%, TAK +1.4%, UDR +1.4%, HMC +1.4%, EVTL +1.2%, GSK +1%\n• Gapping down: UPWK -25.3%, RGNX -12.6%, AMTM -11.3%, GTM -10.7%, GT -7.8%, ASB -7.6%, DC -7%, PAL -6.4%, WCC -6.2%, MEDP -4.8%, ON -4.7%, BP -4.1%, VNO -3.8%, LTM -2.9%, MTW -2.5%, CPA -1.9%, BCS -1.8%, NISN -1.7%, ELVR -1.6%, GBCI -1.2%\n• UPWK -25.3%, RGNX -12.6%, AMTM -11.3%, GTM -10.7%, GT -7.8%, ASB -7.6%, DC -7%, PAL -6.4%, WCC -6.2%, MEDP -4.8%, ON -4.7%, BP -4.1%, VNO -3.8%, LTM -2.9%, MTW -2.5%, CPA -1.9%, BCS -1.8%, NISN -1.7%, ELVR -1.6%, GBCI -1.2%"},{"time":"06:33","ticker":"CVS","headline":"CVS Health beats by $0.09, beats on revs; guides FY26 EPS in-line","body":"• Reports Q4 (Dec) earnings of $1.09 per share, excluding non-recurring items, $0.09 better than the FactSet Consensus of $1.00; revenues rose 8.2% year/year to $105.69 bln vs the $103.67 bln FactSet Consensus.\n• Co issues in-line guidance for FY26, sees EPS of $7.00-7.20, excluding non-recurring items, vs. $7.18 FactSet Consensus.Updated cash flow from operations guidance to at least $9.0 billion from at least $10.0 billion\n• Updated cash flow from operations guidance to at least $9.0 billion from at least $10.0 billion"},{"time":"06:33","ticker":"IQ","headline":"iQIYI  announces repurchase right notification for 6.50% Convertible Senior Notes due 2028","body":"The Repurchase Right begins at 9:00 a.m., New York City time, on Tuesday, February 10, 2026 and expires at 5:00 p.m., New York City time, on Thursday, March 12, 2026."},{"time":"06:24","ticker":"MT","headline":"ArcelorMittal confirms the construction of an electric arc furnace at its steelmaking site in Dunkirk - a strategic 1.3 bln investment which marks a major step in the decarbonisation of ArcelorMittal's steel production in France","body":"The start-up of this 2-million-tonne EAF is scheduled for 2029. It will produce steel with three times less CO2 compared with a blast furnace (0.6 tonne CO2 per tonne of steel in the EAF based on a mix of scrap, HBI/DRI and hot metal). Its funding will be supported by Energy Efficiency Certificates (CEE), a regulatory mechanism that promotes energy savings and CO2 reduction. The amount of support will represent 50% of the 1.3 billion investment."},{"time":"06:20","ticker":"VALE","headline":"Vale S.A. updates on asset freeze requests by authorities","body":"• Further to the press release disclosed on February 5, 2026, Vale S.A. informs that three requests for asset freezes, filed on a preliminary basis and totaling R$ 2.846 billion, have been denied by the respective competent courts. Only one decision remains pending, related to an asset freeze request in the amount of R$ 200 million. The Company further highlights that other preliminary measures of a different nature have been granted by the competent courts, some of which are already being fulfilled, such as the suspension of operations at the Fbrica and Viga units (which were halted by Vale on January 25, 2026) and the preparation of the Degraded Areas Recovery Plan.\n• The Company clarifies that the overflows that occurred at the Fbrica and Viga units in January 2026 are not related to any of Vale's dams in the region, which remains in unchanged safe conditions and under continuous monitoring, 24 hours a day, seven days a week. The causes of the events continue under investigation through a technical and structured process, with transparency. The Company's priority remains the protection of people, communities, and the environment. Vale continues to cooperate with the authorities and is carrying out sediment removal and cleaning of the affected areas, in line with its commitments. The Company will keep the market informed of any relevant developments, in line with applicable regulations."},{"time":"06:18","ticker":"WCC","headline":"Wesco announces the upcoming retirement of Dave Schulz, Executive Vice President and Chief Financial Officer, and the appointment of Indraneel Dev as Executive Vice President and Chief Financial Officer","body":"• Mr. Schulz notified the Company that he expects to retire in May 2026, and Mr. Dev will join the Company in February 2026 to ensure a smooth transition.\n• Most recently, Mr. Dev served as the Chief Financial Officer and Chief Revenue Officer of Congruex LLC, a communications network infrastructure design, engineering and construction company."},{"time":"06:16","ticker":"CTSH","headline":"Cognizant Tech is collaborating under a three-year strategic agreement with DAMAC Group","body":"• Through this collaboration, DAMAC entrusts Cognizant with the comprehensive management and enhancement of its IT infrastructure and application services. This initiative focuses on working to streamline operations and help improve digital experiences for both customers and employees.\n• Under this strategic engagement, Cognizant supports DAMAC's technology transformation by elevating service delivery, accelerating digital maturity, and driving measurable business impact. The engagement encompasses a wide spectrum of IT infrastructure services and application services across DAMAC's ecosystem, including digital and e-commerce platforms, CRM, core enterprise systems, data platforms, and AI-led initiatives. By embedding automation, operational excellence, and continuous improvement, the initiative is designed to boost business agility, scalability, and alignment with DAMAC's long-term strategic vision."},{"time":"06:16","ticker":"CPA","headline":"Copa Holdings announces monthly traffic statistics for January 2026; ASM +11.9%; load factor 87.5% versus 86.4% last year","body":""},{"time":"06:14","ticker":"PSNL","headline":"Personalis announces Medicare coverage for the company's NeXT Personal molecular residual disease test for surveillance of patients with Stage I to III non-small cell lung cancer","body":"• This coverage determination is grounded in clinical evidence generated through the company's collaboration with the TRACERx (TRAcking Cancer Evolution through therapy (Rx)) consortium. Data from this world-renowned longitudinal study, recently published in Cell, demonstrated NeXT Personal's ability to identify residual disease with high accuracy, validating the test's clinical performance in lung cancer.\n• Lung cancer remains the leading cause of cancer death in the United States, with an estimated ~230,000 new cases diagnosed annually. For patients with Stage I-III NSCLC, the risk of recurrence remains a primary clinical concern. To address this challenge, NeXT Personal is designed to detect trace amounts of circulating tumor DNA that can indicate the presence of cancer, often before the cancer appears on standard of care imaging scans."},{"time":"06:11","ticker":"DD","headline":"DuPont beats by $0.03, reports revs in-line; guides Q1 EPS in-line, revs in-line; guides FY26 EPS above consensus, revs above consensus","body":"• Reports Q4 (Dec) earnings of $0.46 per share, excluding non-recurring items, $0.03 better than the FactSet Consensus of $0.43; revenues rose 0.2% year/year to $1.69 bln vs the $1.69 bln FactSet Consensus.\n• Organic sales decreased 1% versus year-ago period including a $30 million, or 2%, headwind from the third quarter timing shift.\n• Co issues in-line guidance for Q1, sees EPS of $0.48 vs. $0.48 FactSet Consensus; sees Q1 revs of $1.670 bln vs. $1.67 bln FactSet Consensus.\n• Co issues upside guidance for FY26, sees EPS of $2.25-$2.30, excluding non-recurring items, vs. $2.14 FactSet Consensus; sees FY26 revs of $7.075-$7.135 bln vs. $7.06 bln FactSet Consensus."},{"time":"06:09","ticker":"WCC","headline":"Wesco misses by $0.49, reports revs in-line; guides FY26 EPS in-line, revs in-line","body":"• Reports Q4 (Dec) earnings of $3.40 per share, excluding non-recurring items, $0.49 worse than the FactSet Consensus of $3.89; revenues rose 10.3% year/year to $6.07 bln vs the $6.03 bln FactSet Consensus.\n• \"Looking ahead in 2026, we expect to continue to outperform the market and deliver mid- to high-single-digit organic sales growth, strong operating leverage and margin expansion, double-digit EPS growth, and improved free cash flow generation.\"\n• Co issues in-line guidance for FY26, sees EPS of $14.50-16.50, excluding non-recurring items, vs. $16.39 FactSet Consensus; sees FY26 revs growth of 5-8%, which translates to ~$24.7-25.4 bln vs. $24.92 bln FactSet Consensus.\n• We plan to increase our common stock dividend 10% again this year to $2.00 per share."},{"time":"06:08","ticker":"SPOT","headline":"Spotify beats by 1.69, reports revs in-line; guides Q1 revs below consensus","body":"• Reports Q4 (Dec) earnings of 4.43 per share, 1.69 better than the FactSet Consensus of 2.74; revenues rose 6.8% year/year to 4.53 bln vs the 4.52 bln FactSet Consensus.\n• Total Monthly Active Users (\"MAUs\") up 11% yr/yr to 751 mln.\n• Premium Subscribers up 10% yr/yr to 290 mln.\n• Co issues downside guidance for Q1, sees Q1 revs of 4.5 bln vs. 4.58 bln FactSet Consensus. Sees total MAUs of 759 mln, implying the addition of approximately 8 mln net new MAUs. Sees Total Premium Subscribers of 293 mln, implying the addition of approximately 3 million net new subscribers in the quarter."},{"time":"06:08","ticker":"AXTA","headline":"Axalta Coating Systems misses by $0.01, reports revs in-line; guides Q1 EPS below consensus; guides FY26 EPS in-line","body":"• Reports Q4 (Dec) earnings of $0.59 per share, excluding non-recurring items, $0.01 worse than the FactSet Consensus of $0.60; revenues fell 3.7% year/year to $1.26 bln vs the $1.27 bln FactSet Consensus.\n• Co issues downside guidance for Q1, sees EPS of ~$0.50 vs. $0.60 FactSet Consensus.Co sees Q1 net sales down mid-single digits percentage\n• Co sees Q1 net sales down mid-single digits percentage\n• Co issues in-line guidance for FY26, sees EPS of $2.55 - $2.70 vs. $2.66 FactSet Consensus.Co sees FY26 revs growing low-single-digits percentage\n• Co sees FY26 revs growing low-single-digits percentage"},{"time":"06:04","ticker":"OSCR","headline":"Oscar Health misses by $0.35, misses on revs; guides FY26 revs well above consensus","body":"• Reports Q4 (Dec) loss of $1.24 per share, $0.35 worse than the FactSet Consensus of ($0.89); revenues rose 17.3% year/year to $2.81 bln vs the $3.11 bln FactSet Consensus.\n• Co issues in-line guidance for FY26, sees FY26 revs of $18.7-19.0 bln vs. $12.48 bln FactSet Consensus."},{"time":"06:04","ticker":"TII","headline":"Titan Mining delivers record zinc production in 2025 and provides guidance for 2026","body":"• Delivered record zinc production of 64.2 million payable pounds in 2025, up 8% from 2024.\n• Achieved full-year production guidance, with Q4 output of 18.7 million pounds, up 28% sequentially.\n• 2026 production guidance of 62--66 million payable pounds, reflecting a mine plan focused on development, access to higher-quality ore and long-term value optimization. Production guidance for 2026 is estimated to be between 73 - 78 million zinc recoverable pounds or 62 - 66 million zinc payable pounds. C1 Cash Cost for 2026 is estimated between $0.93 and $1.01 per payable pound, and AISC for 2026 is estimated between $1.07 and $1.17 per payable pound.\n• First production of graphite concentrate from the Kilbourne facility has commenced with ongoing optimization and qualification runs.\n• Germanium identified in zinc process streams is being analyzed for optimal recovery techniques, with ongoing exploration of partnership options with technology partners."},{"time":"06:04","ticker":"LUXE","headline":"LuxExperience reports Q2 net sales growth of +5.7% ex-FX; fully confirming the transformation plan targets","body":"Q2 FY26 Results: LuxExperience Group reports Net Sales growth of +5.7% ex-FX and return to Adjusted EBITDA profitability, fully confirming the transformation plan targetsClick here for full release."},{"time":"06:03","ticker":"","headline":"S&P futures vs fair value: +3.00. Nasdaq futures vs fair value: -1.00.","body":""},{"time":"06:03","ticker":"","headline":"European Markets","body":"FTSE...10346.93...-39.30...-0.40%. DAX...25017...+2.10...+0.00%."},{"time":"06:03","ticker":"","headline":"Asian Markets","body":"Nikkei...57650.54...+1286.60...+2.30%. Hang Seng...27183.16...+156.00...+0.60%."},{"time":"06:03","ticker":"HTGC","headline":"Hercules Capital announces new supplemental cash distribution of $0.07 per share for the fourth quarter of 2025 is in addition to the regular quarterly cash distribution of $0.40 per share","body":""},{"time":"06:02","ticker":"IMOS","headline":"ChipMOS TECHNOLOGIES reported its unaudited consolidated revenue for the month of January 2026","body":"• Revenue for the month of January 2026 was NT$2,290.4 million or US$72.7 million, representing an increase of 4.0% from December 2025, and an increase of 31.2% from January 2025\n• This represents the highest year-over-year increase in monthly revenue since June of 2021. The Company noted it is continuing to benefit from the semiconductor industry's fundamentally improved cycle position, with continued strong revenue growth led by robust demand for high-value memory solutions, particularly in data center and AI-related applications."},{"time":"06:00","ticker":"SUMRX","headline":"Overnight Summary -- Asia sets the tone with record Japan rally while U.S. futures hold gains and Europe digests earnings","body":"• Markets are opening with a cautiously upbeat lean, as U.S. futures hover just above fair value, Asia powers higher led by Japan, Europe sends mixed signals, and a softer yen offsets steady rates and quiet commodity moves. S&P futures are up about five points, trading around 6989. The market's range consolidated to just over 25 points. The high was set at 6997.00. The low sits at 6972.25.\n• Asian equities finished mostly higher on Tuesday as post-election optimism in Japan and a rebound in technology stocks supported regional sentiment. Japan led gains, with the Nikkei 225 jumping 2.28% to a fresh record after Prime Minister Takaichi's landslide victory, while SoftBank surged ahead of earnings and Furukawa Electric rallied on strong results. China edged higher, with the Shanghai Composite up 0.13% on stimulus expectations and continued enthusiasm around artificial intelligence. Hong Kong also advanced, with the Hang Seng rising 0.58%, led by strength in pharma and tech names, as a softer dollar and steadier commodities provided a relatively calm macro backdrop.\n• European equities trade broadly higher on Monday as tech-related jitters ease, and a wave of M&A and earnings news lifts sentiment across the region. The FTSE 100 declines after a weaker U.K. jobs report, as easing declines in permanent placements offset stock-specific pressure from NatWest following its agreement to acquire Evelyn Partners. Germany's DAX pushes higher, supported by banks, industrials, and defense names, after eurozone investor confidence improves sharply, with the Sentix index rising to its highest level since mid-2025. France's CAC 40 is up 0.4%, with strength in technology and healthcare after STMicroelectronics expands its AWS partnership and Novo Nordisk jumps on news that a copycat weight-loss drug is being pulled from the market.\n• S&P Futures vs Fair Value: +5.0\n• 10 yr Note: 4.186%\n• USD/JPY: 155.22 -0.66\n• EUR/USD: 1.1916 -0.0001\n• Europe: FTSE: -0.4% DAX: +0.1% CAC: +0.4%\n• Asia: Hang Seng: +0.6% Shanghai: +0.1% Nikkei: +2.3%\n• Gold (5070.50 -8.90) Silver (81.910 -0.324) Crude (64.26 -0.10)"},{"time":"05:18","ticker":"BP","headline":"BP reports EPS in-line, beats on revs; suspends buyback; proposes dividend raise","body":"• Reports Q4 (Dec) earnings of $0.60 per share, in-line with the FactSet Consensus of $0.60; revenues rose 3.6% year/year to $47.38 bln vs the $42.45 bln FactSet Consensus.bp delivered underlying replacement cost profit of $7.5 bln in 2025 and operating cash flow of $24.5 bln despite weaker oil prices.Co posted record operational performance, with upstream plant reliability of 96.1%, refining availability of 96.3%, seven major project start-ups, and reserves replacement ratio rising to 90%.\n• bp delivered underlying replacement cost profit of $7.5 bln in 2025 and operating cash flow of $24.5 bln despite weaker oil prices.\n• Co posted record operational performance, with upstream plant reliability of 96.1%, refining availability of 96.3%, seven major project start-ups, and reserves replacement ratio rising to 90%.\n• bp suspends share buyback and redirects excess cash to balance sheetCo expects more than $11 bln of proceeds from completed and announced divestments, including the sale of a 65% stake in Castrol for about $6 bln.Co suspended its share buyback and will fully allocate excess cash toward accelerating balance sheet strengthening.Co reaffirmed its capital framework, targeting a resilient dividend growing at least 4% annually and declared a Q4 dividend of 8.320 cents per ordinary share.\n• Co expects more than $11 bln of proceeds from completed and announced divestments, including the sale of a 65% stake in Castrol for about $6 bln.\n• Co suspended its share buyback and will fully allocate excess cash toward accelerating balance sheet strengthening.\n• Co reaffirmed its capital framework, targeting a resilient dividend growing at least 4% annually and declared a Q4 dividend of 8.320 cents per ordinary share."},{"time":"05:02","ticker":"EVTL","headline":"Vertical Aerospace Group explores Saudi manufacturing and deployment pathway","body":"• Vertical Aerospace signed a non-binding MoU with AHQ Group and the Saudi National Industrial Development Centre to assess advanced air mobility manufacturing, operations, and investment opportunities in Saudi Arabia.Co will evaluate in-country eVTOL manufacturing, commercial deployment, and incentive structures aligned with Saudi Arabia's Vision 2030 industrial strategy.The collaboration positions Saudi Arabia as a potential regional hub for electric aircraft, battery systems, and AAM services, with demand potential exceeding 1,000 aircraft.The MoU supports Co's certification roadmap and long-term global scale-up strategy but does not include binding investment commitments or timelines.\n• Co will evaluate in-country eVTOL manufacturing, commercial deployment, and incentive structures aligned with Saudi Arabia's Vision 2030 industrial strategy.\n• The collaboration positions Saudi Arabia as a potential regional hub for electric aircraft, battery systems, and AAM services, with demand potential exceeding 1,000 aircraft.\n• The MoU supports Co's certification roadmap and long-term global scale-up strategy but does not include binding investment commitments or timelines."},{"time":"05:00","ticker":"FSM","headline":"Fortuna Silver Mines advances Diamba Sud toward development decision","body":"• Fortuna Mining Corp. submitted an exploitation permit application for the Diamba Sud Gold Project to Senegal's Ministry of Energy, Petroleum, and Mines on February 4, 2026.Co continues early works and detailed engineering to de-risk critical path activities ahead of a feasibility study.Co plans to publish an updated Mineral Resource estimate by month-end, which will underpin Mineral Reserves and the feasibility study.Co targets a potential construction decision in mid-2026, following robust project economics outlined in the October 2025 preliminary economic assessment.\n• Co continues early works and detailed engineering to de-risk critical path activities ahead of a feasibility study.\n• Co plans to publish an updated Mineral Resource estimate by month-end, which will underpin Mineral Reserves and the feasibility study.\n• Co targets a potential construction decision in mid-2026, following robust project economics outlined in the October 2025 preliminary economic assessment."},{"time":"04:58","ticker":"WIRES","headline":"On The Wires","body":"• Walker & Dunlop (WD) announced today that it has arranged a total of $371,500,000 in financing to facilitate the development of The Nashville EDITION Hotel & Residences. The luxury hotel and residences are planned for the heart of Nashville's highly sought-after Gulch neighborhood.\n• STMicroelectronics (STM) announced the Stellar P3E, the first automotive microcontroller with built-in AI acceleration for automotive edge intelligence. Designed for future software-defined vehicles, the Stellar P3E simplifies multi-function integration for X-in-1 Electronic Control Units that reduce system cost, weight, and complexity.\n• Square (XYZ) announced the UK launch of Square AI, a free, conversational AI assistant built directly into the Square platform to help businesses of all sizes make clearer, faster decisions using their own business data. The launch follows new research commissioned by Square, which shows that while more than half (53%) of UK SMEs have used AI in their business, only 30% use it regularly. This low level of adoption is leaving many businesses experimenting without seeing value, or not yet taking advantage of AI at all.\n• InterDigital, Inc. (IDCC) announced the establishment of the Haptic Excellence Center. The collaborative venture establishes a center of excellence dedicated to foster the innovation, education, implementation, and promotion of haptic technology for enhanced media experiences. Alongside audio and video, haptics is now a first order media type as digital devices equipped with haptic technology have become more ubiquitous. According to the Futuresource and InterDigital white paper \"Haptics: The next modality in immersive entertainment,\" there were roughly 4.1 billion haptic-enabled consumer devices in use at the end of 2024, and projections that 53% of consumer devices will be haptic enabled by 2028."},{"time":"04:56","ticker":"CSCO","headline":"Cisco broadens AgenticOps, security, and AI networking platform","body":"• Cisco announced new AgenticOps capabilities across networking, security, and observability, advancing its agent-first IT operating model for autonomous operations with built-in oversight.Co expanded its security portfolio to support agentic AI adoption, adding protections for autonomous agents, governance over agent interactions, and resilient, cryptographically secured connectivity across hybrid environments.Co unveiled the Silicon One G300, a 102.4 Tbps switching chip designed for large-scale AI clusters, forming the backbone of new Cisco N9000 and 8000 data center systems.Co enhanced Nexus One to simplify operation of AI networks across on-premises and cloud environments, aiming to reduce complexity and improve efficiency as customers scale AI infrastructure.\n• Co expanded its security portfolio to support agentic AI adoption, adding protections for autonomous agents, governance over agent interactions, and resilient, cryptographically secured connectivity across hybrid environments.\n• Co unveiled the Silicon One G300, a 102.4 Tbps switching chip designed for large-scale AI clusters, forming the backbone of new Cisco N9000 and 8000 data center systems.\n• Co enhanced Nexus One to simplify operation of AI networks across on-premises and cloud environments, aiming to reduce complexity and improve efficiency as customers scale AI infrastructure."},{"time":"04:54","ticker":"ORCL","headline":"Oracle expands Fusion Cloud with embedded AI agents across CX and supply chain","body":"• Oracle announced new role-based AI agents embedded in Oracle Fusion Cloud Applications to support customer experience, supply chain, and manufacturing workflows.Co's CX-focused AI agents are integrated into marketing, sales, and service processes to analyze unified data, automate tasks, and deliver predictive insights at scale.Co also introduced AI agents across planning, procurement, manufacturing, maintenance, and logistics to automate end-to-end supply chain workflows and accelerate decision-making.Co added new Oracle Fusion Cloud SCM capabilities for process manufacturing, enabling real-time production visibility and improved regulatory compliance through unified management of formulas, materials, and batch execution.\n• Co's CX-focused AI agents are integrated into marketing, sales, and service processes to analyze unified data, automate tasks, and deliver predictive insights at scale.\n• Co also introduced AI agents across planning, procurement, manufacturing, maintenance, and logistics to automate end-to-end supply chain workflows and accelerate decision-making.\n• Co added new Oracle Fusion Cloud SCM capabilities for process manufacturing, enabling real-time production visibility and improved regulatory compliance through unified management of formulas, materials, and batch execution."},{"time":"04:52","ticker":"GSK","headline":"GlaxoSmithKline advances RSV vaccine toward first adult approval in China","body":"• GSK plc announced that China's Center for Drug Evaluation accepted Arexvy for regulatory review to prevent RSV-related lower respiratory tract disease in adults aged 60 and older.Co is positioned to become the first approved RSV vaccine in China for this age group, where RSV affects more than 6 mln people annually.Co's submission is supported by Phase III China trial data showing positive safety and immunogenicity results with all primary endpoints met.Co expects a regulatory decision in 2027, reflecting standard review timelines in China.\n• Co is positioned to become the first approved RSV vaccine in China for this age group, where RSV affects more than 6 mln people annually.\n• Co's submission is supported by Phase III China trial data showing positive safety and immunogenicity results with all primary endpoints met.\n• Co expects a regulatory decision in 2027, reflecting standard review timelines in China."},{"time":"04:50","ticker":"TSM","headline":"Taiwan Semiconductor Manufacturing reports Jan revs increased 36.8% yr/yr","body":"• Co announced its net revenue for January 2026: On a consolidated basis, revenue for January 2026 was approximately NT$401.26 billion, an increase of 19.8% from December 2025 and an increase of 36.8% from January 2025."},{"time":"04:49","ticker":"AZN","headline":"AstraZeneca beats by $0.01, reports revs in-line","body":"• Reports Q4 (Dec) earnings of $2.12 per share, $0.01 better than the FactSet Consensus of $2.11; revenues rose 4.1% year/year to $15.5 bln vs the $15.46 bln FactSet Consensus.Second interim dividend declared of $2.17 per share (159.5 pence, 19.49 SEK). Total dividend declared for FY 2025 increased by 3% to $3.20 per share\n• Second interim dividend declared of $2.17 per share (159.5 pence, 19.49 SEK). Total dividend declared for FY 2025 increased by 3% to $3.20 per share\n• OutlookTotal Revenue is expected to increase by a mid-to-high single-digit percentageCore EPS is expected to increase by a low double-digit percentage\n• Total Revenue is expected to increase by a mid-to-high single-digit percentage\n• Core EPS is expected to increase by a low double-digit percentage"},{"time":"04:46","ticker":"ASX","headline":"ASE Technology reports January revs increased 21.3% yr/yr to ~NT$59.99 bln","body":""},{"time":"04:46","ticker":"UBER","headline":"Uber: Baidu (BIDU) expands Apollo Go overseas with autonomous Uber launch in Dubai","body":"• Baidu Inc. will deploy its Apollo Go autonomous ride-hailing service on the Uber platform in Dubai, in partnership with Uber Technologies and Dubai's Roads and Transport Authority.Co plans to launch fully driverless rides within the Jumeirah area in the coming month, with expansion subject to regulatory approvals and operational performance.Co is positioned to leverage Uber's consumer platform while supporting Dubai's target for 25% of all transportation trips to be autonomous by 2030.Co highlighted Apollo Go's scale, with more than 240 mln autonomous kilometers logged and over 17 mln cumulative rides completed globally.\n• Co plans to launch fully driverless rides within the Jumeirah area in the coming month, with expansion subject to regulatory approvals and operational performance.\n• Co is positioned to leverage Uber's consumer platform while supporting Dubai's target for 25% of all transportation trips to be autonomous by 2030.\n• Co highlighted Apollo Go's scale, with more than 240 mln autonomous kilometers logged and over 17 mln cumulative rides completed globally."},{"time":"04:28","ticker":"AVA","headline":"Avista raises dividend","body":"• Co's board of directors has declared a quarterly dividend of $0.4925 per share on the company's common stock, yielding an annualized dividend of $1.97. The common stock dividend is payable March 13, 2026, to shareholders of record at the close of business on February 25, 2026.\n• This is up from annual rate of $1.97 per share."},{"time":"04:27","ticker":"CE","headline":"Celanese raises acetic acid, VAM and derivative prices across Western Hemisphere","body":"• Celanese Corporation announced price increases for acetic acid, vinyl acetate monomer, and related derivatives in the Western Hemisphere, effective immediately or as contracts allow.Co increased acetic acid prices by $50/MT in the U.S./Canada and Mexico/South America and by 50/MT in EMEA.Co raised vinyl acetate monomer prices by $100/MT in the Americas and 100/MT in EMEA, representing the largest adjustment in the slate.Co will implement derivative product price increases on a customer-by-customer basis, reflecting product-specific exposure and contract structures.\n• Co increased acetic acid prices by $50/MT in the U.S./Canada and Mexico/South America and by 50/MT in EMEA.\n• Co raised vinyl acetate monomer prices by $100/MT in the Americas and 100/MT in EMEA, representing the largest adjustment in the slate.\n• Co will implement derivative product price increases on a customer-by-customer basis, reflecting product-specific exposure and contract structures."},{"time":"04:25","ticker":"SVM","headline":"Silvercorp Metals reports Q3 results","body":"VANCOUVER, BC, Feb. 9, 2026 /PRNewswire/ - Silvercorp Metals Inc. (\"Silvercorp\" or the \"Company\") (TSX: SVM) (NYSE American: SVM) reported its financial and operating results for the three months ended December 31, 2025 (\"Q3 Fiscal 2026\"). All amounts are expressed in US dollars, and figures may not add due to rounding.Click here for full release."},{"time":"04:22","ticker":"CCSI","headline":"Consensus Cloud Solutions beats by $0.11; beats on revs; sees Q1, FY26 EPS and revs in-line","body":"• Reports Q4 EPS of $1.41 vs $1.30 FactSet consensus; revs of $87.1 mln vs $86.6 mln consensus\n• OutlookQ1 Co sees Q1 EPS of $1.36-1.46 vs 1.38 consensusCo sees Q1 revs of $85.4-89.4 mln vs 87.3 mln consensusFY26Co sees FY26 EPS of $5.55-5.95 vs 5.62 consensusCo sees FY26 revs of $350.0-357.0 mln vs $352.6 mln consensus\n• Q1 Co sees Q1 EPS of $1.36-1.46 vs 1.38 consensusCo sees Q1 revs of $85.4-89.4 mln vs 87.3 mln consensus\n• Co sees Q1 EPS of $1.36-1.46 vs 1.38 consensus\n• Co sees Q1 revs of $85.4-89.4 mln vs 87.3 mln consensus\n• FY26Co sees FY26 EPS of $5.55-5.95 vs 5.62 consensusCo sees FY26 revs of $350.0-357.0 mln vs $352.6 mln consensus\n• Co sees FY26 EPS of $5.55-5.95 vs 5.62 consensus\n• Co sees FY26 revs of $350.0-357.0 mln vs $352.6 mln consensus"},{"time":"04:16","ticker":"SLP","headline":"Simulations Plus extends FDA and NIEHS research collaborations on computational safety models","body":"• Simulations Plus announced extensions of separate research collaborations with the U.S. Food and Drug Administration and the National Institute of Environmental Health Sciences.Co will continue supporting federal research into non-animal, computational, and AI-driven methodologies for food, chemical, and environmental safety assessments.The FDA collaboration expands work on AI-based chemical safety models, supported by new federal funding and access to curated toxicology datasets for validation and benchmarking.The NIEHS extension continues applying Simulations Plus' software to environmental exposure research, aligned with national efforts to modernize chemical safety evaluation.\n• Co will continue supporting federal research into non-animal, computational, and AI-driven methodologies for food, chemical, and environmental safety assessments.\n• The FDA collaboration expands work on AI-based chemical safety models, supported by new federal funding and access to curated toxicology datasets for validation and benchmarking.\n• The NIEHS extension continues applying Simulations Plus' software to environmental exposure research, aligned with national efforts to modernize chemical safety evaluation."},{"time":"04:11","ticker":"ELVR","headline":"Elevra Lithium outlines potential Canadian offtake for spodumene concentrate with supply agreement with Mangrove Lithium","body":"• Elevra Lithium Limited signed a non-binding memorandum of understanding with Mangrove Lithium to supply up to 144,000 tonnes per year of spodumene concentrate from North American Lithium, subject to a future binding agreement.Co plans for the proposed offtake to run for five years starting in 2028, ramping to full volume by 2030 and representing about 46% of estimated sales volumes.The framework includes market-linked pricing with floor and ceiling mechanisms, aiming to support positive cash flow across lithium price cycles.The arrangement is contingent on Mangrove making a final investment decision by June 2027 for a Canadian lithium conversion facility, positioning the deal as optional upside rather than committed revenue.\n• Co plans for the proposed offtake to run for five years starting in 2028, ramping to full volume by 2030 and representing about 46% of estimated sales volumes.\n• The framework includes market-linked pricing with floor and ceiling mechanisms, aiming to support positive cash flow across lithium price cycles.\n• The arrangement is contingent on Mangrove making a final investment decision by June 2027 for a Canadian lithium conversion facility, positioning the deal as optional upside rather than committed revenue."},{"time":"04:05","ticker":"DC","headline":"Dakota Gold Corp. prices offering of 12,336,000 shares of its common stock for gross proceeds of $75 mln","body":""},{"time":"04:03","ticker":"TAK","headline":"Takeda Pharma moves closer to first orexin-based treatment for narcolepsy type 1","body":"• Takeda Pharmaceutical Company received FDA acceptance and Priority Review for the New Drug Application for oveporexton (TAK-861) for narcolepsy type 1, with a PDUFA action date set for Q3 2026.Co is seeking approval for what could become the first orexin receptor 2 agonist therapy designed to address the underlying orexin deficiency driving narcolepsy type 1, rather than only managing symptoms.Phase 3 data showed statistically significant and clinically meaningful improvements across excessive daytime sleepiness, cataplexy, attention, and quality of life, with a generally consistent safety profile.Takeda expects no material impact on its FY2025/26 consolidated forecast, positioning the potential approval as a pipeline catalyst rather than a near-term financial driver.\n• Co is seeking approval for what could become the first orexin receptor 2 agonist therapy designed to address the underlying orexin deficiency driving narcolepsy type 1, rather than only managing symptoms.\n• Phase 3 data showed statistically significant and clinically meaningful improvements across excessive daytime sleepiness, cataplexy, attention, and quality of life, with a generally consistent safety profile.\n• Takeda expects no material impact on its FY2025/26 consolidated forecast, positioning the potential approval as a pipeline catalyst rather than a near-term financial driver."}],"fetchedAt":1770750318717},"savedAt":1770750318718}