{"data":{"updated":"2/13/2026, 1:42:06 PM","entries":[{"time":"09:55","ticker":"FIGR","headline":"Figure Technology Solutions sees Q4 revs above consensus","body":"• Co issues upside guidance for Q4 (Dec), sees Q4 (Dec) revs of $158-162 mln vs. $154.21 mln FactSet Consensus; Adjusted EBITDA of $80.0 to $83.0 million.\n• \"We are closing the year with strong fourth quarter results, reflecting growing momentum for Figure. We achieved triple-digit year-over-year growth in Consumer Loan Marketplace volume, increased adoption of Figure Connect, and saw expanding activity within our blockchain ecosystem, reinforcing the diversity and scalability of our model.\n• Looking ahead, we remain focused on expanding our partner network, deepening our marketplace liquidity, and advancing our blockchain-native infrastructure. This quarter's strong results reflect the meaningful progress we've already made in modernizing capital markets and position us to further accelerate that transformation.\""},{"time":"09:42","ticker":"RDDT","headline":"Reddit opens +4% following notable Director insider buy - bought 50,500 shares of Class A Common Stock at $139.11 - $150.00 worth approximately $7.5 mln (transaction dates 2/10-2/11)","body":""},{"time":"09:37","ticker":"GENI","headline":"Genius Sports announced management team and Board of Directors, including Co-Founder/CEO Mark Locke and Chairman Kenneth Kay, together with the Legend Founder, purchased approximately 1.4 mln shares during the week ended February 13, 2026.","body":""},{"time":"09:26","ticker":"ELAN","headline":"Elanco Animal Health announces updates to Board of Directors","body":"INDIANAPOLIS, Feb. 13, 2026 /PRNewswire/ -- Elanco Animal Health Incorporated (NYSE: ELAN) today announced updates to its Board of Directors. R. David Hoover and Deborah Kochevar will not stand for re-election at the conclusion of their terms at the 2026 Annual Meeting of Shareholders in May.Click here for full release."},{"time":"09:16","ticker":"CPK","headline":"Chesapeake Utilities and The Sussex County Vocational Technical School District announce plans to provide natural gas service to the new Sussex Technical High School campus currently under construction in Sussex County, Delaware","body":"• The new campus represents the largest school construction initiative in Delaware history, with an estimated cost of approximately $249 million. Construction is underway on a new 400,000+-square-foot, three-story academic facility adjacent to the existing campus.\n• The new building will increase student capacity from approximately 1,375 to 1,800 high school students and 3500+ Adult Education students, with room for future expansion. Since breaking ground in October 2024, the project has progressed toward a planned opening in September 2027."},{"time":"09:07","ticker":"WIRES","headline":"On The Wires","body":"• Aurora Mobile Limited (JG) announces that its enterprise-grade AI agent platform, GPTBots.ai, has integrated the groundbreaking GLM-5 series model. This integration empowers enterprise users with unprecedented levels of AI performance, reliability, and real-world productivity-delivered instantly through the GPTBots.ai platform.\n• Intercontinental Exchange (ICE) announces that ICE's interest rate derivatives markets hit record open interest of 42.3 million contracts on February 11, 2026, up 45% year-over-year, as ICE's total OI across its futures and options markets hit a record 116.5 million.\n• Rumble Inc. (RUM) announces that Rumble Shorts has been approved by Google (GOOG/GOOGL) Play. Android users are now able to download or update their Rumble apps to experience Rumble Shorts.\n• Granite (GVA) announces that the Nevada Department of Transportation has selected the company to deliver preconstruction services for the future Interstate 80 (I-80) East Widening Project along the 13-mile corridor between Vista Boulevard and USA Parkway in Washoe County. The approximately $19 million preconstruction services agreement represents a major milestone toward the delivery of the anticipated $475 million construction phase, funded through a combination of $275 million from the USDOT INFRA Grant program and additional support from Nevada state and federal sources and was included in Granite's 2025 year-end CAP.\n• Kratos Defense & Security Solutions (KTOS) announces continued support of Champion Tire & Wheel's NASCAR logistics for the 2026 season. This will be further advancement of Kratos' automated truck platooning and logistics automation technologies, demonstrating scalable autonomy in demanding, real-world operations."},{"time":"09:05","ticker":"SBSW","headline":"Sibanye-Stillwater welcomes the announcement of a preliminary affirmative determination by the United States Department of Commerce regarding the antidumping duty investigation into imports of unwrought palladium from Russia","body":""},{"time":"09:04","ticker":"WRAPX","headline":"S&amp;P futures vs fair value: +10.00. Nasdaq futures vs fair value: +45.00.","body":"Equity futures now point to a modestly higher opening this morning following the January CPI release. Total CPI increased 0.2% month-over-month in January (Briefing.com consensus: 0.3%) and was up 2.4% year-over-year, versus 2.7% for the 12 months ending in December. Core CPI, which excludes food and energy, increased 0.3% month-over-month (Briefing.com consensus: 0.3%) and was up 2.5% year-over-year, versus 2.6% for the 12 months ending in December. The key takeaway from the report is that it showed some encouraging disinflation on a year-over-year basis, which the market will perceive as an opening for the Fed to consider additional rate cuts even with GDP growth running above potential."},{"time":"09:03","ticker":"SNCR","headline":"Synchronoss Tech announces the completion of its acquisition by Lumine Group Inc. (LMGIF), through one of its wholly-owned subsidiaries in an all-cash transaction that values the Company at an implied equity value of ~$116.4 mln and an enterprise value of ~$258.4 mln","body":"• With the completion of the acquisition, Synchronoss's common stock will cease trading and the Company will no longer be listed on the Nasdaq Stock Market.\n• Synchronoss stockholders voted to approve the transaction at the Company's Special Meeting of Stockholders on February 12, 2026."},{"time":"08:57","ticker":"WRAPX","headline":"S&amp;P futures vs fair value: +9.00. Nasdaq futures vs fair value: +44.00.","body":"• In economic data: China's January New Loans CNY4.71 trln (expected CNY5.00 trln; last CNY910 bln), January Outstanding Loan Growth 6.1% yr/yr (expected 6.2%; last 6.4%), and January total social financing CNY7.22 trln (expected CNY7.05 trln; last CNY2.21 trln). January House Prices -3.1% yr/yr (last -2.7%) South Korea's January Import Price Index -1.2% yr/yr (last 0.5%) and Export Price Index 7.8% yr/yr (last 5.0%) New Zealand's January Business PMI 55.2 (last 56.1). December External Migration & Visitors 7.0% yr/yr (last 8.2%). Q1 Inflation Expectations 2.4% (last 2.3%)\n• China's January New Loans CNY4.71 trln (expected CNY5.00 trln; last CNY910 bln), January Outstanding Loan Growth 6.1% yr/yr (expected 6.2%; last 6.4%), and January total social financing CNY7.22 trln (expected CNY7.05 trln; last CNY2.21 trln). January House Prices -3.1% yr/yr (last -2.7%)\n• South Korea's January Import Price Index -1.2% yr/yr (last 0.5%) and Export Price Index 7.8% yr/yr (last 5.0%)\n• New Zealand's January Business PMI 55.2 (last 56.1). December External Migration & Visitors 7.0% yr/yr (last 8.2%). Q1 Inflation Expectations 2.4% (last 2.3%)\n• Japan's Nikkei: -1.2%\n• Hong Kong's Hang Seng: -1.7%\n• China's Shanghai Composite: -1.3%\n• India's Sensex: -1.3%\n• South Korea's Kospi: -0.3%\n• Australia's ASX All Ordinaries: -1.5%\n• In economic data: Eurozone's Q4 GDP 0.3% qtr/qtr, as expected (last 0.3%); 1.3% yr/yr, as expected (last 1.4%). Q4 Employment Change 0.2% qtr/qtr (expected 0.1%; last 0.2%); 0.7% yr/yr (expected 0.6%; last 0.6%). December trade surplus EUR12.6 bln (expected EUR11.8 bln; last EUR9.3 bln) Germany's January WPI 0.9% m/m (expected 0.1%; last -0.2%); 1.2% yr/yr (last 1.2%) Spain's January CPI -0.4% m/m, as expected (last 0.3%); 2.3% yr/yr (expected 2.4%; last 2.9%). January Core CPI 2.6% yr/yr, as expected (last 2.6%) Swiss January CPI -0.1% m/m (expected 0.0%; last 0.0%); 0.1% yr/yr, as expected (last 0.1%)\n• Eurozone's Q4 GDP 0.3% qtr/qtr, as expected (last 0.3%); 1.3% yr/yr, as expected (last 1.4%). Q4 Employment Change 0.2% qtr/qtr (expected 0.1%; last 0.2%); 0.7% yr/yr (expected 0.6%; last 0.6%). December trade surplus EUR12.6 bln (expected EUR11.8 bln; last EUR9.3 bln)\n• Germany's January WPI 0.9% m/m (expected 0.1%; last -0.2%); 1.2% yr/yr (last 1.2%)\n• Spain's January CPI -0.4% m/m, as expected (last 0.3%); 2.3% yr/yr (expected 2.4%; last 2.9%). January Core CPI 2.6% yr/yr, as expected (last 2.6%)\n• Swiss January CPI -0.1% m/m (expected 0.0%; last 0.0%); 0.1% yr/yr, as expected (last 0.1%)\n• STOXX Europe 600: -0.2%\n• Germany's DAX: +0.3%\n• U.K.'s FTSE 100: +0.1%\n• France's CAC 40: -0.3%\n• Italy's FTSE MIB: -1.5%\n• Spain's IBEX 35: -1.1%"},{"time":"08:48","ticker":"SCHW","headline":"Charles Schwab reports monthly activity highlights for the month of January 2026; Core net new assets brought to the company totaled $27.8 billion","body":"• Total client assets equaled $12.15 trillion as of month-end January, up 18% from January 2025 and up 2% compared to December 2025.\n• New brokerage accounts opened during the month totaled 476,000, an increase of 10% versus January 2025.\n• Driven by increased investor engagement in equities, January daily average trades accelerated to 9.5 million. Additionally, margin loan balances rose 4% from year-end levels to finish the month at $116.3 billion.\n• Transactional sweep cash decreased by $20.4 billion to end January at $433.3 billion. This month-over-month decrease reflects expected January seasonality."},{"time":"08:47","ticker":"CNDT","headline":"Conduent collaborates with Alabama to introduce chip-enabled SNAP cards to prevent EBT fraud","body":"Conduent Incorporated (Nasdaq: CNDT), a global technology-driven business solutions and services company, today announced its collaboration with the Alabama Department of Human Resources (DHR) to introduce chip-enabled EBT cards designed to help prevent fraud. The new cards, now mailed to EBT cardholders across the state, are expected to significantly enhance account security for beneficiaries, including those in the Supplemental Nutrition Assistance Program (SNAP) and the Temporary Assistance for Needy Families (TANF) program.Click here for full release."},{"time":"08:37","ticker":"CX","headline":"CEMEX S.A.: SaverOne (SVRE) expands global collaboration with Cemex","body":"• SaverOne announced the completion of the installation of its Driver Distraction Prevention System (DDPS) in Cemex Croatia, the fifth country where Cemex have assimilated SaverOne's safety system, joining Spain, Germany, the Czech Republic and Israel.\n• This milestone concludes a key phase in SaverOne's strategy to scale from localized deployments within Cemex Europe toward a broader global rollout. SaverOne and Cemex share a long-term vision to build on the successful implementations to date and advance to a new phase of cooperation focused on expanding installations across additional Cemex regions, as well as other global work-truck fleets. The objective of this next phase is to support the adoption of a consistent and comprehensive safety culture throughout Cemex's worldwide operations."},{"time":"08:36","ticker":"ONDS","headline":"Ondas Inc. secures new multi-million dollar european order for Iron Drone Raider","body":"• The co's subsidiary Airobotics has received a new multi-million dollar order from a major European customer in a NATO country for its Iron Drone Raider counter-UAS system.\n• This follows Ondas' operational deployment of the system at a major European international airport, part of a separate contract from the same customer."},{"time":"08:33","ticker":"QUAD","headline":"Quad/Graphics increases quarterly cash dividend 33% to $0.10/share from $0.075/share","body":""},{"time":"08:33","ticker":"WRAPX","headline":"S&amp;P futures vs fair value: -3.00. Nasdaq futures vs fair value: -27.00.","body":"The S&P 500 futures currently trade three points below fair value. Just released, total CPI was up 0.2% month-over-month in January (Briefing.com consensus 0.3%) after increasing 0.3% in December. Core CPI, which excludes food and energy, was up 0.3% (Briefing.com consensus 0.3%) after increasing 0.2% in December. On a year-over-year basis, total CPI was up 2.4% versus 2.7% in December, while core CPI was up 2.5% versus 2.6% in December."},{"time":"08:31","ticker":"LVS","headline":"Las Vegas Sands appoints Patrick Dumont as Chairman and Chief Executive Officer, effective March 1","body":"• Mr. Dumont will succeed Robert G. Goldstein, who becomes a senior advisor to the company through March 2028.\n• Sands' board of directors had previously indicated Mr. Dumont would be the likely successor to Mr. Goldstein. Mr. Dumont was also appointed chairman of Sands China Ltd., the company's Hong Kong-listed subsidiary."},{"time":"08:30","ticker":"ECONX","headline":"January Core CPI 0.3% vs. 0.3% Briefing.com consensus; prior 0.2%","body":""},{"time":"08:30","ticker":"ECONX","headline":"January CPI 0.2% vs. 0.3% Briefing.com consensus; prior 0.3%","body":""},{"time":"08:10","ticker":"CBL","headline":"CBL Properties Reports Outstanding Results for Fourth Quarter and Full-Year 2025","body":"CBL Properties (NYSE: CBL) announced results for the fourth quarter and year ended December 31, 2025. Results of operations as reported in the consolidated financial statements for these periods are prepared in accordance with GAAP. A description of each supplemental non-GAAP financial measure and the related reconciliation to the comparable GAAP financial measure is located at the end of this news release.Click here for full release."},{"time":"08:05","ticker":"CTOR","headline":"Citius Oncology, Inc. announces first reported revenue following successful launch of LYMPHIR","body":"CRANFORD, N.J., Feb. 13, 2026 /PRNewswire/ -- Citius Oncology, Inc. (\"Citius Oncology\") (Nasdaq: CTOR), the oncology-focused subsidiary of Citius Pharmaceuticals, Inc. (\"Citius Pharma\") (Nasdaq: CTXR), today reported financial results for the fiscal first quarter ended December 31, 2025, and provided a business update.Click here for full release."},{"time":"08:04","ticker":"ANRO","headline":"Alto Neuroscience announces completion of enrollment in Phase 2 proof-of-concept study of ALTO-101 in cognitive impairment associated with schizophrenia","body":"Alto Neuroscience Announces Completion of Enrollment in Phase 2 Proof-of-Concept Study of ALTO-101 in Cognitive Impairment Associated with SchizophreniaClick here for full release."},{"time":"08:03","ticker":"MDT","headline":"Medtronic announces U.S. Food and Drug Administration clearance of the Stealth AXiS surgical system, a next-generation platform that brings planning, navigation, and robotics together into a single, intelligent system for spine surgery","body":"The Stealth AXiS system is cleared for spine procedures in the United States, with an underlying architecture designed to support future cranial and ENT applications, pending 510(k) clearance. Built to support a wide range of surgeon preferences, clinical complexity, and care settings, the platform is designed for use across hospitals and ambulatory surgery centers without relying on multiple standalone technologies."},{"time":"08:03","ticker":"EHC","headline":"Encompass Health announces plans to build a 50-bed inpatient rehabilitation hospital in Flowood, Mississippi","body":"• The hospital will serve patients recovering from debilitating illnesses and injuries, including strokes and other neurological disorders, brain and spinal cord injuries, amputations and complex orthopedic conditions. In addition to 24-hour nursing care, the hospital will offer physical, occupational and speech therapies designed to help patients restore function and improve their quality of life.\n• Care will be provided by specialized nurses, therapists and physicians.\n• The hospital will feature private patient rooms, a spacious therapy gym with advanced rehabilitation technologies, an activities of daily living suite, an in-house dialysis suite, and a dining room, pharmacy and therapy courtyard. The hospital, expected to open in 2027."},{"time":"08:01","ticker":"BONDX","headline":"Overnight Treasury Market Summary","body":"• U.S. Treasuries are on track for a slightly higher start in most tenors ahead of the 8:30 ET release of January CPI (Briefing.com consensus 0.3%; prior 0.3%) and Core CPI (Briefing.com consensus 0.3%; prior 0.2%). Treasury futures followed yesterday's rally to fresh February highs in longer tenors with a slow overnight retreat that finally found some support after the start of the European session. Global equity markets have had a mostly lower showing to end the week while the news flow was limited. There was growing speculation that President Trump will extend the current trade terms with China when he meets with President Xi in April. There were also reports that tariffs on metals and aluminum goods could be reduced. Crude oil is deepening yesterday's retreat while the U.S. Dollar Index is up 0.1% at 97.06.\n• Yield Check: 2-yr: -2 bps to 3.45% 3-yr: -1 bp to 3.50% 5-yr: -1 bp to 3.66% 10-yr: UNCH at 4.10% 30-yr: +1 bp to 4.74%\n• 2-yr: -2 bps to 3.45%\n• 3-yr: -1 bp to 3.50%\n• 5-yr: -1 bp to 3.66%\n• 10-yr: UNCH at 4.10%\n• 30-yr: +1 bp to 4.74%\n• News: An adviser to Japan's Prime Minister Takaichi said that the Bank of Japan may forego a rate hike in March but is likely to raise rates later in the year. Officials from the U.S. and Taiwan formalized a trade deal. European Central Bank policymaker Kazaks said that the ECB is in a good position regarding rates while policymaker Nagel said that geopolitical \"rivalries\" could result in higher inflation. China's January New Loans reached CNY4.71 trln (expected CNY5.00 trln; last CNY910 bln), January outstanding loans grew 6.1% yr/yr (expected 6.2%; last 6.4%), and January total social financing reached CNY7.22 trln (expected CNY7.05 trln; last CYN2.21 trln). January House Prices were down 3.1% yr/yr (last -2.7%). South Korea's January Import Price Index was down 1.2% yr/yr (last 0.5%) while export price index was up 7.8% yr/yr (last 5.0%). New Zealand's January Business PMI hit 55.2 (last 56.1). December External Migration & Visitors rose 7.0% yr/yr (last 8.2%). Q1 Inflation Expectations accelerated to 2.4% from 2.3%. Eurozone's Q4 GDP expanded 0.3% qtr/qtr, as expected (last 0.3%), growing 1.3% yr/yr, as expected (last 1.4%). Q4 Employment increased by 0.2% qtr/qtr (expected 0.1%; last 0.2%), rising 0.7% yr/yr (expected 0.6%; last 0.6%). December trade surplus reached EUR12.6 bln (expected EUR11.8 bln; last EUR9.3 bln). Germany's January WPI was up 0.9% m/m (expected 0.1%; last -0.2%), rising 1.2% yr/yr (last 1.2%). Spain's January CPI was down 0.4% m/m, as expected (last 0.3%) but up 2.3% yr/yr (expected 2.4%; last 2.9%). January Core CPI was up 2.6% yr/yr, as expected (last 2.6%). Swiss January CPI was down 0.1% m/m (expected 0.0%; last 0.0%) but up 0.1% yr/yr, as expected (last 0.1%).\n• An adviser to Japan's Prime Minister Takaichi said that the Bank of Japan may forego a rate hike in March but is likely to raise rates later in the year.\n• Officials from the U.S. and Taiwan formalized a trade deal.\n• European Central Bank policymaker Kazaks said that the ECB is in a good position regarding rates while policymaker Nagel said that geopolitical \"rivalries\" could result in higher inflation.\n• China's January New Loans reached CNY4.71 trln (expected CNY5.00 trln; last CNY910 bln), January outstanding loans grew 6.1% yr/yr (expected 6.2%; last 6.4%), and January total social financing reached CNY7.22 trln (expected CNY7.05 trln; last CYN2.21 trln). January House Prices were down 3.1% yr/yr (last -2.7%).\n• South Korea's January Import Price Index was down 1.2% yr/yr (last 0.5%) while export price index was up 7.8% yr/yr (last 5.0%).\n• New Zealand's January Business PMI hit 55.2 (last 56.1). December External Migration & Visitors rose 7.0% yr/yr (last 8.2%). Q1 Inflation Expectations accelerated to 2.4% from 2.3%.\n• Eurozone's Q4 GDP expanded 0.3% qtr/qtr, as expected (last 0.3%), growing 1.3% yr/yr, as expected (last 1.4%). Q4 Employment increased by 0.2% qtr/qtr (expected 0.1%; last 0.2%), rising 0.7% yr/yr (expected 0.6%; last 0.6%). December trade surplus reached EUR12.6 bln (expected EUR11.8 bln; last EUR9.3 bln).\n• Germany's January WPI was up 0.9% m/m (expected 0.1%; last -0.2%), rising 1.2% yr/yr (last 1.2%).\n• Spain's January CPI was down 0.4% m/m, as expected (last 0.3%) but up 2.3% yr/yr (expected 2.4%; last 2.9%). January Core CPI was up 2.6% yr/yr, as expected (last 2.6%).\n• Swiss January CPI was down 0.1% m/m (expected 0.0%; last 0.0%) but up 0.1% yr/yr, as expected (last 0.1%).\n• Commodities: WTI Crude: -0.6% to $62.48/bbl Gold: +0.8% to $4986.90/ozt Copper: -0.8% to $5.738/lb\n• WTI Crude: -0.6% to $62.48/bbl\n• Gold: +0.8% to $4986.90/ozt\n• Copper: -0.8% to $5.738/lb\n• Currencies: EUR/USD: -0.1% to 1.1862 GBP/USD: -0.1% to 1.3606 USD/CNH: +0.2% to 6.9051 USD/JPY: +0.4% to 153.27\n• EUR/USD: -0.1% to 1.1862\n• GBP/USD: -0.1% to 1.3606\n• USD/CNH: +0.2% to 6.9051\n• USD/JPY: +0.4% to 153.27\n• Data out Today: 8:30 ET: January CPI (Briefing.com consensus 0.3%; prior 0.3%) and Core CPI (Briefing.com consensus 0.3%; prior 0.2%)\n• 8:30 ET: January CPI (Briefing.com consensus 0.3%; prior 0.3%) and Core CPI (Briefing.com consensus 0.3%; prior 0.2%)"},{"time":"08:00","ticker":"WRAPX","headline":"S&amp;P futures vs fair value: -14.00. Nasdaq futures vs fair value: -65.00.","body":"• Automakers are reducing electric vehicle capacity amid falling demand, according to The Wall Street Journal.\n• Airbnb (ABNB 122.21, +6.25, +5.4%) missed EPS expectations by $0.11, beat revenue expectations, and guided Q1 revenues above consensus. The company expects FY2026 growth to accelerate to at least low double digits.\n• Applied Materials (AMAT 363.84, +35.45, +10.8%) beat EPS expectations by $0.17 and beat revenue expectations. The company guided Q2 EPS and revenues above consensus.\n• Arista Networks (ANET 148.55, +13.43, +9.9%) beat EPS expectations by $0.06, beat revenue expectations, and guided Q1 revenues above consensus.\n• There was growing speculation that President Trump will extend the current trade terms with China when he meets with President Xi in April.\n• There were also reports that tariffs on metals and aluminum goods could be reduced.\n• On a somewhat related note, officials from the U.S. and Taiwan formalized a trade deal.\n• An adviser to Japan's Prime Minister Takaichi said that the Bank of Japan may forego a rate hike in March but is likely to raise rates later in the year.\n• China's January New Loans CNY4.71 trln (expected CNY5.00 trln; last CNY910 bln), January Outstanding Loan Growth 6.1% yr/yr (expected 6.2%; last 6.4%), and January total social financing CNY7.22 trln (expected CNY7.05 trln; last CNY2.21 trln). January House Prices -3.1% yr/yr (last -2.7%)\n• South Korea's January Import Price Index -1.2% yr/yr (last 0.5%) and Export Price Index 7.8% yr/yr (last 5.0%)\n• New Zealand's January Business PMI 55.2 (last 56.1). December External Migration & Visitors 7.0% yr/yr (last 8.2%). Q1 Inflation Expectations 2.4% (last 2.3%)\n• Military contractor Safran reported in-line results while L'Oreal missed growth expectations.\n• European Central Bank policymaker Kazaks said that the ECB is in a good position regarding rates while policymaker Nagel said that geopolitical \"rivalries\" could result in higher inflation.\n• Eurozone's Q4 GDP 0.3% qtr/qtr, as expected (last 0.3%); 1.3% yr/yr, as expected (last 1.4%). Q4 Employment Change 0.2% qtr/qtr (expected 0.1%; last 0.2%); 0.7% yr/yr (expected 0.6%; last 0.6%). December trade surplus EUR12.6 bln (expected EUR11.8 bln; last EUR9.3 bln)\n• Germany's January WPI 0.9% m/m (expected 0.1%; last -0.2%); 1.2% yr/yr (last 1.2%)\n• Spain's January CPI -0.4% m/m, as expected (last 0.3%); 2.3% yr/yr (expected 2.4%; last 2.9%). January Core CPI 2.6% yr/yr, as expected (last 2.6%)\n• Swiss January CPI -0.1% m/m (expected 0.0%; last 0.0%); 0.1% yr/yr, as expected (last 0.1%)"},{"time":"07:45","ticker":"JACK","headline":"Jack In The Box: Biglari Capital Corp. issued a statement in response to JACK's latest shareholder letter","body":"• Biglari Capital Corp., the largest shareholder of Jack in the Box Inc. (JACK), with a 9.86% ownership stake.\n• \"David Goebel's 17 Years of Failure Cannot Be Disguised as \"Expertise\"David Goebel has had 17 years to prove that his restaurant experience benefits JACK's shareholders. Instead, shareholders have lost approximately $1.8 billion - or 80% of the company's value - in the last five years alone. JACK now claims Mr. Goebel is \"one of the most qualified franchise executives\" in the industry. If that is true, why has he consistently failed for 17 years? What will he do differently now that he could not do in the previous 17 years as a director or in the last five years as chairman of the board?\n• David Goebel has had 17 years to prove that his restaurant experience benefits JACK's shareholders. Instead, shareholders have lost approximately $1.8 billion - or 80% of the company's value - in the last five years alone.\n• JACK now claims Mr. Goebel is \"one of the most qualified franchise executives\" in the industry. If that is true, why has he consistently failed for 17 years? What will he do differently now that he could not do in the previous 17 years as a director or in the last five years as chairman of the board?\n• Chairman Goebel's \"Expertise\" Has Been a Shield for EntrenchmentThe reality is that by repeatedly invoking his credentials as a restaurant expert, Mr. Goebel has maintained tight control over the Board and exerted significant influence on JACK's strategy. A Board largely comprising long-tenured directors with no restaurant expertise became heavily reliant on Mr. Goebel's advice - and the results speak for themselves:Failed Del Taco acquisitionLowest same-store sales (SSS) since the COVID pandemic Lowest adjusted EBITDA since the COVID pandemic Chronic leadership instability: three CEOs and eight CFOs in the last five years Entrenched governance: Long-tenured directors with no restaurant or turnaround experience continue to control all key Board committees.\n• The reality is that by repeatedly invoking his credentials as a restaurant expert, Mr. Goebel has maintained tight control over the Board and exerted significant influence on JACK's strategy. A Board largely comprising long-tenured directors with no restaurant expertise became heavily reliant on Mr. Goebel's advice - and the results speak for themselves:Failed Del Taco acquisitionLowest same-store sales (SSS) since the COVID pandemic Lowest adjusted EBITDA since the COVID pandemic Chronic leadership instability: three CEOs and eight CFOs in the last five years Entrenched governance: Long-tenured directors with no restaurant or turnaround experience continue to control all key Board committees.\n• Failed Del Taco acquisition\n• Lowest same-store sales (SSS) since the COVID pandemic\n• Lowest adjusted EBITDA since the COVID pandemic\n• Chronic leadership instability: three CEOs and eight CFOs in the last five years\n• Entrenched governance: Long-tenured directors with no restaurant or turnaround experience continue to control all key Board committees.\n• Relying on David Goebel's Outdated and Unproductive Experience Has Brought JACK to the BrinkJACK's latest shareholder letter confirms our view: Both the Board and management are beholden to Mr. Goebel's outdated experience at Applebee's - which he left nearly two decades ago - and his franchisee experience from almost three decades ago. Reliance on such dated expertise is precisely what has brought JACK to its current precarious position, where it has been forced to suspend dividends, close 150--200 stores, and restructure the business to remain solvent. This predicament is primarily the result of David Goebel's Board influence and poor decisions.\n• JACK's latest shareholder letter confirms our view: Both the Board and management are beholden to Mr. Goebel's outdated experience at Applebee's - which he left nearly two decades ago - and his franchisee experience from almost three decades ago. Reliance on such dated expertise is precisely what has brought JACK to its current precarious position, where it has been forced to suspend dividends, close 150--200 stores, and restructure the business to remain solvent. This predicament is primarily the result of David Goebel's Board influence and poor decisions.\n• We Can Conclude that David Goebel Lacks IntegrityIn addition to the chairman's 17-year failed record, Mr. Goebel has resorted to fabricating stories about Mr. Biglari, saying that he used \"abusive\" and \"threatening\" language. In fact, Mr. Biglari told Mr. Goebel that because of the company's poor performance, Mr. Biglari would in all likelihood launch a proxy contest, with Mr. Goebel as its likely target. The language of this statement was direct and factual. In addition to his lack of relevant restaurant turnaround experience, Mr. Goebel is apparently also unable to recognize the use of common metaphors. Mr. Biglari warned Mr. Goebel that proxy fights usually leave disputing parties bloodied, given their inherently contentious nature.\"\n• In addition to the chairman's 17-year failed record, Mr. Goebel has resorted to fabricating stories about Mr. Biglari, saying that he used \"abusive\" and \"threatening\" language. In fact, Mr. Biglari told Mr. Goebel that because of the company's poor performance, Mr. Biglari would in all likelihood launch a proxy contest, with Mr. Goebel as its likely target. The language of this statement was direct and factual. In addition to his lack of relevant restaurant turnaround experience, Mr. Goebel is apparently also unable to recognize the use of common metaphors. Mr. Biglari warned Mr. Goebel that proxy fights usually leave disputing parties bloodied, given their inherently contentious nature.\""},{"time":"07:33","ticker":"IRD","headline":"Opus Genetics entered into a securities purchase agreement for private placement of 7,374,632 shares of Series B Non-Voting Convertible Preferred Stock at $3.39 per share","body":"Opus Genetics intends to use the net proceeds to advance its gene therapy clinical programs, as well as for working capital and general corporate purposes. Including expected proceeds from the private placement and based on current operating plans, the Company expects its year-end 2025 pro forma cash balance of $70 million will fund operations into the first half of 2028, excluding any potential proceeds from callable warrants or future milestone payments."},{"time":"07:30","ticker":"SUMRX","headline":"European Markets Update: DAX +0.1%, FTSE UNCH, CAC -0.3%","body":"• In economic data: Eurozone's Q4 GDP 0.3% qtr/qtr, as expected (last 0.3%); 1.3% yr/yr, as expected (last 1.4%). Q4 Employment Change 0.2% qtr/qtr (expected 0.1%; last 0.2%); 0.7% yr/yr (expected 0.6%; last 0.6%). December trade surplus EUR12.6 bln (expected EUR11.8 bln; last EUR9.3 bln) Germany's January WPI 0.9% m/m (expected 0.1%; last -0.2%); 1.2% yr/yr (last 1.2%) Spain's January CPI -0.4% m/m, as expected (last 0.3%); 2.3% yr/yr (expected 2.4%; last 2.9%). January Core CPI 2.6% yr/yr, as expected (last 2.6%) Swiss January CPI -0.1% m/m (expected 0.0%; last 0.0%); 0.1% yr/yr, as expected (last 0.1%)\n• Eurozone's Q4 GDP 0.3% qtr/qtr, as expected (last 0.3%); 1.3% yr/yr, as expected (last 1.4%). Q4 Employment Change 0.2% qtr/qtr (expected 0.1%; last 0.2%); 0.7% yr/yr (expected 0.6%; last 0.6%). December trade surplus EUR12.6 bln (expected EUR11.8 bln; last EUR9.3 bln)\n• Germany's January WPI 0.9% m/m (expected 0.1%; last -0.2%); 1.2% yr/yr (last 1.2%)\n• Spain's January CPI -0.4% m/m, as expected (last 0.3%); 2.3% yr/yr (expected 2.4%; last 2.9%). January Core CPI 2.6% yr/yr, as expected (last 2.6%)\n• Swiss January CPI -0.1% m/m (expected 0.0%; last 0.0%); 0.1% yr/yr, as expected (last 0.1%)\n• STOXX Europe 600: -0.4% (-0.2% this week)\n• Germany's DAX: +0.1% (+0.5% this week)\n• U.K.'s FTSE 100: UNCH (+0.4% this week)\n• France's CAC 40: -0.3% (+0.5% this week)\n• Italy's FTSE MIB: -1.5% (-0.7% this week)\n• Spain's IBEX 35: -0.8% (-1.1% this week)\n• EUR/USD: -0.1% to 1.1860\n• GBP/USD: -0.1% to 1.3607\n• USD/CHF: UNCH at 0.7692"},{"time":"07:28","ticker":"SUMRX","headline":"Gapping up/Gapping down","body":"• CRSR +24.9% (also authorizes new $50 mln share repurchase program), RIVN +20.5%, ROKU +14.7%, CART +14%, BROS +12.8%, AAP +11.6%, AMAT +11.3%, ANET +11.2%, SPSC +10% (also names new CFO; increases buyback authorization by $200 mln), CPS +9.8%, LGCY +9.6%, MGA +9.5%, PCOR +8.6%, ABNB +5.8%, COIN +4.9%, HASI +4%, IR +4%, ATMU +3.7%, AEM +2.7% (also provides an update on 2025 exploration results and 2026 exploration plans), FROG +2.5%, TSLX +1.9%, MHK +1.9%, CCJ +1.8%, CVRX +1.1%\n• TPH +26.6% (to be acquired by Sumitomo Forestry in $4.5 bln cash deal)\n• SEI +10.7% (enters into a master equipment rental agreement with Hatchbo)\n• BAK +7% (says it does not have, and did not have in 2025, any material financial exposure to BBD)\n• NAMM +6.7% (begins dewatering at Redwing to advance restart plans)\n• EVMN +4.8% (prices offering of 4,494,279 shares of its common stock at $27.88 per share)\n• TII +3.6% (benefits as Commerce sets 160% duties on Chinese graphite)\n• CHCT +2.7% (increases dividend)\n• CCCX +2.5% (shareholders approve business combination with Infleqtion)\n• HIVE +1.4% (signs $30 mln AI cloud contracts to expand BUZZ HPC platform)\n• PINS -20.7%, COHU -18%, AENT -17.9%, DKNG -16.7%, NUS -14.6%, BIO -13.1%, CALY -12.8%, FBIN -12% (also names new CEO), RYAN -9.9% (also initiates restructuring), SXT -8%, WEN -8%, EXPE -6.3% (also increases dividend), KNSL -5.2%, YELP -4.6% (also announces agreement with OpenAI), CAE -4.4%, FLO -4.3% (also conducting a comprehensive review of operations), ELVA -4.1%, NWG -3.9%, TWLO -3.8%, BFAM -3.6%, GRVY -3.5%, WYNN -2.9%, TOST -1.8% (also increases share repurchase authorization by $500 mln), RARE -1.7%, PSA -1.4% (also CEO to retire; CFO to become new CEO; names new CFO; names new COO), PSA -1.4%, CRSP -1.3%, HCC -1.1%, AORT -1%\n• CHRS -14.9% (prices offering of 28.6 mln shares of common stock at $1.75 per share)\n• AMKR -5.8% (prices secondary offering of 10.0 mln shares of common stock at $48.75 per share)\n• SPNT -2.9% (to acquire World Nomads)\n• NCLH -2.2% (names new CEO, also provides Q4 guidance)\n• RKLB -1.4% (next launch is a dedicated mission on its HASTE rocket)\n• STZ -1.2% (names new CEO)"},{"time":"07:19","ticker":"CLRS","headline":"Clear Street Group has postponed its IPO, citing \"market conditions\"; Company was planning to offer 13.0 mln shares at $26-$28 per share","body":""},{"time":"07:17","ticker":"ASM","headline":"Avino Silver &amp; Gold filed a final short form base shelf prospectus","body":"• The Shelf Prospectus and Registration Statement will allow the Company to offer and issue common shares, warrants, subscription receipts, units, debt securities, or any combination of such securities (collectively, the \"Securities\") during the 37-month period that the Shelf Prospectus remains effective under the WKSI Regime (subject to compliance with certain requirements).\n• In accordance with the Companion Policy to NI 44-102, the Company is withdrawing its previously filed short form base shelf prospectus dated May 26, 2025 and will not distribute further securities pursuant the prospectus supplement dated November 25, 2025."},{"time":"07:17","ticker":"CIGI","headline":"Colliers misses by $0.11, reports revs in-line; Expects to deliver mid-teens growth in revenues, Adjusted EBITDA and Adjusted EPS during 2026","body":"• Reports Q4 (Dec) earnings of $2.34 per share, $0.11 worse than the FactSet Consensus of $2.45; revenues rose 7.0% year/year to $1.61 bln vs the $1.61 bln FactSet Consensus.\n• 2026 Outlook: The company anticipates continuing solid annual internal growth in 2026, along with the impact of several recently completed acquisitions and the recently announced acquisition of Ayesa Engineering, which is expected to close late in the second quarter. On a consolidated basis, the Company expects to deliver mid teens growth in revenues, Adjusted EBITDA and Adjusted EPS during 2026."},{"time":"07:16","ticker":"ENB","headline":"Enbridge Correction: In our 7:09 comment, we compared Q4 EPS to U.S. dollars estimate when it should have been compared against Canadian dollar estimate; Comment has been edited to reflect correct comparison","body":""},{"time":"07:11","ticker":"AZN","headline":"AstraZeneca: Positive and clinically meaningful results from the Phase III KALOS and LOGOS trials for BREZTRI in patients with uncontrolled asthma published in The Lancet Respiratory Medicine","body":"WILMINGTON, Del.--(BUSINESS WIRE)-- Full results from the positive Phase III KALOS and LOGOS trials published in The Lancet Respiratory Medicine showed AstraZeneca's BREZTRI Aerosphere (budesonide/glycopyrronium/formoterol fumarate or BGF (320/28.8/9.6g)) demonstrated statistically significant and clinically meaningful improvements in patients with uncontrolled asthma compared with dual-combination inhaled corticosteroid/long-acting beta2-agonist (ICS/LABA) medicines: Symbicort (budesonide/formoterol fumarate or BFF, a standard therapeutic option), PT009 (BFF in an Aerosphere formulation) and the Symbicort and PT009 treatment groups combined.1 BREZTRI is a single-inhaler, fixed-dose triple-combination of ICS/LABA and a long-acting muscarinic antagonist (LAMA). Click here for full release."},{"time":"07:11","ticker":"MRNA","headline":"Moderna beats by $0.43, beats on revs; guides FY26 revs above consensus","body":"• Reports Q4 (Dec) loss of $2.11 per share, $0.43 better than the FactSet Consensus of ($2.54); revenues fell 33.2% year/year to $645 mln vs the $635.15 mln FactSet Consensus.\n• Co issues upside guidance for FY26, sees FY26 revs of +10% yr/yr to ~$2.14 bln vs. $2.02 bln FactSet Consensus."},{"time":"07:09","ticker":"ENB","headline":"Enbridge beats by C$0.10; Reaffirms FY26 adjusted EBTIDA, DCF guidance, Increases 2026 quarterly dividend by 3% to C$0.97/share","body":"• Reports Q4 (Dec) earnings of C$0.88 per share, excluding non-recurring items, $0.10 better than the FactSet Consensus of $0.78.\n• Adjusted EBITDA in the fourth quarter of 2025 increased by C$83 million compared with the same period in 2024.\n• Dividend: Enbridge increased its 2026 quarterly dividend by 3% to C$0.97 (C$3.88 annualized) per share, commencing with the dividend payable on March 1, 2026 to shareholders of record on February 17, 2026.\n• 2026 Outlook: Co reaffirms adjusted EBITDA guidance of between C$20.2 billion and C$20.8 billion and DCF per share between C$5.70 and C$6.10.\n• Multi-Year Outlook: The Company also reaffirms its 2023 to 2026 near-term growth of 7-9% for adjusted EBITDA, 4-6% for adjusted earnings per share (EPS) and approximately 3% for DCF per share. Post 2026, adjusted EBITDA, EPS and DCF per share are all expected to grow by approximately 5% annually."},{"time":"07:05","ticker":"WEN","headline":"Wendy's beats by $0.02, beats on revs; guides FY26 EPS below consensus","body":"• Reports Q4 (Dec) earnings of $0.16 per share, excluding non-recurring items, $0.02 better than the FactSet Consensus of $0.14; revenues fell 5.5% year/year to $543 mln vs the $537.19 mln FactSet Consensus.\n• Q4 Global Same-Restaurant Sales Growth of (10.1)%; U.S. (11.3)%, International (2.0)%.\n• Co issues downside guidance for FY26, sees EPS of $0.56-$0.60, excluding non-recurring items, vs. $0.86 FactSet Consensus; sees FY26 Global systemwide sales growth being roughly flat yr/yr, this is not comparable to consensus.Co guides to FY26 adjusted EBITDA of $460-480 mln. Co guides to FY26 cap-ex of $120-130 mln. Co guides to FY26 free cash flow of $190-205 mln.\n• Co guides to FY26 adjusted EBITDA of $460-480 mln. Co guides to FY26 cap-ex of $120-130 mln. Co guides to FY26 free cash flow of $190-205 mln."},{"time":"07:04","ticker":"AAOI","headline":"Applied Optoelectronics breaks ground on planned manufacturing facility in the City of Sugar Land; plans to increase investment in this facility and our headquarters from $150 mln to potentially $300 mln by the end of next year","body":""},{"time":"07:02","ticker":"HL","headline":"Hecla Mining reports exploration results and mineral reserves &amp; resources","body":"• Silver reserves of 231 million ounces after producing 17 million ounces in 2025, maintaining silver peer leading average reserve life, nearly double the industry average\n• Measured and Indicated silver resources of 161 million ounces; Inferred silver resources of 468 million ounces\n• Proven and Probable gold reserves of 2.0 million ounces\n• Measured and Indicated gold resources of 4.5 million ounces; Inferred gold resources of 6.3 million ounces\n• Demonstrated robust economics using conservative pricing ($25/oz silver and $2,100/oz gold for reserves; and $26/oz silver and $2,250/oz gold for resources). High-grades and sharp ore boundaries limit reserve sensitivity to metal price assumptions, while preserving margin potential across metals cycles"},{"time":"07:00","ticker":"SUMRX","headline":"Asian Markets Close: Nikkei -1.2%, Hang Seng -1.7%, Shanghai -1.3%","body":"• In economic data: China's January New Loans CNY4.71 trln (expected CNY5.00 trln; last CNY910 bln), January Outstanding Loan Growth 6.1% yr/yr (expected 6.2%; last 6.4%), and January total social financing CNY7.22 trln (expected CNY7.05 trln; last CNY2.21 trln). January House Prices -3.1% yr/yr (last -2.7%) South Korea's January Import Price Index -1.2% yr/yr (last 0.5%) and Export Price Index 7.8% yr/yr (last 5.0%) New Zealand's January Business PMI 55.2 (last 56.1). December External Migration & Visitors 7.0% yr/yr (last 8.2%). Q1 Inflation Expectations 2.4% (last 2.3%)\n• China's January New Loans CNY4.71 trln (expected CNY5.00 trln; last CNY910 bln), January Outstanding Loan Growth 6.1% yr/yr (expected 6.2%; last 6.4%), and January total social financing CNY7.22 trln (expected CNY7.05 trln; last CNY2.21 trln). January House Prices -3.1% yr/yr (last -2.7%)\n• South Korea's January Import Price Index -1.2% yr/yr (last 0.5%) and Export Price Index 7.8% yr/yr (last 5.0%)\n• New Zealand's January Business PMI 55.2 (last 56.1). December External Migration & Visitors 7.0% yr/yr (last 8.2%). Q1 Inflation Expectations 2.4% (last 2.3%)\n• Japan's Nikkei: -1.2% (+5.0% for the week)\n• Hong Kong's Hang Seng: -1.7% (UNCH for the week)\n• China's Shanghai Composite: -1.3% (+0.4% for the week)\n• India's Sensex: -1.3% (-1.1% for the week)\n• South Korea's Kospi: -0.3% (+8.2% for the week)\n• Australia's ASX All Ordinaries: -1.5% (+2.1% for the week)\n• USD/JPY: +0.4% to 153.27\n• USD/CNH: +0.2% to 6.9058\n• USD/INR: +0.1% to 90.61"},{"time":"06:55","ticker":"ATMU","headline":"Atmus Filtration Technologies beats by $0.10, beats on revs; guides FY26 EPS in-line, revs above consensus","body":"• Reports Q4 (Dec) earnings of $0.66 per share, excluding non-recurring items, $0.10 better than the FactSet Consensus of $0.56; revenues rose 9.8% year/year to $446.6 mln vs the $422.18 mln FactSet Consensus.\n• Co issues guidance for FY26, sees EPS of $2.75-3.00, excluding non-recurring items, vs. $2.81 FactSet Consensus; sees FY26 revs of $1.95-2.02 bln vs. $1.9 bln FactSet Consensus."},{"time":"06:51","ticker":"TRP","headline":"TC Energy beats by CAD0.07; raises dividend","body":"• Reports Q4 (Dec) earnings of CAD0.98 per share, CAD0.07 better than the FactSet Consensus of CAD0.91.\n• TC Energy's Board of Directors approved a 3.2% increase in the quarterly common share dividend of CAD0.8775 per common share for the quarter ending March 31, 2026, equivalent to CAD3.51 on an annualized basis. This is the 26th consecutive year of dividend increase\n• 2026 outlook:Co expects 2026 comparable EBITDA and comparable earnings per common share (EPS) outlooks to be higher than 2025Comparable EBITDA is expected to be CAD11.6 to CAD11.8 billionCapital expenditures are anticipated to be CAD6.0 to CAD6.5 billion prior to adjustments for non-controlling interests, or CAD5.5 to CAD6.0 billion of net capital expenditures\n• Co expects 2026 comparable EBITDA and comparable earnings per common share (EPS) outlooks to be higher than 2025\n• Comparable EBITDA is expected to be CAD11.6 to CAD11.8 billion\n• Capital expenditures are anticipated to be CAD6.0 to CAD6.5 billion prior to adjustments for non-controlling interests, or CAD5.5 to CAD6.0 billion of net capital expenditures"},{"time":"06:48","ticker":"ARCO","headline":"Arcos Dorados issued a clarification with respect to its expected first quarter performanc","body":"• Arcos Dorados is aware of comments made recently in the market that, due to continued macroeconomic pressures in parts of Latin America, systemwide comparable sales growth is expected to decrease in the first quarter of 2026 versus the fourth quarter of 2025. In fact, the opposite is true. Based on its first quarter performance to date, the Company believes it will generate sequentially higher systemwide comparable sales growth in the first quarter of 2026 compared with the fourth quarter of 2025. Importantly, in addition to this constant currency growth in a comparable restaurant base, many of the local currencies in the Company's main markets are stronger so far this year compared with the beginning of 2025, supporting expected total revenue growth in US dollars in the first quarter of 2026.\n• On March 19, 2026, before the market opens, the Company will publish its earnings press release and audited financial results for the fourth quarter and full year ended December 31, 2025. Results for the first quarter, ending March 31, 2026, will be made public in the middle of May 2026."},{"time":"06:39","ticker":"CCJ","headline":"Cameco beats by $0.49, beats on revs","body":"• Reports Q4 (Dec) earnings of $0.50 per share, excluding non-recurring items, $0.49 better than the FactSet Consensus of $0.01; revenues rose 1.5% year/year to $1.2 bln vs the $0.45 bln FactSet Consensus.\n• \"Across the nuclear industry, 2025 marked another year of accelerating global momentum. We saw renewed commitments to nuclear energy from governments, utilities, and industrial energy users around the world, including policies that continued to reinforce nuclear's critical role in delivering secure, reliable and carbon-free baseload power. That support was accompanied by increasing long-term contracting activity towards the end of the year, with a deepening focus on security of supply, and rising interest from existing and emerging nuclear markets, including traditional utilities and new industrial energy users that are considering nuclear. Utilities continue to seek dependable supply in an environment where finite secondary supplies are thinning, and it is becoming more obvious each day that potential new production is expected to be challenged by longer-than-advertised lead times, mounting inflationary pressures and geopolitical uncertainty. The underlying message is clear to us: the fundamentals that have been steadily improving over the past several years gained further traction in 2025, and we expect these trends to continue through 2026 and beyond.\n• Additionally, the value-accretive contributions from our Westinghouse investment continue to outperform the acquisition case expectations. The segment continued to positively impact our overall results in 2025, including a 30% increase in adjusted EBITDA over 2024, reflecting strong underlying performance across its core businesses. We also benefited from a cash distribution from Westinghouse of US$350 million, with US$171.5 million representing our share, tied to its participation in the Dukovany nuclear project. While we don't expect a comparable additional distribution this year, the 2026 guidance for Westinghouse remains strong and reinforces the value of our investment, highlighting Westinghouse's role as a stable, long-term player within a strengthening global nuclear market.\n• Looking forward, we believe we will continue to see a durable trend of growth across the nuclear fuel cycle supported by electrification, energy security and decarbonization priorities, and the increasing recognition that nuclear must play a central role in addressing the world's long-term energy challenges. Cameco is well positioned to benefit from this global shift, driving long-term value for our shareholders, our customers, and the communities where we operate.\""},{"time":"06:36","ticker":"AGCC","headline":"Agencia Comercial Spirits entered into nonbinding letters of intent to evaluate AI computing infrastructure and data center opportunities","body":"• Proposed AI Server Lease Framework with Ricloud (Nonbinding Letter of Intent): On January 15, 2026, the Company entered into a letter of intent with Ricloud AI Inc. setting out preliminary terms under which the Company is evaluating a proposed lease arrangement involving high performance AI computing servers based on the NVIDIA B300 platform (Blackwell architecture). The letter of intent contemplates an estimated total contract value of USD 120.0 million and an estimated quantity of approximately 300 units, subject to final configuration, availability and commercial confirmation. The letter of intent provides for a USD 3.5 million deposit to be paid within five business days following execution. The letter of intent further provides that the deposit is refundable if a definitive lease agreement is not executed for reasons not attributable to a material breach by either party.\n• Proposed Indonesia Data Center Site (Nonbinding Letter of Intent): The Company has also entered into a separate nonbinding letter of intent with an Indonesia based counterparty in relation to a proposed land transaction intended to support the development of an AI computing infrastructure and data center site in Indonesia. The letter of intent contemplates a land parcel of approximately 50,000 square meters. The transaction is contemplated to be undertaken by the Company or through an Indonesian affiliate to be established. The letter of intent includes (i) an initial USD 180,000 booking deposit for the temporary reservation of the aforesaid land and (ii) a subsequent booking fee of IDR 3,000,000,000 plus VAT (11%), each stated to be nonrefundable in case of cancellation, subject to the terms and conditions set out in the letter of intent.\n• Strategic Rationale and Next Steps: The Company is evaluating these initiatives as part of a broader review of strategic opportunities outside its core whisky business. Any entry into AI computing infrastructure and/or data center-related activities will be subject to further evaluation, due diligence, definitive documentation, available financing and liquidity considerations, applicable regulatory considerations, and internal corporate approvals."},{"time":"06:34","ticker":"AAP","headline":"Advance Auto beats by $0.44, reports revs in-line; guides FY26 EPS in-line, revs below consensus","body":"• Reports Q4 (Dec) earnings of $0.86 per share, excluding non-recurring items, $0.44 better than the FactSet Consensus of $0.42; revenues fell 1.2% year/year to $1.97 bln vs the $1.95 bln FactSet Consensus.Q4'25 comparable sales growth of 1.1%; Positive sales performance in the last eight weeks\n• Q4'25 comparable sales growth of 1.1%; Positive sales performance in the last eight weeks\n• Co issues guidance for FY26, sees EPS of $2.40-3.10 vs. $2.72 FactSet Consensus; sees FY26 revs of $8.49-8.58 bln vs. $8.68 bln FactSet Consensus.Comparable store sales (52 weeks): +1-2%\n• Comparable store sales (52 weeks): +1-2%"},{"time":"06:34","ticker":"IMUX","headline":"Immunic announces oversubscribed private placement of up to $400 million to accelerate transformation into commercial-stage company","body":"• Transformation Into Commercial-Stage Company: In the coming months, the company will prioritize: Completion of the ongoing phase 3 ENSURE clinical trials of vidofludimus calcium in relapsing multiple sclerosis (RMS): Top-line data continues to be expected by the end of 2026. Subsequently, Immunic plans to submit a New Drug Application (NDA) in the United States in mid-2027, with a targeted potential regulatory approval date in 2028.\n• Changes in Company LeadershipImmunic's Co-Founder and Chief Executive Officer, Dr. Daniel Vitt, and the Board of Directors will begin a search for a new CEO with deep commercial expertise in the MS space to lead Immunic through its next stage of growth and into commercialization. Subsequently, Dr. Vitt plans to transition to a new senior executive role focused on strengthening the company's scientific strategy and driving portfolio advancement. He will continue to support the organization in this capacity and as a member of the Board of Directors.Concurrent with the transaction, Simona Skerjanec, former SVP, Global Head of Neuroscience and Rare Diseases at Roche, who joined Immunic's Board of Directors in July 2024, has been elevated to interim Chairperson of the Board of Directors.\n• Immunic's Co-Founder and Chief Executive Officer, Dr. Daniel Vitt, and the Board of Directors will begin a search for a new CEO with deep commercial expertise in the MS space to lead Immunic through its next stage of growth and into commercialization. Subsequently, Dr. Vitt plans to transition to a new senior executive role focused on strengthening the company's scientific strategy and driving portfolio advancement. He will continue to support the organization in this capacity and as a member of the Board of Directors.\n• Concurrent with the transaction, Simona Skerjanec, former SVP, Global Head of Neuroscience and Rare Diseases at Roche, who joined Immunic's Board of Directors in July 2024, has been elevated to interim Chairperson of the Board of Directors.\n• Up to USD 400 Million Private PlacementThe company has entered into a securities purchase agreement with select accredited investors for up to USD 400 million in gross proceeds through a private placement. Pursuant to the terms of the purchase agreement, the company will issue an aggregate of 229,076,000 pre-funded warrants to purchase shares of the company's common stock at a price of $0.873 per pre-funded warrant, for upfront gross proceeds of USD 200 million.In addition, the company will issue warrants to purchase up to an aggregate of 229,076,000 shares of the company's common stock (or pre-funded warrants in lieu thereof) at an exercise price of $0.873 per share, for up to an additional USD 200 million in gross proceeds to Immunic. These warrants will expire upon the earlier of (a) 30 days after the public announcement of top-line data from the phase 3 ENSURE trials or (b) February 17, 2031.The financing was led by existing investor BVF Partners L.P. and included participation from Aberdeen Investments, Avidity Partners, Coastlands Capital, EcoR1 Capital, Janus Henderson Investors, OrbiMed, RA Capital Management, TCGX, Trails Edge Capital Partners, Vivo Capital, Woodline Partners LP, and other institutional investors.\n• The company has entered into a securities purchase agreement with select accredited investors for up to USD 400 million in gross proceeds through a private placement. Pursuant to the terms of the purchase agreement, the company will issue an aggregate of 229,076,000 pre-funded warrants to purchase shares of the company's common stock at a price of $0.873 per pre-funded warrant, for upfront gross proceeds of USD 200 million.\n• In addition, the company will issue warrants to purchase up to an aggregate of 229,076,000 shares of the company's common stock (or pre-funded warrants in lieu thereof) at an exercise price of $0.873 per share, for up to an additional USD 200 million in gross proceeds to Immunic. These warrants will expire upon the earlier of (a) 30 days after the public announcement of top-line data from the phase 3 ENSURE trials or (b) February 17, 2031.\n• The financing was led by existing investor BVF Partners L.P. and included participation from Aberdeen Investments, Avidity Partners, Coastlands Capital, EcoR1 Capital, Janus Henderson Investors, OrbiMed, RA Capital Management, TCGX, Trails Edge Capital Partners, Vivo Capital, Woodline Partners LP, and other institutional investors."},{"time":"06:32","ticker":"ESNT","headline":"Essent Group misses by $0.12, reports revs in-line","body":"• Reports Q4 (Dec) earnings of $1.60 per share, $0.12 worse than the FactSet Consensus of $1.72; revenues fell 0.8% year/year to $312.4 mln vs the $312.62 mln FactSet Consensus.\n• Mortgage Insurance new insurance written for the fourth quarter of 2025 was $11.8 billion, compared to $12.2 billion in both the third quarter of 2025 and fourth quarter of 2024. Mortgage Insurance in force as of December 31, 2025 was $248.4 billion, compared to $248.8 billion as of September 30, 2025 and $243.6 billion as of December 31, 2024. Essent Guaranty entered into a quota share reinsurance agreement during the fourth quarter of 2025 with a panel of highly rated third-party reinsurers covering 20% of all eligible policies written in 2027. During the fourth quarter of 2025, Essent Re entered into quota share agreements backed by Funds at Lloyd's to reinsure certain property and casualty risks effective in the first quarter of 2026."},{"time":"06:29","ticker":"SCANX","headline":"Early premarket gappers","body":"• Gapping up: TPH +26.3%, CRSR +25.5%, RIVN +21.1%, ROKU +14.9%, SEI +13.1%, CART +13.1%, BROS +13%, SPSC +12.1%, AMAT +10.9%, CPS +9.8%, LGCY +9.7%, MGA +9.4%, ANET +9.3%, PCOR +8.6%, BAK +8%, NAMM +6.2%, COIN +5.8%, TII +5%, ABNB +4.6%, EVMN +4%, HASI +4%, IR +4%, CCCX +3.1%, AEM +2.8%, CHCT +2.7%, SGML +2.4%, HIVE +2.3%, MHK +1.9%, CVRX +1.1%\n• TPH +26.3%, CRSR +25.5%, RIVN +21.1%, ROKU +14.9%, SEI +13.1%, CART +13.1%, BROS +13%, SPSC +12.1%, AMAT +10.9%, CPS +9.8%, LGCY +9.7%, MGA +9.4%, ANET +9.3%, PCOR +8.6%, BAK +8%, NAMM +6.2%, COIN +5.8%, TII +5%, ABNB +4.6%, EVMN +4%, HASI +4%, IR +4%, CCCX +3.1%, AEM +2.8%, CHCT +2.7%, SGML +2.4%, HIVE +2.3%, MHK +1.9%, CVRX +1.1%\n• Gapping down: COHU -20.7%, PINS -19.5%, CHRS -16.4%, NUS -15.8%, RYAN -15.8%, DKNG -15.2%, CALY -13.3%, BIO -13%, AENT -12.1%, FBIN -11.2%, TOST -5.5%, AMKR -5.4%, KNSL -5%, EXPE -4.9%, YELP -4.6%, CAE -4.4%, WYNN -3.8%, NWG -3.2%, ELVA -2.9%, BFAM -2.6%, TWLO -2.2%, CRSP -2%, GRVY -2%, HCC -1.8%, NCLH -1.5%, FLO -1.5%, DXCM -1.5%, STZ -1.4%, PSA -1.4%, USFD -1.1%, RARE -1.1%, VRTX -1.1%, RKLB -1%, AORT -1%\n• COHU -20.7%, PINS -19.5%, CHRS -16.4%, NUS -15.8%, RYAN -15.8%, DKNG -15.2%, CALY -13.3%, BIO -13%, AENT -12.1%, FBIN -11.2%, TOST -5.5%, AMKR -5.4%, KNSL -5%, EXPE -4.9%, YELP -4.6%, CAE -4.4%, WYNN -3.8%, NWG -3.2%, ELVA -2.9%, BFAM -2.6%, TWLO -2.2%, CRSP -2%, GRVY -2%, HCC -1.8%, NCLH -1.5%, FLO -1.5%, DXCM -1.5%, STZ -1.4%, PSA -1.4%, USFD -1.1%, RARE -1.1%, VRTX -1.1%, RKLB -1%, AORT -1%"},{"time":"06:16","ticker":"GRVY","headline":"Gravity reports preliminary unaudited Q4 2025 results and business updates","body":"Seoul, South Korea, Feb. 13, 2026 (GLOBE NEWSWIRE) -- GRAVITY Co., Ltd. (NasdaqGM: GRVY) (\"Gravity\" or \"Company\"), a developer and publisher of online and mobile games based in South Korea, today announced its unaudited financial results for the fourth quarter ended December 31, 2025, prepared in accordance with International Financial Reporting Standards as issued by the International Accounting Standards Board and business updates.Click here for full release."},{"time":"06:11","ticker":"STDAF","headline":"Stada Arzneimittel and Bio-Thera receive European Marketing authorization for Gotenfia, a biosimilar to simponi","body":"• European Commission grants approval for Gotenfia, a golimumab biosimilar to Simponi that was developed by Bio-Thera and will be marketed by STADA\n• Launch preparations are underway to bring the second approved golimumab biosimilar to patients across Europe in the coming weeks and months\n• Bio-Thera is responsible for development, manufacture and supply; STADA for commercialization in the EU, the UK, Switzerland and selected other countries"},{"time":"06:07","ticker":"TII","headline":"Titan Mining benefits as Commerce sets 160% duties on Chinese graphite","body":"• Titan Mining Corp. said the U.S. Department of Commerce finalized aggregate AD/CVD duties of at least 160% on certain Chinese graphite imports.The duties would have a minimum five-year duration if affirmed by the U.S. International Trade Commission in March 2026 and are separate from existing U.S. import tariffs.The Co is the only U.S. end-to-end natural flake graphite producer and is advancing its Kilbourne facility toward a planned 40,000 metric tonne per year integrated operation.Management views the ruling as materially improving the economics of domestic production and supporting a more secure U.S. graphite supply chain.\n• The duties would have a minimum five-year duration if affirmed by the U.S. International Trade Commission in March 2026 and are separate from existing U.S. import tariffs.\n• The Co is the only U.S. end-to-end natural flake graphite producer and is advancing its Kilbourne facility toward a planned 40,000 metric tonne per year integrated operation.\n• Management views the ruling as materially improving the economics of domestic production and supporting a more secure U.S. graphite supply chain."},{"time":"06:04","ticker":"SGML","headline":"Sigma Lithium announces additional sale of 150,000t plus 350,000t optional of high purity lithium fines; production-backed revolver of $96 mln","body":"• Co announces the sale of 150,000 tonnes of high purity lithium fines with 1% of lithium oxide content at a net final price of US$140/t.\n• The same agreement gives the buyer an option to purchase an additional 350,000 tonnes of the Low Grade Product at market prices upon warehouse delivery at the port of Vitoria. The volume optionality ensures the flexibility to respond to robust market conditions for the Low Grade Product and customer requirements across the Company's portfolio.\n• The commercial success of Sigma Lithium's Low Grade Product can potentially generate the equivalent proceeds of sales of 70,000 tonnes of Sigma Lithium's high-grade lithium oxide concentrate.\n• The resumption of production cadence of the High Grade Lithium Concentrate triggers the commencement of pre-payments under the revolver facility of US$96 million, strengthening Sigma Lithium's near-term liquidity.\n• The unsecured binding agreement signed with a leading company in the battery materials supply chain, provides for the supply of 70,500 tonnes of High Grade Lithium Concentrate by Sigma Lithium during 2026.\n• Under the terms, each prepayment's fixed installment of US$8 million occurs 30 days prior to production and delivery to the Port of Vitoria of an agreed upon quantity. The first prepayment was disbursed, as previously announced, on January 13th. . Each prepayment carries an interest of SOFR +1% for 30 days until final sale upon delivery to the Port of Vitoria."},{"time":"06:00","ticker":"RDWR","headline":"Radware announces new $80 million share repurchase plan","body":"• Co announced that its board of directors has authorized a new plan to repurchase up to $80 million of its issued and outstanding ordinary shares.\n• The 2026 Plan will expire on March 15, 2027."},{"time":"06:00","ticker":"","headline":"S&P futures vs fair value: -9.00. Nasdaq futures vs fair value: -29.00.","body":""},{"time":"06:00","ticker":"","headline":"European Markets","body":"FTSE...10420.29...+17.90...+0.20%. DAX...24856.46...+3.80...+0.00%."},{"time":"06:00","ticker":"","headline":"Asian Markets","body":"Nikkei...56941.97...-697.90...-1.20%. Hang Seng...26567.13...-465.40...-1.70%."},{"time":"06:00","ticker":"SUMRX","headline":"Overnight Summary -- World markets take cautious tone ahead of US CPI","body":"• Risk appetite is wobbling ahead of the open, with S&P futures slipping below fair value as Asia sells off sharply, the dollar firms, and a powerful bid in gold and silver signals a defensive shift beneath an otherwise quiet rates backdrop. S&P futures are up about seven points, trading around 6840. The market traded in a range of over 44 points, with a high of 6868.75 and a low of 6824.25.\n• Asian markets ended lower on Friday, tracking Wall Street's decline as renewed concerns about artificial intelligence's impact on corporate earnings weighed on sentiment ahead of key U.S. CPI data. China underperformed, with the Shanghai Composite falling 1.26% to 4,082.07 ahead of a week-long holiday, while Hong Kong's Hang Seng dropped 1.72% amid broad weakness in technology shares. Japan also retreated, with the Nikkei 225 losing 1.21% to 56,941.97, as SoftBank plunged 8.9% amid AI-related worries, despite reporting a sharp jump in net profit. Stronger U.S. labor data dampened hopes for near-term Federal Reserve rate cuts, while a steady dollar supported gold's rebound and oil headed toward a second weekly loss on easing geopolitical concerns.\n• European markets trade mixed on Friday, with the FTSE 100 and DAX hovering near the flatline while the CAC 40 shows relative volatility as investors digest Wall Street's AI-driven sell-off. Sentiment is largely shaped by earnings, with Safran surging 7.3% on upbeat 2026 revenue and profit forecasts, and Capgemini advancing after full-year revenue topped its target. In contrast, L'Oreal plunges 6% after missing fourth-quarter sales expectations, weighing on French equities. Elsewhere, Vale gains after stronger core profit, while Norsk Hydro slides on weaker quarterly revenue, highlighting stock-specific dispersion across the region.\n• S&P Futures vs Fair Value: -9.0\n• 10 yr Note: 4.126%\n• USD/JPY: 15352 +0.78\n• EUR/USD: 1.1857 -0.0016\n• Europe: FTSE: +0.1% DAX: -0.1% CAC: -0.3%\n• Asia: Hang Seng: -1.7% Shanghai: -1.3% Nikkei: -1.2%\n• Gold (4990.10 +41.70) Silver (78.115 +2.433) Crude (63.01 +0.17)"},{"time":"05:09","ticker":"MGA","headline":"Magna beats by $0.38, beats on revs; guides FY26 EPS above consensus, revs in-line; raises dividend","body":"• Reports Q4 (Dec) earnings of $2.18 per share, excluding non-recurring items, $0.38 better than the FactSet Consensus of $1.80; revenues rose 2.1% year/year to $10.85 bln vs the $10.56 bln FactSet Consensus.\n• Co issues guidance for FY26, sees EPS of $6.25-7.25, excluding non-recurring items, vs. $5.98 FactSet Consensus; sees FY26 revs of $41.9-43.5 bln vs. $42.13 bln FactSet Consensus.\n• Co's Board of Directors declared a fourth quarter dividend of $0.495 per Common Share. This represents a 2% higher dividend, and our 16th consecutive year of fourth quarter dividend increases. The dividend is payable on March 13, 2026 to shareholders of record as of the close of business on February 27, 2026."},{"time":"04:57","ticker":"SBSW","headline":"Sibanye-Stillwater signs 138 MW renewable PPA, expanding contracted clean energy portfolio","body":"• Sibanye-Stillwater Ltd. entered into a 138 MW renewable energy power purchase agreement with NOA Group, lifting its total contracted renewable capacity to approximately 765 MW.The 10-year agreement will supply 138 MW per annum from aggregated solar and wind facilities via the Eskom grid under South Africa's national wheeling framework, with supplemental short-term take-and-pay supply.The Co expects the additional capacity to reduce greenhouse gas emissions by approximately 433,080 tCO2e per year from 2028 onward.The agreement strengthens Sibanye-Stillwater's position as the largest contracted private renewable energy off-taker in South Africa's mining sector and supports its decarbonization strategy.\n• The 10-year agreement will supply 138 MW per annum from aggregated solar and wind facilities via the Eskom grid under South Africa's national wheeling framework, with supplemental short-term take-and-pay supply.\n• The Co expects the additional capacity to reduce greenhouse gas emissions by approximately 433,080 tCO2e per year from 2028 onward.\n• The agreement strengthens Sibanye-Stillwater's position as the largest contracted private renewable energy off-taker in South Africa's mining sector and supports its decarbonization strategy."},{"time":"04:46","ticker":"AZN","headline":"AstraZeneca reports Phase III data showing Breztri improved lung function in uncontrolled asthma","body":"• AstraZeneca PLC reported Phase III KALOS and LOGOS results published in The Lancet Respiratory Medicine showing Breztri (budesonide/glycopyrronium/formoterol) delivered statistically significant improvements in lung function versus dual ICS/LABA therapies in patients with uncontrolled asthma.In pooled primary endpoint analyses, Breztri improved morning pre-dose trough FEV1 by 76 mL and FEV1 AUC0-3 by 90 mL over 24 weeks versus combined dual-therapy groups (p<0.001).Breztri also reduced the annualised rate of severe asthma exacerbations compared with ICS/LABA treatments, with no new safety or tolerability signals identified.Regulatory filings for Breztri in asthma are under review in major regions, expanding its potential beyond its existing COPD approvals in more than 80 countries.\n• In pooled primary endpoint analyses, Breztri improved morning pre-dose trough FEV1 by 76 mL and FEV1 AUC0-3 by 90 mL over 24 weeks versus combined dual-therapy groups (p<0.001).\n• Breztri also reduced the annualised rate of severe asthma exacerbations compared with ICS/LABA treatments, with no new safety or tolerability signals identified.\n• Regulatory filings for Breztri in asthma are under review in major regions, expanding its potential beyond its existing COPD approvals in more than 80 countries."},{"time":"04:44","ticker":"HIVE","headline":"HIVE Digital Technologies signs $30 mln AI cloud contracts to expand BUZZ HPC platform","body":"• HIVE Digital Technologies Ltd. announced its BUZZ HPC unit signed customer agreements totaling approximately $30 mln in contract value over two-year fixed terms, subject to performance and deployment milestones.The contracts support the initial phase of BUZZ's AI-optimized GPU deployment at its Canada West site in Manitoba, with 504 liquid-cooled Dell server-based GPUs expected online by March 31, 2026.Management expects the initial phase to generate roughly $15 mln in annual recurring revenue once fully operational, with total annualized HPC segment revenue projected to increase from about $20 mln to approximately $35 mln upon full deployment.HIVE anticipates capital expenditures for GPUs, electrical and cooling infrastructure, and working capital, alongside operating costs including power, hosting, maintenance, staffing, and network expenses.\n• The contracts support the initial phase of BUZZ's AI-optimized GPU deployment at its Canada West site in Manitoba, with 504 liquid-cooled Dell server-based GPUs expected online by March 31, 2026.\n• Management expects the initial phase to generate roughly $15 mln in annual recurring revenue once fully operational, with total annualized HPC segment revenue projected to increase from about $20 mln to approximately $35 mln upon full deployment.\n• HIVE anticipates capital expenditures for GPUs, electrical and cooling infrastructure, and working capital, alongside operating costs including power, hosting, maintenance, staffing, and network expenses."},{"time":"04:36","ticker":"TPH","headline":"TRI Pointe Homes to be acquired by Sumitomo Forestry in $4.5 bln cash deal","body":"• Tri Pointe Homes agreed to be acquired by Sumitomo Forestry for $47.00 per share in cash, valuing the transaction at approximately $4.5 bln.The offer represents a 29% premium to Feb. 12 closing price and a 42% premium to the 90-day VWAP, and exceeds the prior all-time high closing price.TPH will continue operating under its existing brand and management team, maintaining its Irvine headquarters and 17 divisions, but will become a wholly owned subsidiary and delist from the NYSE upon closing.The deal, unanimously approved by both boards, is expected to close in Q2 2026, subject to shareholder approval and customary conditions, and is not subject to financing.\n• The offer represents a 29% premium to Feb. 12 closing price and a 42% premium to the 90-day VWAP, and exceeds the prior all-time high closing price.\n• TPH will continue operating under its existing brand and management team, maintaining its Irvine headquarters and 17 divisions, but will become a wholly owned subsidiary and delist from the NYSE upon closing.\n• The deal, unanimously approved by both boards, is expected to close in Q2 2026, subject to shareholder approval and customary conditions, and is not subject to financing.\n• TPH reiterated its Q4 and FY25 outlook and will report results on Feb. 25, 2026.For the fourth quarter, the Company anticipates delivering between 1,200 and 1,400 homes at an average sales price between $690,000 and $700,000. The Company expects homebuilding gross margin percentage to be in the range of 19.5% to 20.5% for the fourth quarter and anticipates its SG&A expense as a percentage of home sales revenue will be in the range of 10.5% to 11.5%. Finally, the Company expects its effective tax rate for the fourth quarter to be approximately 27.0%.For the full year, the Company anticipates delivering between 4,800 and 5,000 homes at an average sales price of approximately $680,000. The Company expects homebuilding gross margin percentage to be approximately 21.8%, excluding $19.3 million of inventory-related charges for the nine months ended September 30, 2025.\n• For the fourth quarter, the Company anticipates delivering between 1,200 and 1,400 homes at an average sales price between $690,000 and $700,000. The Company expects homebuilding gross margin percentage to be in the range of 19.5% to 20.5% for the fourth quarter and anticipates its SG&A expense as a percentage of home sales revenue will be in the range of 10.5% to 11.5%. Finally, the Company expects its effective tax rate for the fourth quarter to be approximately 27.0%.\n• For the full year, the Company anticipates delivering between 4,800 and 5,000 homes at an average sales price of approximately $680,000. The Company expects homebuilding gross margin percentage to be approximately 21.8%, excluding $19.3 million of inventory-related charges for the nine months ended September 30, 2025."},{"time":"04:30","ticker":"CPAC","headline":"Cementos Pacasmayo S.A.A. reports Q4 results","body":"Cementos Pacasmayo S.A.A. and subsidiaries (NYSE: CPAC; BVL: CPACASC1) (\"the Company\" or \"Pacasmayo\") a leading cement company serving the Peruvian construction industry, announced today its consolidated results for the fourth quarter (\"4Q25\") and for the year (\"2025\") ended December 31, 2025. These results have been prepared in accordance with International Financial Reporting Standards (\"IFRS\") and are stated in Soles (S/).Click here for full release."},{"time":"04:29","ticker":"AMKR","headline":"Amkor prices secondary offering of 10.0 mln shares of common stock at $48.75 per share","body":""},{"time":"04:27","ticker":"CHRS","headline":"Coherus BioSciences prices offering of 28.6 mln shares of common stock at $1.75 per share","body":""},{"time":"04:26","ticker":"AMH","headline":"American Homes 4 Rent raises quarterly dividend by 10%","body":"• Co announced that the Board of Trustees declared a dividend of $0.33 per share on the Company's common shares for the first quarter of 2026.\n• This represents an increase of 10% versus the prior quarterly dividend rate of $0.30 per share.\n• The distribution will be payable in cash on March 31, 2026 to shareholders of record on March 13, 2026."},{"time":"04:25","ticker":"EVMN","headline":"Evommune prices offering of 4,494,279 shares of its common stock at $27.88 per share","body":""},{"time":"04:20","ticker":"NAMM","headline":"Namib Minerals begins dewatering at Redwing to advance restart plans","body":"• Namib Minerals commenced dewatering activities at its Redwing Mine in Zimbabwe on Jan. 29, 2026, as part of its restart project.Dewatering is intended to enable underground access for feasibility work, including condition assessments and detailed engineering studies.The work aligns with the plan outlined in the November 2025 business update and marks progress on enabling activities.Co indicates execution remains consistent with its staged restart strategy focused on safety and disciplined capital deployment.\n• Dewatering is intended to enable underground access for feasibility work, including condition assessments and detailed engineering studies.\n• The work aligns with the plan outlined in the November 2025 business update and marks progress on enabling activities.\n• Co indicates execution remains consistent with its staged restart strategy focused on safety and disciplined capital deployment."},{"time":"04:16","ticker":"NVS","headline":"Novartis reports Phase III data for Vanrafia in IgA nephropathy","body":"• Novartis reported Phase III ALIGN data showing Vanrafia (atrasentan) reduced kidney function decline vs. placebo in IgA nephropathy, with a 2.39 ml/min/1.73m difference in eGFR at Week 136 (p=0.057).At end of treatment (Week 132), eGFR difference vs. placebo was 2.59 ml/min/1.73m (nominal p=0.039), with results favoring Vanrafia across multiple timepoints and in patients also receiving SGLT2 inhibitors.Vanrafia received accelerated approval in the U.S. and China in 2025 for reduction of proteinuria in adults with IgAN; Co plans to seek traditional approval in 2026.Safety profile was consistent with prior findings; ALIGN represents the longest follow-up period among pivotal Phase III IgAN studies.\n• At end of treatment (Week 132), eGFR difference vs. placebo was 2.59 ml/min/1.73m (nominal p=0.039), with results favoring Vanrafia across multiple timepoints and in patients also receiving SGLT2 inhibitors.\n• Vanrafia received accelerated approval in the U.S. and China in 2025 for reduction of proteinuria in adults with IgAN; Co plans to seek traditional approval in 2026.\n• Safety profile was consistent with prior findings; ALIGN represents the longest follow-up period among pivotal Phase III IgAN studies."}],"fetchedAt":1771008126624},"savedAt":1771008126624}