{"data":{"updated":"2/17/2026, 5:03:35 AM","entries":[{"time":"04:58","ticker":"WDS","headline":"Woodside Energy Group reports 1.88 bln boe 1P reserves at year-end 2025; 2P at 3.0 bln boe","body":"• Woodside Energy Group Ltd. reported year-end 2025 proved (1P) reserves of 1,882.1 MMboe and proved plus probable (2P) reserves of 2,999.5 MMboe, with 2C contingent resources of 5,795.7 MMboe.Co's 1P reserves declined from 1,975.7 MMboe and 2P reserves from 3,092.2 MMboe at year-end 2024, reflecting production and divestments.Excluding divestments and production, 1P reserves increased by 134.1 MMboe and 2P reserves by 141.0 MMboe, driven by reservoir updates in Australia, Senegal and the U.S. and project sanctions.Co reports a proved reserves life of 8.9 years and a proved plus probable reserves life of 14.2 years at 2025 production levels.\n• Co's 1P reserves declined from 1,975.7 MMboe and 2P reserves from 3,092.2 MMboe at year-end 2024, reflecting production and divestments.\n• Excluding divestments and production, 1P reserves increased by 134.1 MMboe and 2P reserves by 141.0 MMboe, driven by reservoir updates in Australia, Senegal and the U.S. and project sanctions.\n• Co reports a proved reserves life of 8.9 years and a proved plus probable reserves life of 14.2 years at 2025 production levels."},{"time":"04:56","ticker":"WIRES","headline":"On The Wires","body":"• Smithfield Foods, Inc. (SFD) announced it has initiated the approval process to build a new state-of-the-art packaged meats and fresh pork processing facility in Sioux Falls, South Dakota.\n• GlobalFoundries (GFS) and Renesas Electronics Corporation announced an expanded strategic collaboration through a multi-billion-dollar manufacturing partnership that broadens Renesas' access to GF technologies including its differentiated technology platforms. This agreement reflects a shared commitment to secure, resilient supply chains and aligns with U.S. priorities to strengthen domestic semiconductor production for economic and national security."},{"time":"04:51","ticker":"WPM","headline":"Wheaton Precious Metals tops 2025 output guidance; guides 860k-940k GEOs in 2026, targets 1.2 mln by 2030","body":"• Wheaton Precious Metals reported 2025 production of 691,670 gold equivalent ounces, exceeding the 600,000--670,000 GEO guidance range.\n• Co guides 2026 production of 860,000--940,000 GEOs and projects ~50% growth to 1.2 mln GEOs by 2030.\n• 2025 output included 416,286 oz gold and 22.4 mln oz silver, with upside driven by stronger performance at Salobo, Peasquito and Constancia, partially offset by slower ramp-ups at Goose and Mineral Park."},{"time":"04:50","ticker":"WPM","headline":"Wheaton Precious Metals to acquire additional 33.75% Antamina silver stream from BHP for $4.3 bln","body":"• Wheaton Precious Metals will acquire BHP's 33.75% silver stream on the Antamina mine for $4.3 bln in upfront cash, increasing its total attributable stream to 67.5% of payable silver.\n• The stream is effective April 1, 2026, with Wheaton purchasing 33.75% of payable silver until 100 Moz are delivered, then 22.5% for life of mine, at ongoing payments equal to 20% of spot silver.\n• The transaction is expected to add ~6.0 Moz of attributable silver annually over the first five years and increase 2026 production by 11.3% on a pro forma basis, while boosting Proven and Probable reserves by 66 Moz.\n• The $4.3 bln deposit will be funded with ~$1.9 bln cash on hand, a new $1.5 bln term loan and ~$0.9 bln draw on the existing revolving credit facility, with net debt at closing projected at ~$2.4 bln."},{"time":"04:47","ticker":"AHH","headline":"Armada Hoffler unveils bold new strategic direction to drive long-term shareholder value and launches as AH Realty Trust","body":"Executing a fundamental business restructuring to eliminate complexity, strengthen the balance sheet, and relentlessly focus on operating a streamlined real estate platform:Click here for full release."},{"time":"04:46","ticker":"AHH","headline":"Armada Hoffler reports fourth quarter 2025 results","body":"Normalized FFO of $0.29 Per Diluted Share for the Fourth Quarter and $1.08 per Diluted Share for the Full YearClick here for full release."},{"time":"04:42","ticker":"SON","headline":"Sonoco Products beats by $0.05, reports revs in-line; guides FY26 EPS in-line","body":"• Reports Q4 (Dec) earnings of $1.05 per share, $0.05 better than the FactSet Consensus of $1.00; revenues rose 29.7% year/year to $1.77 bln vs the $1.76 bln FactSet Consensus.\n• Co issues in-line guidance for FY26, sees EPS of $5.80-6.20 vs. $5.96 FactSet Consensus.Co sees FY26 revs of $7.25-7.75 bln vs $7.46 bln consensus\n• Co sees FY26 revs of $7.25-7.75 bln vs $7.46 bln consensus"},{"time":"04:38","ticker":"H","headline":"Hyatt Hotels announces chairman transition as Pritzker retires; CEO Hoplamazian assumes dual role","body":"• Hyatt Hotels announced that Thomas J. Pritzker retired as Executive Chairman effective immediately and will not seek re-election at the May annual meeting.Mark S. Hoplamazian, Hyatt's President and CEO, was appointed Chairman of the Board, combining the chairman and CEO roles.Pritzker has served on the Board since 2004 and held senior executive and chairman responsibilities dating back to 1980 at predecessor entities.The leadership transition is effective immediately and does not involve changes to Hyatt's stated strategy or operations.\n• Mark S. Hoplamazian, Hyatt's President and CEO, was appointed Chairman of the Board, combining the chairman and CEO roles.\n• Pritzker has served on the Board since 2004 and held senior executive and chairman responsibilities dating back to 1980 at predecessor entities.\n• The leadership transition is effective immediately and does not involve changes to Hyatt's stated strategy or operations."},{"time":"04:34","ticker":"WIRES","headline":"On The Wires","body":"• Voyager Technologies (VOYG) announced a strategic partnership with ATMOS Space Cargo, a leading provider of free-flying orbital cargo and return services, expanding access to space for scientific discovery and technology advancement. Under the signed memorandum of understanding, Voyager Europe will serve as ATMOS' integration and implementation partner, while ATMOS will provide free-flying orbital vehicles with controlled and precise return capability, enabling end-to-end microgravity missions from launch through on-orbit operations and return to Earth. Both companies will mutually refer customers and mission opportunities across their networks.\n• Westlake Royal Building Products, a Westlake company (WLK), is expanding its line of TruExterior Siding & Trim with the addition of a 5/8\" Lap Siding profile. The new profile combines the coveted appearance and shadow lines of traditional lap siding with the high-performance attributes of TruExterior's poly-ash material. It has a true 5/8\" butt and a sought-after aesthetic that mimics real cedar.\n• TRU Simulation + Training Inc., a Textron Inc. (TXT) company, and an affiliate of Textron Aviation, announced today its Full Flight Simulator for the Cessna Citation Ascend has achieved Federal Aviation Administration Level D qualification. This milestone significantly enhances advanced training options for midsize jet pilots, delivering a highly immersive and true-to-life training environment on the recently FAA certified Citation Ascend. European Union Aviation Safety Agency qualification is anticipated in 2026, further extending the simulator's global reach.\n• Westlake Royal Building Products, a Westlake company (WLK), announced the launch of TrendLine, a data-driven digital experience designed to decode the shifting design preferences of the modern homeowner. The 2026 trend forecast reveals a pivot toward intentional design choices, favoring warm neutrals, natural textures and products that prioritize emotional well-being and structural resilience.\n• Norwegian Cruise Line Holdings Ltd. (NCLH), a global cruise company operating Norwegian Cruise Line, Oceania Cruises, and Regent Seven Seas Cruises, announced that it has entered into an agreement with Fincantieri for the design and construction of three new cruise ships, further advancing the company's long-term fleet development strategy across its brands. The order includes one ship for each of the Company's three award-winning brands-Norwegian Cruise Line, Oceania Cruises, and Regent Seven Seas Cruises-with one vessel to be built as a sister ship to Oceania Sonata, one as a sister ship to Seven Seas Prestige, and one as a sister ship to the previously announced Norwegian Cruise Line newbuilds order. All three ships will be built at Fincantieri's shipyards in Italy and delivered between 2036 and 2037."},{"time":"04:32","ticker":"LHX","headline":"L3Harris wins ~$400 mln contract for THAAD propulsion systems","body":"• L3Harris Technologies secured a nearly $400 mln contract to produce additional solid rocket boost motors and Liquid Divert and Attitude Control Systems (LDACS) for the Missile Defense Agency's THAAD system.\n• L3Harris supplies propulsion components as a subcontractor supporting the prime contractor for THAAD, a key U.S. defense against short-, medium- and intermediate-range missiles."},{"time":"04:30","ticker":"GE","headline":"GE Aerospace: United Airl (UAL) orders 300 GEnx engines from GE Aerospace for 787 fleet expansion","body":"• United Airlines selected 300 GEnx engines from GE Aerospace to power new Boeing 787 Dreamliners, with the agreement also including spare engines.\n• GE Aerospace expects the order to bring United's 787 fleet to more than 200 GEnx-powered aircraft, making United the largest GEnx operator globally.\n• GE Aerospace's firm GEnx backlog increases to nearly 1,800 future deliveries plus spares following this order.\n• The GEnx engine has accumulated more than 70 mln flight hours and powers about two-thirds of 787 aircraft currently in operation."},{"time":"04:28","ticker":"ZIM","headline":"ZIM Integrated Shipping to be acquired by Hapag-Lloyd for $35 per share in $4.2 bln cash deal","body":"• ZIM Integrated Shipping Services Ltd. agreed to be acquired by Hapag-Lloyd for $35.00 per share in cash, valuing the equity at approximately $4.2 bln.\n• The offer represents a 58% premium to the prior closing price, a 90% premium to the 90-day VWAP, and a 126% premium to the unaffected price of $15.50 on Aug. 8, 2025.\n• FIMI Opportunity Funds will form a new Israeli liner company, \"New ZIM,\" with 16 vessels to serve key trade routes into Israel and assume Special State Share obligations, with commercial support from Hapag-Lloyd.\n• The transaction was unanimously approved by ZIM's board and is expected to close by late 2026, subject to shareholder, regulatory, and State of Israel approvals; upon closing, ZIM shares will be delisted."},{"time":"04:26","ticker":"CAG","headline":"Conagra reaffirms FY26 guidance ahead of CAGNY Presentation","body":"• Co reaffirms guidance for FY26 (May), sees EPS of $1.70-1.85 vs. $1.72 FactSet Consensus.Co also reaffirms Organic net sales change of (1)% to 1% compared to fiscal 2025 Adjusted operating margin between ~11.0% and ~11.5%\n• Co also reaffirms Organic net sales change of (1)% to 1% compared to fiscal 2025\n• Adjusted operating margin between ~11.0% and ~11.5%\n• Additionally, the company now expects free cash flow conversion to be approximately 100% for the full year, an increase from its previous expectation of approximately 90%."},{"time":"04:24","ticker":"AEP","headline":"American Electric: Transource Energy and FirstEnergy Transmission Joint Venture Receive Approval for Major Electric Transmission Project in Central Ohio","body":"COLUMBUS, Ohio, Feb. 16, 2026 /PRNewswire/ -- Regional grid operator PJM Interconnection has selected a major electric transmission project to meet a critical infrastructure need in central Ohio. Jointly developed by Transource Energy, LLC (a partnership between American Electric Power Company, Inc and Evergy, Inc.) and FirstEnergy Transmission, LLC the project will help support rising electricity demand and ongoing economic growth in the fast-growing Columbus region.Click here for full release."},{"time":"04:20","ticker":"WIRES","headline":"On The Wires","body":"• TTEC Holdings, Inc. (TTEC) announced the expansion and growing enterprise adoption of its AI-driven frontline performance ecosystem, anchored by TTEC RealSkill and TTEC Perform. Built to bridge the gap between AI investment and real business outcomes, the integrated ecosystem enables organizations to operationalize AI across the associate lifecycle-from onboarding and skill development to coaching and real-time performance execution.\n• The United States Olympic & Paralympic Committee announced the Team USA Athlete Recovery Program in partnership with Lilly (LLY), reinforcing a shared commitment across multiple years to fostering athlete health, recovery, and well-being beyond competition. As presenting partner, Lilly will support access to the Team USA Athlete Recovery Program following the Olympic and Paralympic Winter Games Milano Cortina 2026 and through the LA28 Olympic and Paralympic Games. This partnership underscores Lilly's long-term commitment to Team USA, building on their role as an Official Partner in Health Equity.\n• Cloudvirga, a Stewart (STC) -owned provider of digital point-of-sale platforms for lenders, today announced a certified integration with the Optimal Blue PPE that brings real-time pricing and eligibility data to its Loan Hub, enabling loan teams to produce consumer-ready pricing scenarios at both the lead stage and throughout an active loan file. Cloudvirga's Loan Hub gives origination teams a centralized workspace for managing pipelines, collaborating with borrowers and completing tasks. With this integration, the Loan Hub supports real-time pricing directly within the workflows loan teams use.\n• The Riyadh Air Metropolitano Stadium, home of Atltico de Madrid, is advancing its technological transformation with the implementation of a new intelligent, self-driving network infrastructure based on HPE (HPE) Networking solutions. The project, divided into two phases over the 2025/26 and 2026/27 seasons, completely modernizes the stadium's communications system and marks the beginning of a new era in the digitalization of sports infrastructures in Europe. The new network will replace the current infrastructure, which has been in operation for eight seasons, and will feature over 1,500 next-generation Wi-Fi 7 wireless access points managed through HPE Aruba Central.\n• Westlake Royal Building Products, a Westlake company (WLK), announced the launch of its newly redesigned website, delivering a unified digital experience that brings all of its product brands together under one comprehensive platform. The enhanced site also introduces Design Canvas, an intuitive home design tool that empowers homeowners, designers and building professionals to plan and visualize exterior projects with ease."},{"time":"04:12","ticker":"CMPS","headline":"Compass Pathways to announce new clinical data from two ongoing Phase 3 Trials","body":"Compass Pathways plc (Nasdaq: CMPS), a biotechnology company dedicated to accelerating patient access to evidence-based innovation, announced that tomorrow it will report new clinical data from two ongoing Phase 3 trials evaluating COMP360, a synthetic, proprietary formulation of psilocybin, for treatment-resistant depression (TRD). The company will be disclosing new clinical data from Part A and Part B from COMP005 and Part A from COMP006. The results are scheduled for release on February 17th at 6:30 am ET, followed by a webinar hosted by Compass management at 8:00 am ET.Click here for full release."},{"time":"04:11","ticker":"WIRES","headline":"On The Wires","body":"• Ericsson (ERIC), international defense company Leonardo, and the Italian Navy have conducted a maritime connectivity test using an Ericsson 5G Standalone system. The trial was successfully completed, enabling connectivity between naval units engaged in a day and night training scenario on the open sea. A completely self-contained end-to-end Ericsson 5G SA network - comprising Ericsson Ultra Compact Core and Ericsson Massive MIMO Radio Access Network products and solutions - was installed on board the Italian Navy's amphibious landing ship San Giorgio, which served as the lead unit during a recent experimentation campaign. Ericsson 5G SA customer premises equipment was installed on board a second unit of the Italian Navy - the Multi-Purpose Combat Ship Raimondo Montecuccoli.\n• Brown & Brown, Inc. (BRO) announced that Dorothea Henderson has been appointed chief information technology officer. She will lead the company's enterprise technology strategy and oversee initiatives to improve digital capabilities and enhance the technology experience for teammates and customers. In this role, Henderson will work with segment and functional leaders to enhance teammate tools and processes, drive a companywide data and artificial intelligence strategy, strengthen system reliability and security, support technology integration for acquisitions, accelerate digital capabilities and continue building a world-class technology team.\n• Bio-Techne Corporation (TECH) announced that the Ella benchtop immunoassay platform has received CE-IVD marking1 and is now available for sale in the European Union. This achievement brings Ella's hallmark ease of use, speed and reproducibility to clinical settings, helping laboratories streamline workflows and support timely decision-making. Ella is a compact, cartridge-based immunoassay system that delivers accurate biomarker results in under 90 minutes with minimal hands-on time. By simplifying the manual steps of traditional immunoassays, Ella reduces operator variability and provides high-quality, reproducible data suitable for both translational research and clinical applications.\n• Rockwell Automation (ROK) announced that it has achieved significant time savings, improved project accuracy and reduced operational costs for Falcare Industrial Equipment in Sao Caetano do Sup in Brazil.\n• Chevron Corporation (CVX), via its four Dutch subsidiaries, together with HELLENiQ ENERGY has today signed Lease Agreements with the Hellenic Republic which will enable exploration of four blocks offshore Greece. The blocks are located south of Crete (South Crete 1, South Crete 2) and within the Peloponnese (South of Peloponnese, and Block A2). The awarded consortium, in which Chevron holds a 70% operating interest and HELLENiQ ENERGY a 30% interest, was selected following an international call for tender launched by the Greek government in 2025."},{"time":"04:09","ticker":"LLY","headline":"Eli Lilly reports Phase 3 adjuvant win for Retevmo in early-stage RET+ NSCLC","body":"• Eli Lilly and Company said Phase 3 LIBRETTO-432 met its primary endpoint, with Retevmo (selpercatinib) significantly improving event-free survival vs placebo in stage II--IIIA RET fusion-positive NSCLC.The trial showed a statistically significant and clinically meaningful reduction in risk of recurrence or death; overall survival trended favorably but remains immature.Safety was consistent with prior selpercatinib studies; detailed data will be presented at a medical congress and discussed with regulators.Results expand Retevmo's potential use into early-stage disease and reinforce genomic testing in NSCLC, where RET fusions occur in ~1--2% of cases.\n• The trial showed a statistically significant and clinically meaningful reduction in risk of recurrence or death; overall survival trended favorably but remains immature.\n• Safety was consistent with prior selpercatinib studies; detailed data will be presented at a medical congress and discussed with regulators.\n• Results expand Retevmo's potential use into early-stage disease and reinforce genomic testing in NSCLC, where RET fusions occur in ~1--2% of cases."},{"time":"04:03","ticker":"WIRES","headline":"On The Wires","body":"• Rio Tinto (RIO) is deeply saddened to confirm the death of an employee of a contracting company following an incident at the SimFer mine site in Nzrkor, Guinea on Saturday 14 February. Work and activity at the SimFer mine site has been suspended and support, including counselling, is being provided to impacted team members.\n• Cognizant (CTSH) announced a new phase in its strategic partnership with Google (GOOG) Cloud, advancing from platform integration to enterprise-scale execution to help organizations operationalize agentic AI in real-world environments. Building on the recently announced collaboration to adopt Gemini Enterprise, Cognizant is combining enterprise-wide internal deployment, commercial execution and scaled delivery investments to turn the potential of agentic AI into measurable business outcomes. As part of this next phase in the partnership, Cognizant has invested in, and is deploying, Google Workspace alongside Gemini Enterprise internally, with the goal of enhancing productivity, employee experience and delivery velocity across the enterprise.\n• AMD (AMD) and Tata Consultancy Services have expanded their strategic collaboration. TCS, through its subsidiary HyperVault AI Data Center Limited, and AMD will codevelop a rack-scale AI infrastructure design based on the AMD \"Helios\" platform in support of India's national AI initiatives. Powered by AMD Instinct MI455X GPUs, next-generation AMD EPYC \"Venice\" CPUs, AMD Pensando Vulcano NICs and the open ROCm software ecosystem, \"Helios\" is purpose-built to deliver a rack-scale AI platform supporting sovereign AI factories.\n• Klarna (KLAR) is now available on Google Pay in the UK. Google Pay users in the U.K. can choose Klarna's interest-free payment options at checkout."}],"fetchedAt":1771322615686},"savedAt":1771322615686}