{"data":{"updated":"2/12/2026, 2:05:24 PM","entries":[{"time":"09:56","ticker":"RWT","headline":"Redwood Trust +22% after reporting Q4 results; recent initiatives removed over $10 mln of go forward overhead in 2026","body":"Redwood Trust, Inc. (NYSE:RWT; \"Redwood\", the \"Company\"), a leader in expanding access to housing for homebuyers and renters, today reported its financial results for the quarter ended December 31, 2025.Click here for full release."},{"time":"09:38","ticker":"SUMRX","headline":"Earnings/guidance movers","body":"• Gainers: FSLY +62.5%, CGNX +36.9%, MH +23.8%, PRCH +21%, SPHR +17.7%, CROX +17.6%, IPGP +15.7%, ZBRA +17.2%, HUBS +15.3%, VNT +14.2%, VKTX +14.6%, EQIX +12%, IRDM +11%, OPTU +10.1%, BGC +8.6%, IFF +8%, HWM +7.7%, LNC +7.7%, MSI +7.6%, AVNT +7.6%, DBD +7%, WTS +6.9%, TRN +6.9%, LPTH +6.4%, PBF +6.2%, SIEGY +6%, BDC +6.1%, CW +5.5%, AMCX +5.5%, SLF +5.2%, IRM +6.7%, ABEV +4.5%, H +4.3%, EXC +4%, RYN +3.8%, MSA +3.5%, BUD +3.4%, BN +3.5%, FAF +4.4%, AMG +3.9%, GRAB +3%, AEP +2.7%, GTY +2.7%, ALB +2.5%, GVA +2.5%, CNR +2.5%, STNG +2.2%, BDRBF +2.2%, MTRN +2.2%, GTES +2.1%, GFL +2%, AM +1.7%, CXW +1.9%, CXT +1.8%, MCD +1.3%, NWE +1.4%, PCG +1.3%, AEE +1.1%, FTS +1.4%, AUR +1.6%, PDM +1%, KIM +2%, SAFE +0.9%, WFG +0.5%, CPA +0.9%, IRT +0.6%, IPSEY +0.6%, USFD +0.5%, FCPT +0.5%\n• Decliners: ICLR -43.6%, QDEL -17.6%, NRGV -18.6%, INSP -17.9%, FBRT -15.5%, ROL -14%, MICC -13.7%, APP -12.6%, OGN -14.3%, UTZ -12%, BAX -12.2%, BRKR -11.8%, GEO -12.3%, VNDA -8.6%, TRIP -9.7%, QS -8.8%, SLVM -9%, NBIS -7.9%, CSCO -7.3%, NBIX -6.6%, SCI -7.2%, NVMI -6.1%, BTDR -6.7%, CRK -6.6%, ZTS -6%, ALNY -6.1%, ALMU -5.4%, RPC -5.4%, CHKP -4.5%, LEG -4%, HIMX -4.4%, QSR -4.7%, TNET -4.6%, CBRE -3.8%, MLCO -3.9%, NBR -6.2%, ASND -2.8%, TYL -1.9%, BIRK -4.2%, MFC -3.2%, NEWP -3%, LECO -2.7%, UL -1.9%, EEFT -2.1%, NE -2.3%, DAR -1.2%, AR -1.3%, PDS -1.6%, TU -1.4%, ASC -0.6%, LXP -2.5%, BTI -1.2%, GEL -1.6%, KELYA -1%, FMCC -1%, PPC -1.2%, QTWO -0.5%, CNDT -4.5%, ETR -0.6%, STAG -1.1%, PRI -0.5%, PLMR -1.9%, WST -1.9%"},{"time":"09:29","ticker":"EPOW","headline":"E-Power announces the signing of a Memorandum of Understanding with Kehui International Ltd to establish a new joint venture in the United States","body":"• The agreement follows high-level discussions involving key leadership from both organizations. Under the terms of the MOU, E-Power will serve as the majority shareholder with a stake of at least 55%.\n• Key Strategic Highlights:Capital Investment: E-Power will provide $1.5 million USD in cash to fund the initial registration and establishment of the joint venture.Technological Integration: Kehui International will contribute its proprietary \"Synchronous Constant Frequency Microgrid\" patents and provide ongoing technical support.Third-Party Valuation: The investment value of the patents used for the initial investment shall be determined by a third-party appraisal agency recognized by both parties, and the investment ratio shall be assessed by both parties.Market Scope: The joint venture holds exclusive rights to utilize the contributed patent technology within the United States and Canada.Operational Synergy: The partnership includes a priority procurement clause, ensuring the joint venture utilizes Kehui's high-quality power products when they meet competitive market standards.\n• Capital Investment: E-Power will provide $1.5 million USD in cash to fund the initial registration and establishment of the joint venture.\n• Technological Integration: Kehui International will contribute its proprietary \"Synchronous Constant Frequency Microgrid\" patents and provide ongoing technical support.\n• Third-Party Valuation: The investment value of the patents used for the initial investment shall be determined by a third-party appraisal agency recognized by both parties, and the investment ratio shall be assessed by both parties.\n• Market Scope: The joint venture holds exclusive rights to utilize the contributed patent technology within the United States and Canada.\n• Operational Synergy: The partnership includes a priority procurement clause, ensuring the joint venture utilizes Kehui's high-quality power products when they meet competitive market standards."},{"time":"09:27","ticker":"WIRES","headline":"On The Wires","body":"• Willdan Group (WLDN) has been selected by the City of San Diego to implement a $112 million energy savings performance contract. This contract supports energy and water efficiency across 40 city facilities, decarbonizes 23 of those facilities, and upgrades 39,000 city-owned streetlight fixtures. The resulting projects will include electrification measures, battery energy storage systems, electrification for HVAC and water heating systems, and solar infrastructure.\n• Rheem and ecobee, a subsidiary of Generac (GNRC), announce a partnership to launch the ecobee Smart Thermostat Lite | Works with EcoNet Technology. This innovative solution delivers energy savings, seamless compatibility, and enhanced convenience for homeowners and contractors.\n• Diana Shipping (DSX) announces that, through a separate wholly-owned subsidiary, it has entered into a time charter contract with Nippon Yusen Kabushiki Kaisha, Tokyo, for one of its Post-Panamax dry bulk vessels, the m/v Phaidra. The gross charter rate is US$14,500 per day, minus a 5.00% commission paid to third parties, for a period until minimum February 20, 2027 up to maximum April 20, 2027. The charter is expected to commence on February 24, 2026. The m/v Phaidra is currently chartered, as previously announced, at a gross charter rate of US$9,750 per day, minus a 5.00% commission paid to third parties. The \"Phaidra\" is an 87,146 dwt Post-Panamax dry bulk vessel built in 2013. The employment of \"Phaidra\" is anticipated to generate a total of approximately US$5.18 million of gross revenue for the minimum scheduled period of the time charter."},{"time":"09:27","ticker":"SMX","headline":"SMX (Security Matters) Plc announced that the reverse stock split of ordinary shares will begin trading on adjusted basis giving effect to the reverse stock split on February 17, 2026","body":"• On May 2, 2025, the Company's Shareholders approved a proposal to amend the Company's constitution to allow the Company's Board of Director's to consolidate and/or divide all or any of the Company's classes of shares as the Board of Directors sees fit. As such, Shareholder approval was not required to effect the reverse stock split.\n• The Company's Board of Directors' fixed the split ratio at 4.8828125:1, every 4.8828125 ordinary shares of the Company with a nominal value of $0.00000000002502543568 per share will be automatically combined into one (1) ordinary share with a nominal value of $0.00000000012219451015625 per share. This will reduce the number of outstanding ordinary shares of the Company from approximately 10 million to approximately 2 million."},{"time":"09:26","ticker":"CLRS","headline":"Clear Street Group files amended IPO prospectus, disclosing that it intends to offer 13.0 mln shares with a projected price range of $26-$28 per share","body":"• The company has been approved to list its Class A common stock on the Nasdaq Global Select Market.\n• The lead underwriters on the IPO are Goldman Sachs, BofA Securities, Morgan Stanley, UBS Investment Bank, and Clear Street."},{"time":"09:17","ticker":"LNVGY","headline":"Lenovo reports Q3 EPS of $4.44 versus $5.66 last year; revs +18% yr/yr to $22.2 bln","body":"• Co reported results for the third quarter of fiscal year 2025/26, a quarter that delivered record revenues, accelerated profitability, and continued AI revenue expansion. During the quarter, overall group revenue reached an all-time fiscal quarter high of $22.2 billion, up 18% year-on-year, with revenue from all business groups growing double-digit year-on-year. Excluding non-operating non-cash items and one-time gains and charges in Q3 FY24/25 and Q3 FY25/26, adjusted net income increased by 36% year-on-year to US$589 million, with adjusted net income margin expanding to 2.7%.\n• Despite industry-wide component supply shortages and rising costs, the PC and smart devices business enhanced its competitiveness with revenue growing 17% year-on-year, with PC volume outpacing the market for 10 consecutive quarters.\n• PC market share for the calendar year was the highest in Lenovo's history -- at 24.9%. Quarterly share was up one percentage point year-on-year to 25.2%, with Lenovo remaining the only company to ever have exceeded 25% global PC market share.\n• Potential related stocks: DELL, HPQ"},{"time":"09:14","ticker":"WIRES","headline":"On The Wires","body":"• Genasys Inc. (GNSS) announces a $2.0 million order to equip new Republic of Singapore Navy unmanned surface vessels with remotely operated LRAD 950NXTs. Further orders are expected as the RSN expands its new USV fleet.\n• NordVPN has selected CrowdStrike (CRWD) to power its Threat Protection Pro feature, bringing industry-leading threat intelligence trusted by enterprises and governments to millions of consumers worldwide. Through this collaboration, CrowdStrike Threat Intelligence enhances NordVPN's ability to protect users against modern cyber threats with real-time, adversary-driven intelligence delivered in a simple, privacy-first experience.\n• PTC (PTC) announces that SPG Company, a global leader in licensed product design, development, manufacturing, and distribution, has selected PTC's FlexPLM retail product lifecycle management solution to modernize and support its end-to-end product lifecycle operations. With FlexPLM, SPG will replace its legacy PLM system with a scalable, cloud-based platform designed to support faster development cycles and more consistent product data.\n• State Street Corporation (STT) announces that Mariner, a privately held national financial services firm, will implement Charles River's Wealth Management Solution to streamline its operations and support its long-term growth strategy, including its goal of expanding to 5,000 advisors.\n• Mtron (MPTI) announces a follow-on order to the approximately $20 million production order from a major defense prime first announced in December 2025. This increases the total value of the two-year production contract supporting a major air defense program to nearly $24 million. The contract was expanded to include higher annual unit volumes, additional RF products, and a two-year production commitment, whereas prior orders for this program were limited to twelve-month purchase cycles."},{"time":"09:10","ticker":"WIRES","headline":"On The Wires","body":"• BlackSky Technology (BKSY) Gen-3 international momentum continues with a seven-figure Assured contract supporting an international defense customer. This Assured agreement extends the uncontested access to Gen-2 and Gen-3 imagery and AI-enabled analytics services over the country's priority areas of interest.\n• Comcast Advertising (CMCSA) announced a first of its kind partnership bringing deterministic-based measurement for TV and streaming to the travel & tourism industry at scale. The new solution connects Comcast's premium video viewing data to Adara's first-party booking data and revenue to deliver campaign insights and prove TV and streaming drive return on ad spend (ROAS) for advertisers. This comes at a time when attribution is more important than ever with fragmentation of screens and the need to close the TV advertising measurement gap.\n• Expensify (EXFY) announced an expanded partnership with Xero (XROLF) to deliver exclusive discounts and joint marketing campaigns that simplify operations for small businesses."},{"time":"09:09","ticker":"EBAY","headline":"eBay Canada has officially launched eBay Live","body":"• eBay Live is a livestream shopping experience that connects buyers with knowledgeable sellers in real time. Shoppers can ask questions, see items up close, and shop instantly-on mobile, desktop, or the eBay app.\n• First launched in the U.S. in 2022, eBay Live has since expanded to Australia, France, Germany, Italy and the U.K."},{"time":"09:08","ticker":"WRAPX","headline":"S&amp;P futures vs fair value: +24.00. Nasdaq futures vs fair value: +101.00.","body":"Equity futures continue to tick higher shortly before the open, with the major averages poised to reclaim yesterday's modest weakness. Initial jobless claims for the week ending February 7 decreased by 5,000 to 227,000 (Briefing.com consensus: 230,000). Continuing jobless claims for the week ending January 31 increased by 21,000 to 1.862 million.The key takeaway from the report is its steady messaging that layoff activity is low and that hiring activity is slow."},{"time":"09:07","ticker":"CME","headline":"CME Group names slate of director nominees","body":"CHICAGO, Feb. 12, 2026 /PRNewswire/ -- CME Group Inc., the world's leading derivatives marketplace, today announced its slate of candidates for its board of directors for election at the company's annual meeting to be held Thursday, May 14, 2026.Click here for full release."},{"time":"09:06","ticker":"SON","headline":"Sonoco Products appoints Craig Nix to its Board of Directors; he currently serves as Chief Financial Officer of First Citizens BancShares (FCNCA)","body":"• Mr. Nix is an independent member of the Board and will stand for election at the Company's next scheduled Annual General Meeting.\n• He joins the Company's Audit Committee and the Financial Policy Committee."},{"time":"09:06","ticker":"TRON","headline":"Tron Inc. expands TRX treasury to over 681.2 mln TRX tokens","body":"• Co announced expansion of its TRON (TRX) treasury, reinforcing its position as the world's largest publicly traded TRON (TRX) treasury strategy company and signaling strong long-term conviction in the TRON ecosystem.\n• The Company acquired approximately 181,346 TRX tokens on February 11 at an average price of approximately $0.28, and has added approximately 3,656,868 TRX tokens since January 22, bringing total TRX treasury holdings to more than 681.2 million TRX tokens underscoring consistent execution of the Company's digital asset accumulation strategy. Tron Inc. intends to grow its TRX treasury holdings through disciplined daily purchases of approximately $50,000 worth of TRX for 360 consecutive days. Management believes this strategy positions the Company to capitalize on long-term network adoption, expanding on-chain activity, and increasing institutional interest in TRON as a global blockchain infrastructure."},{"time":"09:06","ticker":"KNX","headline":"Knight-Swift announces an increase in quarterly cash dividend","body":"• Co announced today that its board of directors has declared the Company's quarterly cash dividend of $0.20 per share of common stock, which is a $0.02 increase from the Company's existing quarterly dividend of $0.18 per share of common stock.\n• The Company has raised its quarterly dividend annually for seven consecutive years for a 233% overall increase. The Company's quarterly dividends are pursuant to a cash dividend policy approved by the Board. The actual declaration of future cash dividends, and the establishment of record and payment dates, is subject to final determination by the Board each quarter after its review of the Company's financial performance."},{"time":"09:05","ticker":"TTEK","headline":"Tetra Tech awarded $49 mln army contract","body":"• Co announced that the U.S. Army Corps of Engineers (USACE) Portland District awarded the Company a position on a 5-year multiple-award contract with a shared capacity of $49 million, to provide architectural and engineering (A-E) design services for critical navigation and water control infrastructure.\n• Under the 5-year contract, Tetra Tech engineers, scientists, and technical specialists will provide comprehensive design and technical services to optimize and improve the resilience of a wide range of essential structures such as locks, dams, levees, and flood zone management infrastructure. Our teams will plan, design, and perform advanced computer modeling for dam safety, migratory fish passage, flood risk management, inland and coastal navigation, and other civil works projects."},{"time":"09:05","ticker":"SABR","headline":"Sabre, Paypal (PYPL), and Mindtrip partner to deliver a next-generation agentic AI experience for travel","body":"• Cos announce a strategic partnership to deliver a next-generation agentic AI experience that reimagines how consumers discover, plan, book, and manage travel.\n• The collaboration unites Mindtrip's agentic consumer platform, PayPal's agentic commerce capabilities, and Sabre's unparalleled enterprise-grade travel technology and agentic AI expertise. Together, the companies are replacing today's fragmented multi-step booking processes with a single, intelligent experience that moves seamlessly from inspiration to action, with the product set to launch in Q2 2026."},{"time":"09:04","ticker":"PHG","headline":"Philips introduces InkSpace Imaging's Snuggle flexible pediatric MRI coil for its 3.0T MR systems, helping to enhance imaging precision, efficiency and comfort","body":"Recently cleared through the U.S. Food and Drug Administration 510(k) process, InkSpace Imaging developed the Snuggle coil to provide a more child-friendly alternative to traditional rigid devices."},{"time":"09:03","ticker":"PHG","headline":"Philips introduces InkSpace Imaging's Snuggle flexible pediatric MRI coil for its 3.0T MR systems","body":"• Co announces the availability of the InkSpace Imaging Snuggle pediatric body array coil for Philips 3.0T MRI systems. Designed specifically for pediatric patients, the Snuggle coil has been optimized and validated for use with Philips 3.0T MRI systems, bringing enhanced comfort for children and efficient, high-quality imaging for clinicians."},{"time":"09:00","ticker":"WRAPX","headline":"S&amp;P futures vs fair value: +26.00. Nasdaq futures vs fair value: +111.00.","body":"• In economic data: Japan's January PPI 0.2% m/m, as expected (last 0.1%); 2.3% yr/yr, as expected (last 2.4%) India's January CPI 2.75% (expected 2.40%; last 1.33%) Australia's February MI Inflation Gauge 5.0% (last 4.6%)\n• Japan's January PPI 0.2% m/m, as expected (last 0.1%); 2.3% yr/yr, as expected (last 2.4%)\n• India's January CPI 2.75% (expected 2.40%; last 1.33%)\n• Australia's February MI Inflation Gauge 5.0% (last 4.6%)\n• Japan's Nikkei: UNCH\n• Hong Kong's Hang Seng: -0.9%\n• China's Shanghai Composite: +0.1%\n• India's Sensex: -0.7%\n• South Korea's Kospi: +3.1%\n• Australia's ASX All Ordinaries: UNCH\n• In economic data: U.K.'s Q4 GDP 0.1% qtr/qtr (expected 0.2%; last 0.1%); 1.0% yr/yr (expected 1.2%; last 1.2%). December Industrial Production -0.9% m/m (expected -0.1%; last 1.3%); 0.5% yr/yr (expected 1.5%; last 2.3%). December Manufacturing Production -0.5% m/m (expected -0.2%; last 1.9%); 0.5% yr/yr (expected 1.8%; last 1.3%). December Construction Output -0.5% m/m (expected 0.5%; last -0.8%); -0.3% yr/yr (expected 0.0%; last -0.3%). Q4 Business Investment -2.7% qtr/qtr (expected 0.4%; last 1.6%); 2.0% yr/yr (last 2.5%). December trade deficit GBP22.72 bln (expected deficit of GBP22.30 bln; last deficit of GBP23.58 bln)\n• U.K.'s Q4 GDP 0.1% qtr/qtr (expected 0.2%; last 0.1%); 1.0% yr/yr (expected 1.2%; last 1.2%). December Industrial Production -0.9% m/m (expected -0.1%; last 1.3%); 0.5% yr/yr (expected 1.5%; last 2.3%). December Manufacturing Production -0.5% m/m (expected -0.2%; last 1.9%); 0.5% yr/yr (expected 1.8%; last 1.3%). December Construction Output -0.5% m/m (expected 0.5%; last -0.8%); -0.3% yr/yr (expected 0.0%; last -0.3%). Q4 Business Investment -2.7% qtr/qtr (expected 0.4%; last 1.6%); 2.0% yr/yr (last 2.5%). December trade deficit GBP22.72 bln (expected deficit of GBP22.30 bln; last deficit of GBP23.58 bln)\n• STOXX Europe 600: +0.1%\n• Germany's DAX: +1.4%\n• U.K.'s FTSE 100: +0.1%\n• France's CAC 40: +0.9%\n• Italy's FTSE MIB: +0.5%\n• Spain's IBEX 35: -0.1%"},{"time":"08:36","ticker":"NEOV","headline":"NeoVolta raises approximately $23 million in gross proceeds through two financing transactions in December 2025 and January 2026 to support working capital requirements and fund the Company's capital commitments to NeoVolta Power, a 2 GWh battery energy storage system manufacturing joint venture in Georgia","body":"• NeoVolta holds a 60% controlling interest in the joint venture, which is advancing rapidly toward mass production expected in mid-2026. The Company has completed its initial $7 million capital contribution to the joint venture, representing the first of three funding milestones under the joint venture agreements.\n• The financing proceeds substantially de-risk NeoVolta's near-term capital obligations while ensuring adequate working capital to support the Company's core residential and commercial energy storage business as it scales operations."},{"time":"08:36","ticker":"PLBY","headline":"Playboy, Inc. announces the engagement of international investor relations specialists MZ Group to lead a strategic investor relations and financial communications program across all key markets","body":"• MZ will work closely with Playboy management to develop and implement a comprehensive capital markets strategy designed to increase Playboy's visibility throughout the investment community. The initiative will highlight how Playboy is leveraging its 72 years of iconic cultural heritage and global recognition to build a diversified, high margin, asset light business focused on licensing, media and experiences, and hospitality. Combined with an increasingly robust balance sheet, initiatives including the recent deal to sell 50% of its China licensing business, the re-launch of its magazine to maintain brand mindshare, and a planned Miami Beach membership club are accelerating growth and revenue.\n• MZ has developed a distinguished reputation as a premier resource for institutional investors, brokers, analysts, and private investors. Lucas A. Zimmerman, Managing Director at MZ, and Ian Scargill, Director, will provide guidance to Playboy on corporate and financial communications, including roadshow and investment conference coordination in key financial hubs and enhancing brand visibility through financial and social media channels."},{"time":"08:36","ticker":"VZLA","headline":"Vizsla Silver provides security and operations update; five colleagues remain unaccounted for","body":"• Co provides a further update on the situation in Concordia and the steps it is taking to support the affected families and its colleagues.\n• Co regrettably confirms that five colleagues remain unaccounted for. Co remains focused on supporting affected families and staying closely engaged with the relevant authorities as efforts continue.\n• In addition to cooperating fully with Mexican authorities as their investigation and search continues, the company is thoroughly reviewing the circumstances surrounding recent tragic events."},{"time":"08:36","ticker":"MBOT","headline":"Microbot Medical Medical's LIBERTY endovascular robotic system highlighted at a leading vascular disease management conference","body":"• Co announced that LIBERTY was featured at the International Symposium on Endovascular Therapy conference, which took place February 9-12, 2026, in Miami Beach, Florida. The International Symposium on Endovascular Therapy brings together current and emerging endovascular experts to examine new techniques, technologies, and procedures that advance patient care.\n• During a Town Hall session, titled Advances in Endovascular Robotics: Will There be a Role in the Future?, which included leading interventional radiologists, interventional cardiologists, and vascular surgeons discussing real-world clinical experience, one of the featured agenda items focused on the future of single-use handheld vascular robots, which specifically highlighted the LIBERTY Endovascular Robotic System. The LIBERTY System, the only FDA cleared, single-use endovascular robotic system, was discussed prominently, highlighting its seamless workflow integration and features, which the Company believes will be key drivers for broader adoption and shape the next phase of peripheral endovascular intervention. As procedures become more complex and operator demands are expected to continue to grow, robotic assistance offers a potential solution to challenges many clinicians face daily."},{"time":"08:34","ticker":"WRAPX","headline":"S&amp;P futures vs fair value: +20.00. Nasdaq futures vs fair value: +81.00.","body":"The S&P 500 futures currently trade 20 points above fair value. Just released, initial jobless claims for the week ending February 7 decreased by 5,000 to 227,000 (Briefing.com consensus: 230,000). The prior level was upwardly revised to 232K from 231K. Continuing jobless claims for the week ending January 31 increased by 21,000 to 1.862 million, from a downwardly revised 1.841 million (from 1.844 million)."},{"time":"08:34","ticker":"HUHU","headline":"HUHUTECH International Group Inc. releases 2026 letter to shareholders from the Chair","body":"Wuxi, China, Feb. 12, 2026 (GLOBE NEWSWIRE) -- HUHUTECH International Group Inc. (Nasdaq: HUHU) (the \"Company\" or \"HUHUTECH\"), a professional provider of factory facility management and monitoring systems, today released the following letter to shareholders from Ms. Yinglai Wang, Director and Chairperson of the Board.Click here for full release."},{"time":"08:34","ticker":"PMI","headline":"Picard Medical/ SynCardia highlights successful bridge-to-transplant case at UCSF Health Using the SynCardia total artificial heart","body":"Successful heart transplant case following an implanted SynCardia total artificial heart reported at hospital with one of the largest heart transplant programs in the country."},{"time":"08:34","ticker":"FISV","headline":"Fiserv introduces INDX, a real-time cash settlement platform for digital asset companies","body":"• Co announces the launch of INDX, a real-time cash settlement platform that helps digital asset companies securely store and transfer US dollars in real-time 24x7x365.\n• With INDX, digital asset companies can leverage a single custodial account that benefits from up to $25 mln of FDIC insurance, delivering a safer and more durable solution to store and transfer real USD.\n• Rather than routing funds outside of traditional banking systems or pushing funds on-chain, INDX is redefining fiat operations for digital asset companies by distributing their funds across the Fiserv Deposit Network, an ecosystem of more than 1,100 insured US-based financial institutions. This keeps cash securely off-chain while delivering the real-time settlement speed and flexible operating windows demanded by digital asset companies."},{"time":"08:33","ticker":"NVTS","headline":"Navitas Semiconductor unveils 5th generation SiC trench-assisted planar technology","body":"• Co announces the launch of its 5th-generation GeneSiC technology platform. The High Voltage (HV) SiC Trench-Assisted Planar (TAP) MOSFET technology represents a significant technological leap over previous generations and will deliver an industry leading 1200V line of MOSFETs. It complements Navitas' ultra-high voltage (UHV) 2300 V and 3300 V technologies from the 4th generation GeneSiC platform, extending Navitas' lead in AI data centers, grid and energy infrastructure, and industrial electrification."},{"time":"08:33","ticker":"WAVE","headline":"Eco Wave Power Global AB reports continued strong wave energy production at Jaffa Port, Israel during January 2026","body":"• During January 2026, the EWP-EDF One system continued to demonstrate stable and reliable operation under real-world sea conditions. Over approximately 11 days characterized by wave heights ranging between 1 and 2 meters, the project generated more than 2,300 kWh of clean, renewable electricity.\n• Performance data collected during January 2026 further supports the scalability of Eco Wave Power's proprietary technology. Future commercial projects are planned to utilize significantly larger floaters and a substantially greater number of units. These configurations are expected to materially enhance energy capture, improve capacity factors, and deliver a more powerful and stable production profile compared to pilot-scale installations."},{"time":"08:32","ticker":"AME","headline":"Ametek approves a 10% increase in its quarterly dividend to $0.34/sh from $0.31/sh","body":""},{"time":"08:32","ticker":"AENT","headline":"Alliance Entertainment and handmade by robots to showcase expanding collectibles portfolio at New York Toy Fair 2026","body":"PLANTATION, Fla., Feb. 12, 2026 (GLOBE NEWSWIRE) -- Alliance Entertainment Holding Corporation (NASDAQ: AENT), a leading distributor and omnichannel fulfillment partner for entertainment and pop culture collectibles, announced today that it will exhibit at the New York Toy Fair (NYTF), taking place February 14--17, 2026 at the Jacob K. Javits Convention Center in New York City. The Company will showcase its expanding licensed collectibles portfolio, including a featured presentation of Handmade by Robots, its distinctive vinyl figure brand known for its proprietary \"knit-look\" aesthetic.Click here for full release."},{"time":"08:30","ticker":"ECONX","headline":"Weekly Continuing Claims 1.862 mln --- prior revised to 1.841 mln from 1.844 mln","body":""},{"time":"08:30","ticker":"ECONX","headline":"Weekly Initial Claims 227K vs. 230K Briefing.com consensus; prior revised to 232K from 231K","body":""},{"time":"08:28","ticker":"FDX","headline":"FedEx provides updates ahead of Investor Day today; outlines four strategic priorities; prioritizing premium growth in high-margin verticals; guides FebQ EPS above consensus; sets FY29 targets","body":"• Co announces at its 2026 Investor Day that, looking ahead, FedEx is prioritizing premium growth in high-margin verticals, scaling its digital and AI capabilities, and further transforming its network to drive significant profit improvement and stockholder value creation.\n• \"For over five decades, FedEx has built one of the world's most reliable and valuable industrial networks powering global trade,\" said Raj Subramaniam, FedEx Corp. president and chief executive officer. \"FedEx is now entering a new era as we build the most flexible, efficient, and intelligent network in history. Our vision is simple: to make supply chains smarter for everyone.\"\n• The company outlined four strategic priorities to continue its transformation and achieve its financial goals: Grow in High-Margin Verticals: Co will focus its commercial strategy on premium B2B and specialized B2C segments where customers value speed, precision, visibility, and reliability. Key target industries include healthcare, automotive, aerospace, data centers, and the premium end of e-commerce. Build on Data & Technology Advantage: Leveraging the two petabytes of data processed daily and its unparallelled physical network, FedEx will scale its digital backbone, AI, and automation to enhance customer value, improve network planning, and unlock new revenue streams. Transform the Network: FedEx will continue to modernize and optimize its integrated air and surface networks. This includes evolving its Tricolor air network strategy and advancing Network 2.0, both of which enable flexibility, increase asset utilization, and reduce structural costs while improving the customer experience. Additionally, Europe remains the company's largest long-term international value-creation opportunity. Deliver Ongoing Efficiency Gains: FedEx will continue to embed the One FedEx operating model, powered by the DRIVE process, to support durable value creation and enhanced profitability.\n• Grow in High-Margin Verticals: Co will focus its commercial strategy on premium B2B and specialized B2C segments where customers value speed, precision, visibility, and reliability. Key target industries include healthcare, automotive, aerospace, data centers, and the premium end of e-commerce.\n• Build on Data & Technology Advantage: Leveraging the two petabytes of data processed daily and its unparallelled physical network, FedEx will scale its digital backbone, AI, and automation to enhance customer value, improve network planning, and unlock new revenue streams.\n• Transform the Network: FedEx will continue to modernize and optimize its integrated air and surface networks. This includes evolving its Tricolor air network strategy and advancing Network 2.0, both of which enable flexibility, increase asset utilization, and reduce structural costs while improving the customer experience. Additionally, Europe remains the company's largest long-term international value-creation opportunity.\n• Deliver Ongoing Efficiency Gains: FedEx will continue to embed the One FedEx operating model, powered by the DRIVE process, to support durable value creation and enhanced profitability.\n• Co issues upside guidance for Q3 (Feb), co says it expects adjusted EPS to \"exceed consensus,\" vs. $4.01 FactSet Consensus.\n• Co also provides FY29 targets: ~$98 bln, or +4% CAGR; ~8% operating margin; ~$8 bln operating income (~14% non-GAAP CAGR); Capex-to-revenue ratio of ~4% of revenue; adjusted free cash flow of ~$6 bln.The expected ~$3 bln increase in operating income is driven by targeted strategies across FedEx's realigned reporting segments (new segments to be effective following the planned spin-off of FedEx Freight on June 1, 2026):U.S. Domestic: Targeting a 10% operating margin in 2029 (GAAP up ~150 bp, non-GAAP up ~110 bp). Operating income growth will be driven by executing Network 2.0 and One FedEx initiatives and growing revenue from disciplined pricing and B2B and premium B2C volume.International: Targeting an 8% operating margin in 2029 (GAAP up ~450 bp, non-GAAP up ~440 bp). Key drivers include continued improvement in European performance, growth in premium cross-border and intercontinental lanes, and benefits from the Tricolor airfreight strategy.\n• The expected ~$3 bln increase in operating income is driven by targeted strategies across FedEx's realigned reporting segments (new segments to be effective following the planned spin-off of FedEx Freight on June 1, 2026):U.S. Domestic: Targeting a 10% operating margin in 2029 (GAAP up ~150 bp, non-GAAP up ~110 bp). Operating income growth will be driven by executing Network 2.0 and One FedEx initiatives and growing revenue from disciplined pricing and B2B and premium B2C volume.International: Targeting an 8% operating margin in 2029 (GAAP up ~450 bp, non-GAAP up ~440 bp). Key drivers include continued improvement in European performance, growth in premium cross-border and intercontinental lanes, and benefits from the Tricolor airfreight strategy.\n• U.S. Domestic: Targeting a 10% operating margin in 2029 (GAAP up ~150 bp, non-GAAP up ~110 bp). Operating income growth will be driven by executing Network 2.0 and One FedEx initiatives and growing revenue from disciplined pricing and B2B and premium B2C volume.\n• International: Targeting an 8% operating margin in 2029 (GAAP up ~450 bp, non-GAAP up ~440 bp). Key drivers include continued improvement in European performance, growth in premium cross-border and intercontinental lanes, and benefits from the Tricolor airfreight strategy.\n• Co says the planned spin-off of FedEx Freight into a new publicly traded company is on track for June 1, 2026."},{"time":"08:24","ticker":"BHF","headline":"Brighthouse Financial announces that at a special meeting of stockholders, its common stockholders voted to adopt the previously announced definitive merger agreement under which an affiliate of Aquarian Capital LLC will acquire the company in an all-cash transaction valued at approximately $4.1 billion","body":"• Under the terms of the merger agreement, Brighthouse Financial's common stockholders will receive $70.00 in cash per share upon consummation of the transaction.\n• The transaction is expected to close in 2026 and remains subject to customary closing conditions and regulatory approvals."},{"time":"08:22","ticker":"WIRES","headline":"On The Wires","body":"• Ambev S.A. (ABEV) informs that, as per its today's earnings release, the Company expects Cash COGS per hectoliter, for its beer business in Brazil to increase between 4.5%-7.5% for the full year of 2026 (excluding the sale of non-Ambev products on the marketplace and assuming current commodities prices and exchange rates), primarily driven by commodity-related costs, especially aluminum, as well as portfolio mix.\n• Four Seasons Education (FEDU) announced it received a notification letter from the NYSE, informing the Company that it has regained compliance with NYSE continued listing standards. As previously disclosed, the Company received a letter from the NYSE notifying the Company that it had fallen below compliance with the requirement to maintain a minimum of 1,200 public stockholders on a continuous basis due to an average monthly trading volume of less than 100,000 shares.\n• ZenaTech (ZENA) has opened a Drone as a Service location within its Orlando-area business headquarters facility. This marks the 23rd global DaaS location."},{"time":"08:17","ticker":"WIRES","headline":"On The Wires","body":"• AgEagle Aerial Systems (UAVS) announced a procurement of an eBee TAC drone by an agency within the Malaysian government.\n• Comcast (CMCSA) announced the first homes and businesses in Bethlehem Township and Emmaus are now connected to high-speed, symmetrical Internet from America's smartest and most reliable converged network as part of an expansion that will ultimately reach more than 16,600 homes and businesses in the townships. Xfinity brings Internet, mobile, entertainment, and smart home services into one simple, seamless solution -- giving customers more speed, savings, and control over their connected lives. Bethlehem Township and Emmaus now join the nearly 65 million homes and businesses nationwide with access to a network that fuels innovation, productivity, and everyday connection."},{"time":"08:16","ticker":"ASC","headline":"Ardmore Shipping announces financial results for the three months ended December 31, 2025; declares lower dividend","body":"HAMILTON, Bermuda, Feb. 12, 2026 /PRNewswire/ -- Ardmore Shipping Corporation (NYSE: ASC) (\"Ardmore\", the \"Company\" or \"we\") today announced results for the three and twelve months ended December 31, 2025. Consistent with the Company's variable dividend policy of paying out dividends on its shares of common stock equal to one-third of Adjusted earnings, Board declared a cash dividend on February 12, 2026 of $0.09 per common share (previously $0.10 per share). Click here for full release."},{"time":"08:12","ticker":"EVLV","headline":"Evolv Technologies Holdings announces the appointment of Henrik Khl as a new independent director","body":"• Co announced the appointment of Mr. Henrik Khl, age 46, to its Board of Directors effective February 12, 2026. Khl will also serve on the Board's Audit Committee. The Board affirmatively determined that Khl is independent and an audit committee financial expert as that term is defined by applicable Securities and Exchange Commission regulations.\n• Khl is an accomplished leader with over 25 years of experience in corporate development and strategy. He currently serves as Senior Vice President, Strategy & Corporate Development at Axon (AXON). In this role, Khl drives strategic growth and innovation, oversees mergers and acquisitions, facilitates minority investments, forms strategic partnerships, and optimizes capital allocation and structure."},{"time":"08:11","ticker":"XRX","headline":"Xerox distributes pro rata warrants to enhance shareholder value and accelerate deleveraging","body":"• As previously announced, holders of record of Xerox common stock as of February 9, 2026 (the \"Record Date\") received one (1) Warrant for every two (2) shares of Xerox common stock held, rounded down to the nearest whole Warrant. Holders of record of Xerox's 3.75% Convertible Senior Notes due 2030 and Series A Convertible Perpetual Voting Preferred Stock as of the Record Date also received Warrants on a pass-through basis in accordance with the terms governing such securities.\n• \"This action is part of a deliberate sequence of steps we are taking to leverage fit-for-purpose financing structures and instruments designed to strengthen our balance sheet and improve our capital structure in support of our long-term objective of creating sustainable shareholder value,\" said Louie Pastor, president and chief operating officer at Xerox. \"The pro-rata warrant distribution reinforces our focus on enhancing liquidity and accelerating deleveraging as we continue to see improving operating trends and integration progress.\""},{"time":"08:11","ticker":"BLFS","headline":"BioLife Solutions has entered into a multi-year supply agreement with Qkine Limited under which BioLife will distribute certain cytokine and growth factor products manufactured by Qkine for use in cell and gene therapy manufacturing","body":"The agreement provides BioLife with exclusive worldwide distribution rights to specific Qkine products for the CGT market and non-exclusive rights to Qkine products in the CGT market. In addition, the companies intend to collaborate on a process development and validation program to enable Qkine to package certain of its products using BioLife's proprietary CellSeal Connect vial system, which is designed to be incorporated into closed system and/or automated CGT workflows."},{"time":"08:10","ticker":"HTFL","headline":"Heartflow expands GAMEFILM registry to NBA and NHL alumni","body":"• Co announces a significant expansion of its groundbreaking GAMEFILM Registry. Building on a successful initial phase enrolling retired National Football League (NFL) athletes, the study will now extend to include former players from the National Basketball Association (NBA) and the National Hockey League (NHL), broadening Heartflow's initiative to protect the heart health of professional athletes across major sports.\n• The expansion of the GAMEFILM registry will deepen understanding of how high-performance sports impact heart health over time. This data is expected to contribute significantly to the development of tailored screening protocols, preventative strategies, and personalized treatment plans."},{"time":"08:10","ticker":"TW","headline":"Tradeweb Markets and MAXEX announce a commercial collaboration with the goal of expanding access to the institutional marketplace for U.S. residential mortgages","body":"• Tradeweb has also made a strategic investment in MAXEX; financial terms were not disclosed.\n• Tradeweb and MAXEX plan to collaborate to advance a more centralized, transparent and institutionally scalable market for U.S. residential mortgage loans -- one of the largest segments of global private credit. As part of this strategic collaboration, Tradeweb plans to connect its global network of over 3,000 clients to MAXEX's network of approximately 400 mortgage lenders and more than three dozen premier institutional investors. By integrating MAXEX's centralized exchange and clearinghouse with Tradeweb's electronic trading, data and workflow capabilities, this collaboration aims to enhance efficiency, transparency and liquidity in residential private credit while complementing the role of the GSEs.\n• MAXEX operates a centralized, end-to-end digital exchange purpose-built for institutional trading of residential whole loans. The firm addresses the mortgage market's long-standing fragmentation and operational complexity through standardized contracts, centralized clearing and settlement, and seamless electronic execution. MAXEX has facilitated loan sales into more than 250 private-label securitizations as well as to the market's leading portfolio investors and is one of the most active expeditors of private mortgage loan liquidity in the U.S.\n• The collaboration will also extend Tradeweb's mortgage footprint beyond agency mortgage-backed securities (MBS), including the TBA and specified pool markets, into the rapidly growing private residential credit ecosystem, where institutional demand for high-quality, yield-generating assets continues to accelerate."},{"time":"08:09","ticker":"PUBM","headline":"PubMatic appoints John Petralia as Chief Marketing Officer","body":"Petralia brings more than 25 years of marketing leadership experience, scaling growth across advertising technology and enterprise platforms. Most recently, he served as Chief Marketing Officer for Enterprise at Coursera (COUR), where he led marketing for the company's B2B education platform. Previously, he was VP of Marketing at The Trade Desk (TTD), building global acquisition marketing during a pivotal growth phase. Earlier in his career, he spent nearly seven years at Bloomberg, leading marketing for data analytics and media businesses."},{"time":"08:08","ticker":"AARD","headline":"Aardvark Therapeutics Announces establishment of new U.S. subsidiary to support development of its dermatology pipeline; Bryan Jones named Chief Executive Officer","body":"• Ardia will support development of a new dermatology pipeline focused on lead asset, DIA-615, a potential topical treatment for a variety of inflammatory skin diseases, including psoriasis. Bryan Jones, Ph.D., has been named Chief Executive Officer of Ardia and has transitioned out of his current role at Aardvark as Chief Operating Officer to lead Ardia.\n• Dr. Jones joined Aardvark in 2021 as Chief Business Officer and transitioned to Chief Operating Officer in August 2022."},{"time":"08:08","ticker":"FICO","headline":"Fair Isaac and MeridianLink partner to expand access to FICO Mortgage Direct License Program","body":"• Co announces a strategic partnership with MeridianLink, a leading provider of lending software for financial institutions. Through this collaboration, the FICO Mortgage Direct License Program will be integrated into MeridianLink's platform, allowing supported resellers to generate and deliver FICO Scores directly within the workflow they already use."},{"time":"08:08","ticker":"GETY","headline":"Getty Images announces the renewal of its long-standing partnership with NASCAR, extending its role as NASCAR's Official Photography Partner, a designation it has held since 2006","body":"The agreement sees Getty Images' team of specialized motorsport photographers deliver high-quality imagery from all races and events in the NASCAR series, including NASCAR Cup Series, NASCAR O'Reilly Auto Parts Series, and NASCAR CRAFTSMAN Truck Series. With exclusive, behind-the-scenes access, Getty Images' dedicated motorsports team will deliver real-time, rights-cleared imagery from every race weekend, ensuring NASCAR and its partners have immediate access to high-quality visual content for broadcast, digital, commercial and editorial use."},{"time":"08:07","ticker":"VRCA","headline":"Verrica Pharmaceuticals appoints Chris Chapman as its Chief Commercial Officer","body":"Prior to his roles with Dermavant and Organon (OGN), Mr. Chapman served as Vice President & General Manager, U.S. Prescription Business for Galderma (GALDY), where he led the U.S. Prescription Business. Prior to Galderma, Chris spent 20 years in commercial roles at Pfizer (PFE), where he led the U.S. Pharmaceutical Contracting and Pricing Organization."},{"time":"08:06","ticker":"LDOS","headline":"Leidos to launch next phase of DODNet transformation through accelerated migration of defense agencies","body":"• Over the next 18 months, Leidos is expected to transition more than 100,000 users to DODNet including the Defense Finance and Accounting Service, Defense Logistics Agency, Defense Manpower Data Center, Defense Media Activity, Defense Threat Reduction Agency, and Missile Defense Agency.\n• This next phase of accelerated migration marks a significant step forward in the $11.5 billion, 10-year Defense Enclave Services program."},{"time":"08:06","ticker":"SLB","headline":"SLB awarded multiple offshore drilling contracts by Mubadala Energy for Tangkulo deepwater development in Indonesia","body":"• Co has been awarded multiple offshore drilling services contracts by Mubadala Energy, the Abu Dhabi headquartered international energy company, for the Tangkulo natural gas deepwater development and associated exploration and appraisal drilling activities in the Andaman Sea, offshore Indonesia.\n• Under the awards, SLB will work with Mubadala Energy to deliver integrated drilling and well services across the full well life cycle. The scope includes directional drilling, drilling fluids, cementing, wireline, slickline, coiled tubing, well testing, mud logging and upper and lower completions. The integrated model is designed to streamline execution while enhancing safety, reliability and operational performance.\n• First gas targeted before the end of 2028, supporting Indonesia's long-term energy security."},{"time":"08:05","ticker":"FMCC","headline":"Freddie Mac reports Q4 results","body":"• Net interest income for the fourth quarter of 2025 was $5.5 bln, up 10% year-over-year, primarily driven by continued mortgage portfolio growth and lower funding costs, partially offset by lower yields on short-term investments. Non-interest income for the fourth quarter of 2025 was $0.2 bln, compared to $1.3 bln for the fourth quarter of 2024, primarily driven by a shift to net investment losses for the fourth quarter of 2025 from net investment gains for the fourth quarter of 2024. Net revenues of $5.8 bln, a decrease of 9% year-over-year, driven by lower non-interest income, partially offset by higher net interest income.\n• Provision for credit losses was $0.1 bln for the fourth quarter of 2025, primarily driven by a credit reserve build in Multifamily, partially offset by a credit reserve release in Single-Family."},{"time":"08:05","ticker":"ORCL","headline":"Oracle awarded an $88 mln firm-fixed price task order by The United States Department of the Air Force to provide Oracle Cloud Infrastructure services for the Air Force Cloud One program","body":"• The Department of War can now access Oracle Cloud Infrastructure technologies, including Oracle AI Database 26ai.\n• Under the program, mission owners can also take advantage of DoW security services such as the Secure Cloud Computing Architecture to better meet the boundary protection needs of the Defense Information Systems Network.\n• They can also leverage Oracle AI Database 26ai on OCI to securely combine organization-specific information and public information when running agentic AI workflows to securely generate sophisticated answers and perform actions autonomously."},{"time":"08:04","ticker":"BONDX","headline":"Overnight Treasury Market Summary","body":"• U.S. Treasuries are on track for a slightly higher start after a quiet upward drift during overnight trade in the futures market. The slight upward bias persisted through the night while other sovereign debt was largely little changed. Australia's debt underperformed amid expectations for accelerating inflation while longer-dated JGBs outperformed, sending yields on 20-, 30-, and 40-yr bonds to levels seen in early January. The overnight data flow was on the light side, but it is worth noting that the U.K.'s GDP report for Q4 (0.1%; expected 0.2%) was a touch light relative to expectations due to weak industrial production in December (-0.9%; expected -0.1%). The U.S. session will see the release of the latest jobless claims report and the U.S. Treasury will sell $25 bln in 30-yr bonds this afternoon. Crude oil holds a slim loss while the U.S. Dollar Index is up 0.1% at 96.92.\n• Yield Check: 2-yr: -1 bp to 3.50% 3-yr: -1 bp to 3.56% 5-yr: -2 bps to 3.72% 10-yr: -1 bp to 4.16% 30-yr: -2 bps to 4.79%\n• 2-yr: -1 bp to 3.50%\n• 3-yr: -1 bp to 3.56%\n• 5-yr: -2 bps to 3.72%\n• 10-yr: -1 bp to 4.16%\n• 30-yr: -2 bps to 4.79%\n• News: There was growing speculation that the Bank of Korea will launch a quantitative easing program. Reserve Bank of Australia Governor Bullock defended the RBA's recent rate hike in a parliamentary testimony. French President Macron urged EU leaders to come up with a plan to improve competitiveness by the summer. Japan's January PPI was up 0.2% m/m, as expected (last 0.1%), rising 2.3% yr/yr, as expected (last 2.4%). India's January CPI was up 2.75% (expected 2.40%; last 1.33%). Australia's February MI Inflation Gauge accelerated to 5.0% from 4.6%. U.K.'s Q4 GDP expanded 0.1% qtr/qtr (expected 0.2%; last 0.1%), growing 1.0% yr/yr (expected 1.2%; last 1.2%). December Industrial Production was down 0.9% m/m (expected -0.1%; last 1.3%) but up 0.5% yr/yr (expected 1.5%; last 2.3%). December Manufacturing Production was down 0.5% m/m (expected -0.2%; last 1.9%) but up 0.5% yr/yr (expected 1.8%; last 1.3%). December Construction Output was down 0.5% m/m (expected 0.5%; last -0.8%), falling 0.3% yr/yr (expected 0.0%; last -0.3%). Q4 Business Investment decreased 2.7% qtr/qtr (expected 0.4%; last 1.6%) but was up 2.0% yr/yr (last 2.5%). December trade deficit reached GBP22.72 bln (expected deficit of GBP22.30 bln; last deficit of GBP23.58 bln).\n• There was growing speculation that the Bank of Korea will launch a quantitative easing program.\n• Reserve Bank of Australia Governor Bullock defended the RBA's recent rate hike in a parliamentary testimony.\n• French President Macron urged EU leaders to come up with a plan to improve competitiveness by the summer.\n• Japan's January PPI was up 0.2% m/m, as expected (last 0.1%), rising 2.3% yr/yr, as expected (last 2.4%).\n• India's January CPI was up 2.75% (expected 2.40%; last 1.33%).\n• Australia's February MI Inflation Gauge accelerated to 5.0% from 4.6%.\n• U.K.'s Q4 GDP expanded 0.1% qtr/qtr (expected 0.2%; last 0.1%), growing 1.0% yr/yr (expected 1.2%; last 1.2%). December Industrial Production was down 0.9% m/m (expected -0.1%; last 1.3%) but up 0.5% yr/yr (expected 1.5%; last 2.3%). December Manufacturing Production was down 0.5% m/m (expected -0.2%; last 1.9%) but up 0.5% yr/yr (expected 1.8%; last 1.3%). December Construction Output was down 0.5% m/m (expected 0.5%; last -0.8%), falling 0.3% yr/yr (expected 0.0%; last -0.3%). Q4 Business Investment decreased 2.7% qtr/qtr (expected 0.4%; last 1.6%) but was up 2.0% yr/yr (last 2.5%). December trade deficit reached GBP22.72 bln (expected deficit of GBP22.30 bln; last deficit of GBP23.58 bln).\n• Commodities: WTI Crude: -0.4% to $64.40/bbl Gold: -0.5% to $5075.90/ozt Copper: +0.2% to $5.978/lb\n• WTI Crude: -0.4% to $64.40/bbl\n• Gold: -0.5% to $5075.90/ozt\n• Copper: +0.2% to $5.978/lb\n• Currencies: EUR/USD: UNCH at 1.1872 GBP/USD: UNCH at 1.3629 USD/CNH: -0.1% to 6.8983 USD/JPY: +0.3% to 153.68\n• EUR/USD: UNCH at 1.1872\n• GBP/USD: UNCH at 1.3629\n• USD/CNH: -0.1% to 6.8983\n• USD/JPY: +0.3% to 153.68\n• Data out Today: 8:30 ET: Weekly Initial Claims (Briefing.com consensus 230,000; prior 231,000), and Continuing Claims (prior 1.844 mln) 10:00 ET: January Existing Home Sales (Briefing.com consensus 4.21 mln; prior 4.35 mln) 10:30 ET: Weekly natural gas inventories (prior -360 bcf)\n• 8:30 ET: Weekly Initial Claims (Briefing.com consensus 230,000; prior 231,000), and Continuing Claims (prior 1.844 mln)\n• 10:00 ET: January Existing Home Sales (Briefing.com consensus 4.21 mln; prior 4.35 mln)\n• 10:30 ET: Weekly natural gas inventories (prior -360 bcf)\n• Treasury Auctions: 13:00 ET: $25 bln 30-yr Treasury bond auction results\n• 13:00 ET: $25 bln 30-yr Treasury bond auction results"},{"time":"08:03","ticker":"IPGP","headline":"IPG Photonics beats by $0.25, beats on revs; guides Q1 EPS in-line, revs in-line; Authorizes new share repurchase program up to $100 mln of common stock","body":"• Reports Q4 (Dec) earnings of $0.46 per share, excluding non-recurring items, $0.25 better than the FactSet Consensus of $0.21; revenues rose 17.2% year/year to $274.5 mln vs the $252.31 mln FactSet Consensus.\n• Authorization of New Share Repurchase Program: The Board of Directors has authorized a new program to purchase up to $100 million of IPG common stock.\n• Co issues in-line guidance for Q1, sees EPS of $0.10-$0.40, excluding non-recurring items, vs. $0.22 FactSet Consensus; sees Q1 revs of $235-$265 mln vs. $245.57 mln FactSet Consensus."},{"time":"08:03","ticker":"ONCO","headline":"Onconetix to acquire Realbotix, USA-based, AI-powered humanoid robotics company","body":"• Realbotix LLC is Realbotix Corp's subsidiary that is focused on researching, designing, building and manufacturing AI-powered, highly customizable humanoid robotics. The robots are used for customer-facing roles in industries such as healthcare, education, hospitality and entertainment. Realbotix is a leader in embodied and physical AI with its patented technologies enabling lifelike expressions, vision, and social interaction. Its robots are known for their highly realistic human appearance and human-centric AI models.\n• Realbotix robots are unique in their ability to operate autonomously via various AI platforms and do not require teleopertions from a human Upon closing of the proposed transaction, Onconetix will acquire all the issued and outstanding equity interests of Realbotix in exchange for newly issued shares of common stock of Onconetix. Immediately following the closing of the transaction, Realbotix Parent will own between 75% and 90% of the fully diluted common shares of the combined company, depending upon Onconetoix's cash pooistion at closing.\n• Mr. Kiguel will become the CEO of the combined company following closing. Upon closing of the proposed transaction, Onconetix will acquire all the issued and outstanding equity interests of Realbotix in exchange for newly issued shares of common stock of Onconetix. Immediately following the closing of the transaction, Realbotix Parent will own between 75% and 90% of the fully diluted common shares of the combined company, depending upon Onconetoix's cash pooistion at closing. Mr. Kiguel will become the CEO of the combined company following closing.\n• The transaction is expected to close in the second half of 2026, and the combined company is expected to trade on Nasdaq."},{"time":"08:02","ticker":"CGNT","headline":"Cognyte Software announces that a national security agency in the Asia-Pacific region has signed a five-year subscription agreement initially valued at ~$1.5 mln annually","body":"• The agreement allows the customer to scale adoption of new innovations and capabilities over time, potentially growing its investment to $20+ million over the contract term.\n• The agency, which is responsible for safeguarding national security against terror and serious crime, is a long-standing Cognyte customer and has expanded its existing deployment with advanced proprietary AI analytics to identify hidden relations at scale. These additional capabilities enable the agency to uncover investigative insights that were not available before, strengthening threat detection, accelerating investigations and enhancing decision-making across complex operational environments.\n• The subscription agreement provides the agency with ongoing access to Cognyte's latest technology innovations, ensuring its investigative capabilities continue to evolve as threat landscapes change. The multi-year structure aligns Cognyte with the agency's long-term operational planning and reinforces Cognyte's platform as a foundational analytics layer supporting mission-critical national security operations."},{"time":"07:58","ticker":"MLCO","headline":"Melco Resorts &amp; Entertainment beats by $0.06, beats on revs","body":"• Reports Q4 (Dec) earnings of $0.16 per share, $0.06 better than the FactSet Consensus of $0.10; revenues rose 8.6% year/year to $1.29 bln vs the $1.27 bln FactSet Consensus."},{"time":"07:56","ticker":"WRAPX","headline":"S&amp;P futures vs fair value: +21.00. Nasdaq futures vs fair value: +78.00.","body":"• Applovin (APP 424.00, -32.81, -7.2%) beat EPS expectations by $0.29, beat revenue expectations, and guided Q1 revenues above consensus.\n• Cisco (CSCO 79.50, -6.04, -7.1%) beat EPS expectations by $0.02, beat on revenues, guided Q3 EPS in-line with revenues above consensus, raised FY26 guidance, and raised its dividend 2% to $0.42/share.\n• McDonald's (MCD 324.97, +1.76, +0.5%) beat EPS expectations by $0.07 and beat revenue expectations.\n• Microsoft (MSFT 405.87, +1.50, +0.4%) wants to reduce its reliance on OpenAI, according to Financial Times.\n• Longer-dated JGBs outperformed, sending yields on 20-, 30-, and 40-yr bonds to levels seen in early January.\n• Reserve Bank of Australia Governor Bullock defended the RBA's recent rate hike in a parliamentary testimony.\n• There was growing speculation that the Bank of Korea will launch a quantitative easing program.\n• Japan's January PPI 0.2% m/m, as expected (last 0.1%); 2.3% yr/yr, as expected (last 2.4%)\n• India's January CPI 2.75% (expected 2.40%; last 1.33%)\n• Australia's February MI Inflation Gauge 5.0% (last 4.6%)\n• The U.K.'s GDP report for Q4 was a touch light relative to expectations due to weak industrial production in December.\n• Siemens reported strong results and outlook while Mercedes-Benz reported pressure on margins and cautious guidance.\n• Hermes reported strong revenue growth for Q4.\n• French President Macron urged EU leaders to come up with a plan to improve competitiveness by the summer.\n• U.K.'s Q4 GDP 0.1% qtr/qtr (expected 0.2%; last 0.1%); 1.0% yr/yr (expected 1.2%; last 1.2%). December Industrial Production -0.9% m/m (expected -0.1%; last 1.3%); 0.5% yr/yr (expected 1.5%; last 2.3%). December Manufacturing Production -0.5% m/m (expected -0.2%; last 1.9%); 0.5% yr/yr (expected 1.8%; last 1.3%). December Construction Output -0.5% m/m (expected 0.5%; last -0.8%); -0.3% yr/yr (expected 0.0%; last -0.3%). Q4 Business Investment -2.7% qtr/qtr (expected 0.4%; last 1.6%); 2.0% yr/yr (last 2.5%). December trade deficit GBP22.72 bln (expected deficit of GBP22.30 bln; last deficit of GBP23.58 bln)"},{"time":"07:51","ticker":"PBR","headline":"Petrobras provides update on potential transaction with Braskem S.A. (BAK)","body":"• Petrobras informs that, at a meeting held on February 11, 2026, its Board of Directors, considering a potential transaction involving the transfer of shares of Braskem S.A. (BAK) held by NSP Investimentos S.A., a subsidiary of Novonor, to Shine I Fundo de Investimento em Direitos Creditrios de Responsabilidade Limitada (FIDC), approved that Petrobras will not exercise its Preemptive Rights and Tag Along Rights provided for in the current Braskem S.A. Shareholders' Agreement, considering the current stage of the ongoing negotiations, and authorized the Executive Board, within the assumptions presented, to take the necessary measures to implement this decision.\n• Material facts related to this matter will be promptly disclosed to the market, including, but not limited to, the moment when Petrobras receives notification containing the final terms of the Transaction."},{"time":"07:47","ticker":"CANG","headline":"Cango closed the $10.5 million equity investment and secured $65 million additional equity investments","body":"• Co announced that it closed the previously announced $10.5 million equity investment from Enduring Wealth Capital Limited, and entered into definitive agreements with entities wholly-owned by Mr. Xin Jin, Chairman of the Company, and Mr. Chang-Wei Chiu, a director of the Company, pursuant to which these entities agreed to make equity investments in the aggregate amount of US$65 million in the Company.\n• As previously announced, the Company entered into an investment agreement with EWCL on December 29, 2025, and recently issued 7 million Class B ordinary shares, each carrying 20 votes per share, to EWCL at US$1.50 per share (the \"Class B Investment\"). After closing, EWCL's beneficial ownership increased from approximately 2.81% to approximately 4.71% of the Company's total outstanding ordinary shares, and its voting power rose from approximately 36.68% to 49.71% of the total voting power."},{"time":"07:44","ticker":"YPF","headline":"YPF Soc. Anonima, Eni (E) and XRG sign joint development agreement advancing Argentina LNG","body":"• This large-scale integrated gas and liquefaction project will unlock Argentina's Vaca Muerta shale basin and help position the country as a long-term global LNG supplier. Argentina LNG is expected to deliver 12 million tons per annum (mtpa) of LNG capacity, via two floating LNG facilities with a capacity of 6 mtpa each. The project is designed to include production, processing, transportation, and LNG export infrastructure. The JDA marks another milestone for the project, establishing the workplan for the parties to progress through the next stage of development.\n• Under the agreement, the partners will commence Front-End Engineering Design (FEED) and related activities, including engineering, technical structuring and key commercial and financing workstreams."},{"time":"07:37","ticker":"SPHR","headline":"Sphere Entertainment Co. beats by $1.42, beats on revs","body":"• Reports Q4 (Dec) earnings of $1.23 per share, $1.42 better than the FactSet Consensus of ($0.19); revenues rose 27.9% year/year to $394.28 mln vs the $378.85 mln FactSet Consensus.\n• \"As we begin 2026, we remain focused on expanding Sphere's global footprint, including advancing our plans to bring Sphere to Abu Dhabi and National Harbor, and believe the Company is well-positioned for long-term growth.\""},{"time":"07:36","ticker":"BDC","headline":"Belden beats by $0.12, beats on revs; guides Q1 EPS in-line, revs above consensus; co will start reporting financials as a single segment","body":"• Reports Q4 (Dec) earnings of $2.08 per share, excluding non-recurring items, $0.12 better than the FactSet Consensus of $1.96; revenues rose 8.1% year/year to $720.12 mln vs the $697.4 mln FactSet Consensus.\n• Co issues guidance for Q1, sees EPS of $1.65-1.75, excluding non-recurring items, vs. $1.72 FactSet Consensus; sees Q1 revs of $675-690 mln vs. $660.92 mln FactSet Consensus.\n• Strategic Realignment: Effective January 1, 2026, Belden transitioned from a legacy business segment structure to a unified, functional operating model that applies across the enterprise, from executive leadership to its functional teams. In this model, the company is organized around core functions rather than separate businesses to align resources and accountability in support of our continued solutions transformation. As IT and OT networks increasingly converge, realigning its organizational structure enables co to sell and deliver converged solutions more efficiently and consistently. Reflecting this realignment, beginning next quarter co will report consolidated financials as a single segment while continuing to provide insights into key markets and verticals. This structure accelerates its solutions transformation within key verticals and allows co to bring integrated offerings to market faster to address customers' most pressing needs. These changes position Belden to unlock additional value for shareholders as our solutions transformation advances."},{"time":"07:34","ticker":"KELYA","headline":"Kelly Services reports fourth-quarter earnings with outlook","body":"TROY, Mich., Feb. 12, 2026 (GLOBE NEWSWIRE) -- Kelly (Nasdaq: KELYA, KELYB), a leading specialty talent solutions provider, today announced fourth-quarter and full-year 2025 earnings.Click here for full release."},{"time":"07:34","ticker":"ALKS","headline":"Alkermes Plc completes acquisition of Avadel Pharmaceuticals plc (AVDL), accelerating entry into sleep medicine market","body":"• Augments Alkermes' revenue growth profile and diversifies commercial portfolio with new high potential growth product, LUMRYZ (Sodium Oxybate) for extended-release oral suspension.\n• Expected to be accretive in 2026.\n• Positions the combined organization to accelerate innovation and leadership in development of treatments for sleep disorders and other neurological disorders.\n• Alkermes' financial expectations for 2026 will include certain expenses related to the transaction, including:In the first quarter of 2026, Alkermes will record transaction-related costs of $40 million.Alkermes will record approximately $180 million of LUMRYZ inventory fair value step-up, which will be expensed as cost of goods sold as the inventory is sold in 2026.\n• Alkermes will record approximately $1.5 billion of intellectual property related to LUMRYZ, which will be amortized over an expected life of 13 years.\n• Alkermes expects amortization of intangible assets to be in the range of $95 to $105 million in 2026.\n• Net interest expense is expected to be in the range of $75 to $85 million in 2026."},{"time":"07:33","ticker":"PHIN","headline":"PHINIA beats by $0.04, beats on revs; guides FY26 revs above consensus","body":"• Reports Q4 (Dec) earnings of $1.18 per share, excluding non-recurring items, $0.04 better than the FactSet Consensus of $1.14; revenues rose 6.7% year/year to $889 mln vs the $838.2 mln FactSet Consensus.\n• Co issues upside guidance for FY26, sees FY26 revs of +1-7% yr/yr to $3.52-3.72 bln vs. $3.52 bln FactSet Consensus.The Company's net earnings and adjusted EBITDA are projected to be $165 million to $195 million and $485 million to $525 million, respectively, with net earnings margin of 4.7% to 5.2% and adjusted EBITDA margin of 13.7% to 14.3%. The Company expects to generate $200 million to $240 million in adjusted free cash flow.\n• The Company's net earnings and adjusted EBITDA are projected to be $165 million to $195 million and $485 million to $525 million, respectively, with net earnings margin of 4.7% to 5.2% and adjusted EBITDA margin of 13.7% to 14.3%.\n• The Company expects to generate $200 million to $240 million in adjusted free cash flow."},{"time":"07:33","ticker":"BBIO","headline":"BridgeBio Pharma announces positive topline results from PROPEL 3, the global Phase 3 pivotal study of oral infigratinib in children living with achondroplasia","body":"• PROPEL 3 successfully met the primary endpoint of change from baseline in AHV at Week 52 (p<0.0001).\n• Change from baseline in AHV was superior to placebo at Week 52 with a mean treatment difference against placebo of +2.10 cm/year; the LS mean was +1.74 cm/year.\n• In a pre-specified exploratory analysis of the key secondary endpoint, oral infigratinib achieved the first statistically significant improvement in body proportionality against placebo in achondroplasia, demonstrating an LS mean treatment difference of -0.05 (p<0.05) against placebo in children younger than 8 years old (>50% of the participants).\n• PROPEL 3 successfully met the key secondary endpoint of change from baseline in height Z-score (achondroplasia reference population) at Week 52 (p<0.0001), with an LS mean increase on the treatment arm of +0.41 SD.\n• Oral infigratinib was well tolerated, with no discontinuations or serious adverse events related to study drug, 3 cases (4%) of hyperphosphatemia considered mild and transient with not a single case requiring either dose reduction or discontinuation, and no adverse events associated with inhibition of FGFR1 or 2 (e.g., retinal or corneal).\n• NDA and MAA submissions planned in second half of 2026 for achondroplasia; oral infigratinib is the only therapeutic option in development for achondroplasia to have Breakthrough Therapy Designation from the FDA.\n• Given the strength of these data, BridgeBio plans to accelerate the development of oral infigratinib in hypochondroplasia, and is enrolling the observational run-in for the Phase 3 trial."},{"time":"07:33","ticker":"LECO","headline":"Lincoln Electric beats by $0.11, misses on revs","body":"• Reports Q4 (Dec) earnings of $2.65 per share, $0.11 better than the FactSet Consensus of $2.54; revenues rose 5.5% year/year to $1.08 bln vs the $1.1 bln FactSet Consensus.\n• Adjusted operating income margin of 18.0%.\n• \"We are looking ahead to driving growth, higher profitability and returns as we execute on our new RISE strategy and achieve our 2030 targets.\""},{"time":"07:33","ticker":"GTES","headline":"Gates Industrial beats by $0.01, reports revs in-line; guides FY26 EPS in-line","body":"• Reports Q4 (Dec) earnings of $0.38 per share, excluding non-recurring items, $0.01 better than the FactSet Consensus of $0.37; revenues rose 3.2% year/year to $856.2 mln vs the $852.8 mln FactSet Consensus.\n• Co issues in-line guidance for FY26, sees EPS of $1.52-1.68, excluding non-recurring items, vs. $1.58 FactSet Consensus. Sees core sales growth in the range of 1% to 4% year-over-year"},{"time":"07:32","ticker":"NVMI","headline":"Nova Measuring beats by $0.02, reports revs in-line; guides Q1 EPS in-line, revs in-line","body":"• Reports Q4 (Dec) earnings of $2.14 per share, excluding non-recurring items, $0.02 better than the FactSet Consensus of $2.12; revenues rose 14.3% year/year to $222.62 mln vs the $220.83 mln FactSet Consensus.\n• Co issues in-line guidance for Q1, sees EPS of $2.13-2.25, excluding non-recurring items, vs. $2.15 FactSet Consensus; sees Q1 revs of $222-232 mln vs. $223.55 mln FactSet Consensus."},{"time":"07:32","ticker":"OGN","headline":"Organon misses by $0.10, misses on revs; guides FY26 revs above consensus","body":"• Reports Q4 (Dec) earnings of $0.63 per share, excluding non-recurring items, $0.10 worse than the FactSet Consensus of $0.73; revenues fell 5.3% year/year to $1.51 bln vs the $1.53 bln FactSet Consensus.\n• Co issues upside guidance for FY26, sees FY26 revs of approximately $6.2 bln vs. $6.11 bln FactSet Consensus. Sees adjusted EBITDA of approximately $1.9 bln."},{"time":"07:32","ticker":"LYEL","headline":"Lyell Immunopharma announces that the first patient has been dosed in the PiNACLE - H2H Phase 3 trial evaluating rondecabtagene autoleucel compared to lisocabtagene maraleucel or axicabtagene ciloleucel for the treatment of patients with relapsed or refractory large B-cell lymphoma receiving treatment in the second-line setting","body":"• PiNACLE -- H2H will evaluate the efficacy and safety of rondecabtagene autoleucel (ronde-cel) versus Investigator's choice of approved CD19 CAR T-cell therapies in patients with aggressive large B-cell lymphoma receiving treatment in the second-line setting.\n• The pivotal single-arm trial, PiNACLE, evaluating ronde-cel in the third- or later-line setting is ongoing with BLA submission expected in 2027.\n• Site activation for both PiNACLE -- H2H and PiNACLE are underway in the United States, Canada and Australia."},{"time":"07:31","ticker":"CME","headline":"CME Group increases quarterly cash dividend 5% to $1.30/share from $1.25/share","body":""},{"time":"07:30","ticker":"SUMRX","headline":"European Markets Update: DAX +1.3%, FTSE +0.1%, CAC +0.9%","body":"• In economic data: U.K.'s Q4 GDP 0.1% qtr/qtr (expected 0.2%; last 0.1%); 1.0% yr/yr (expected 1.2%; last 1.2%). December Industrial Production -0.9% m/m (expected -0.1%; last 1.3%); 0.5% yr/yr (expected 1.5%; last 2.3%). December Manufacturing Production -0.5% m/m (expected -0.2%; last 1.9%); 0.5% yr/yr (expected 1.8%; last 1.3%). December Construction Output -0.5% m/m (expected 0.5%; last -0.8%); -0.3% yr/yr (expected 0.0%; last -0.3%). Q4 Business Investment -2.7% qtr/qtr (expected 0.4%; last 1.6%); 2.0% yr/yr (last 2.5%). December trade deficit GBP22.72 bln (expected deficit of GBP22.30 bln; last deficit of GBP23.58 bln)\n• U.K.'s Q4 GDP 0.1% qtr/qtr (expected 0.2%; last 0.1%); 1.0% yr/yr (expected 1.2%; last 1.2%). December Industrial Production -0.9% m/m (expected -0.1%; last 1.3%); 0.5% yr/yr (expected 1.5%; last 2.3%). December Manufacturing Production -0.5% m/m (expected -0.2%; last 1.9%); 0.5% yr/yr (expected 1.8%; last 1.3%). December Construction Output -0.5% m/m (expected 0.5%; last -0.8%); -0.3% yr/yr (expected 0.0%; last -0.3%). Q4 Business Investment -2.7% qtr/qtr (expected 0.4%; last 1.6%); 2.0% yr/yr (last 2.5%). December trade deficit GBP22.72 bln (expected deficit of GBP22.30 bln; last deficit of GBP23.58 bln)\n• STOXX Europe 600: +0.4%\n• Germany's DAX: +1.3%\n• U.K.'s FTSE 100: +0.1%\n• France's CAC 40: +0.9%\n• Italy's FTSE MIB: +0.3%\n• Spain's IBEX 35: -0.1%\n• EUR/USD: +0.1% to 1.1882\n• GBP/USD: +0.2% to 1.3644\n• USD/CHF: -0.5% to 0.7673"},{"time":"07:26","ticker":"FNV","headline":"Franco-Nevada announces that, through a wholly-owned U.S. subsidiary, it has entered into an agreement to acquire a $250 million net smelter return royalty from i-80 Gold Corp. (IAUX) to support its recapitalization plan and strategy of creating a Nevada-focused mid-tier gold producer","body":"• i-80 Gold (IAUX) has outlined a three-phase development timeline to put the projects into production, anticipated to increase annual production from 150--200 koz Au in Phase 1 to 600+ koz Au with Phase 3 in 2032+.\n• This financing, together with i-80 Gold's concurrent recapitalization plan, provides substantial capital to develop Phases 1 and 2. See i-80 Gold's press release dated February 12, 2026 for additional details."},{"time":"07:19","ticker":"IAUX","headline":"I-80 Gold Corp has secured a financing package of up to $500 mln, comprised of a royalty sale for $250 mln and a gold pre-payment facility for up to $250 mln","body":"• The Financing Package marks a significant milestone in achieving the Company's recapitalization plans.\n• The proceeds of the Financing Package, combined with the previously disclosed equity offerings completed by the Company in the second quarter of 2025, represent over $800 million in funding to support i-80 Gold's objective of creating a mid-tier gold producer in Nevada. The final steps to complete the recapitalization plan targeting an overall amount of $900 million to $1 billion, include the Company's plan to retire and replace its existing convertible debentures with new convertible debentures on terms more favourable to the Company and the potential sale of a non-core asset. This is expected to fully fund Phase 1 and Phase 2 of the development plan, which is expected to increase annual production to approximately 300,000 -- 400,000 ounces of gold from less than 50,000 ounces currently, driven by the Company's three underground mines and one oxide open pit operation all located in Nevada."},{"time":"07:19","ticker":"BAX","headline":"Baxter misses by $0.10, beats on revs; guides FY26 EPS below consensus; Also announces Board refreshment initiative, appointing Michael R. McDonnell to its board of directors","body":"• Reports Q4 (Dec) earnings of $0.44 per share, excluding non-recurring items, $0.10 worse than the FactSet Consensus of $0.54; revenues rose 8.0% year/year to $2.97 bln vs the $2.84 bln FactSet Consensus.\n• Board Refreshment: Baxter announced today that it has appointed Michael R. McDonnell to its board of directors effective Feb. 13, 2026. Mr. McDonnell is a seasoned finance executive with decades of CFO experience across major global life sciences and technology companies, including most recently at Biogen and IQVIA Holdings. He brings foundational audit and advisory expertise from his early career as a partner at PwC (PricewaterhouseCoopers) and has deep proficiency in financial management, capital markets, and governance supported by his public company board experience.In addition, the company announced that Cathy R. Smith and Stephen H. Rusckowski will resign from the Baxter board as of Feb. 13, 2026. Ms. Smith joined the Baxter board in July 2017 and Mr. Rusckowski in August 2023. Effective upon their resignations and Mr. McDonnell's appointment, the size of the company's board will be 10 directors.\n• In addition, the company announced that Cathy R. Smith and Stephen H. Rusckowski will resign from the Baxter board as of Feb. 13, 2026. Ms. Smith joined the Baxter board in July 2017 and Mr. Rusckowski in August 2023. Effective upon their resignations and Mr. McDonnell's appointment, the size of the company's board will be 10 directors.\n• Co issues downside guidance for FY26, sees EPS of $1.85-$2.05, excluding non-recurring items, vs. $2.26 FactSet Consensus. Sees reported sales growth from continuing operations of flat to 1%, and organic sales growth from continuing operations of approximately flat."},{"time":"07:18","ticker":"SCANX","headline":"Gapping up/Gapping down","body":"• FSLY +40.5%, CGNX +23.4% (also increases share repurchase authorization by $500 mln), PRCH +18.6%, MH +16.5%, CROX +14.7%, VKTX +12.1%, EQIX +9.5% (also increases dividend), ZBRA +8.5%, TRN +8.1%, WST +5.5%, CXW +5.4%, LXP +5.1%, CW +4.4%, HUBS +4.3% (also authorizes new $1 bln share repurchase program), ZTS +4.1%, PRI +3.8% (also new $475 mln share buyback program; increases dividend), AR +3.7%, DBD +3.6%, LNC +3.4%, MTRN +3.4%, VNT +3.2%, CBRE +3.2%, GVA +3.1%, BUD +2.8%, CNR +2.5%, HWM +2.5%, IRM +2.2%, WTS +2%, AEE +1.9%, FAF +1.9%, PLMR +1.9%, BN +1.7%, AEP +1.7%, EPRT +1.6%, MSA +1.6%, MFC +1.5% (also increases dividend; also new NCIB program that permits repurchase of 2.5% of shares), PDS +1.4%, SAFE +1%, AGIO +1%, KIM +1%\n• NVCR +25.8% (FDA approves Optune Pax)\n• ATNI +17.5% (to sell 214 U.S. towers for up to $297 mln in cash)\n• BTU +5.8% (President Trump to direct DoE to issue funds to coal plants; also directs Pentagon to purchase electricity from coal-fired power plants)\n• MMS +4.2% (CEO/President discloses purchase of 3,175 shares worth $249K)\n• FRMI +3.2% (advances Hyundai E&C partnership for four AP1000 units at Project Matador)\n• WRD +3.2% (WeRide and Uber (UBER) launch first downtown commercial robotaxi service in Abu Dhabi)\n• MELI +3.1% (forms commercial partnership with Assa, according to Reuters)\n• PTLO +2.6% (names new CEO)\n• CNR +2.5% (President Trump to direct DoE to issue funds to coal plants; also directs Pentagon to purchase electricity from coal-fired power plants)\n• METC +2.4% (President Trump to direct DoE to issue funds to coal plants; also directs Pentagon to purchase electricity from coal-fired power plants)\n• HCC +2.4% (President Trump to direct DoE to issue funds to coal plants; also directs Pentagon to purchase electricity from coal-fired power plants)\n• ARLP +1.7% (President Trump to direct DoE to issue funds to coal plants; also directs Pentagon to purchase electricity from coal-fired power plants)\n• PFSI +1.6% (to acquire the subservicing business of Cenlar Capital)\n• EMBC +1.5% (names new chairman)\n• EQH +1.5% (authorizes new $1 bln share repurchase program)\n• VCTR +1.3% (reports January AUM)\n• SHOP +2.2% (upgraded to Buy from Hold at TD Cowen; upgraded to Outperform from Neutral at Mizuho)\n• RACE +1.7% (upgraded to Neutral from Sell at Citigroup)\n• BWA +1.4% (upgraded to Buy from Hold at Deutsche Bank)\n• ROL -14.1%, INSP -13.2%, MICC -12.5%, QS -9.1%, PAYC -9.1%, TYL -7.4%, VNDA -7.3%, APP -7.3%, CSCO -6.9% (also increases dividend), CHKP -6.5%, FBRT -6.4%, NBR -6.3%, QTWO -4.8%, CPA -4.1%, NBIX -3.7%, GEO -3%, PPC -2.9%, WFG -2.3%, BTI -2.1%, ALB -2% (also will idle Train 1 at its Kemerton lithium hydroxide processing plant), UL -2%, PCG -1.8%, BRKR -1.7%, CXT -1.2% (also increases dividend), LEG -1.2%, IRT -1.1%, QDEL -1% (also CFO to retire), AM -1%, HIMX -1%\n• ICLR -31.7% (conducting internal investigation initiated by the Audit Committee into certain of the company's accounting practices and controls; Is also withdrawing previously issued FY25 financial guidance)\n• NRGV -16.3% (upsizes and prices offering of $140.0 mln of 5.250% convertible senior notes due 2031)\n• ASTS -9.2% ($1 bln of convertible notes offering; also proposed repurchases of up to $300 mln convertible notes)\n• SNY -6.2% (names Beln Garijo CEO; Hudson to step down)\n• TCOM -4.8% (attributed to report of Chinese summon)\n• BMM -3.9% (advances four core assets)\n• MESO -3.7% (highlights Ryoncil survival data at ASTCT/CIBMTR; adult pivotal trial set to begin)\n• WRN -3.1% (C$50 mln bought deal financing)\n• NKTR -2.3% (prices offering $400 mln offering consisting of common stock and warrants)\n• ENTA -2% (files for $150 mln mixed securities shelf offering)\n• AXG -1.8% (secures up to $100 mln financing to expand stablecoin and tokenization strategy)\n• AMAT -1% (settles export probe with Commerce for $252.5 mln; DOJ, SEC close reviews)\n• RCUS -3.3% (downgraded to Equal Weight from Overweight at Wells Fargo)\n• KHC -2% (downgraded to Underweight from Neutral at JP Morgan)\n• BP -1.1% (downgraded to Reduce from Hold at HSBC)"},{"time":"07:17","ticker":"WIRES","headline":"On The Wires","body":"• ReposiTrak (TRAK) announces that its Touchless Traceability solution is patent pending. The innovation is a core capability of the ReposiTrak Enterprise Platform, enabling automated, end-to-end food traceability without manual case scanning or modifications to existing warehouse management systems.\n• Ameren Missouri, a subsidiary of Ameren Corporation (AEE), has filed its updated Smart Energy Plan with the Missouri Public Service Commission. The filing highlights how Missourians are benefiting from the company's investments in customer reliability and outlines a five-year strategy to advance a stronger, more resilient electric grid. In 2025, upgrades deployed through the Smart Energy Plan automatically prevented 160,000 customer outages during major storms.\n• Planet Labs (PL) GmbH announces a strategic partnership with AXA Digital Commercial Platform, an all-in-one risk management system, to provide high-frequency satellite imagery to monitor, predict, and respond to natural disasters in near-real-time."},{"time":"07:15","ticker":"BC","headline":"Brunswick increases quarterly dividend to $0.44/share from $0.43/share","body":""},{"time":"07:14","ticker":"TRIP","headline":"TripAdvisor misses by $0.11, reports revs in-line","body":"• Reports Q4 (Dec) earnings of $0.04 per share, excluding non-recurring items, $0.11 worse than the FactSet Consensus of $0.15; revenues were unchanged year/year at $411 mln vs the $412.68 mln FactSet Consensus."},{"time":"07:13","ticker":"NOTE","headline":"FiscalNote announces major expansion into political prediction markets","body":"FiscalNote Holdings, Inc. (NYSE: NOTE), a global leader in AI-driven policy and regulatory intelligence, today announced a major expansion into the rapidly growing political prediction market, a category attracting increased attention as interest in outcome-based forecasting accelerates. The Company has introduced a preview experience at PoliticalPredictions.com, highlighting its plans to establish a presence across multiple layers of the political prediction ecosystem, leveraging the Company's distinctive portfolio of relevant datasets, advanced AI capabilities, policy-focused customers, and deep domain expertise.Click here for full release."},{"time":"07:13","ticker":"SA","headline":"Seabridge Gold CFO to retire","body":"• The co announced today the upcoming retirement of its Chief Financial Officer, Chris Reynolds. After 15 years of dedicated service, Chris will step down from the role effective March 31, 2026, following completion of the 2025 audit and filing the annual financial statements.\n• With the retirement of Chris, Seabridge is pleased to announce the appointment of Greg Martin as its Chief Financial Officer effective March 31, 2026. Greg will join Seabridge on March 2nd to ensure a smooth transition with Chris. Greg brings deep experience in the areas of corporate finance, treasury, corporate development and building strong teams. Greg has recently held the role of CEO of Nevada Copper, EVP and CFO at SSR Mining (SSRM)."},{"time":"07:12","ticker":"RAMP","headline":"LiveRamp announces that its Board of Directors increased the Company's share repurchase authorization by $200 mln to $1.5 bln and extended the expiration by one year to December 31, 2027","body":"With this program expansion, the Company has approximately $337 mln currently available for share repurchases through the end of calendar 2027."},{"time":"07:11","ticker":"MCRB","headline":"Seres provides program and corporate updates and prioritizes emerging programs in inflammatory &amp; immune diseases","body":"CAMBRIDGE, Mass., Feb. 12, 2026 (GLOBE NEWSWIRE) -- Seres Therapeutics, Inc. (Nasdaq: MCRB), a leading live biotherapeutics company, today announced that, following advancement of key startup activities for the SER-155 Phase 2 study in allo-HSCT, including the submission of a final protocol to the FDA, study site evaluation and qualification with its CRO, and manufacturing of Phase 2 study drug substance, Seres is pausing additional investment in that program and will shift its operational focus to high-value earlier-stage pipeline programs while continuing to seek funding for the SER-155 Phase 2 study. Seres also announced additional measures to reduce operating costs, including a workforce reduction of approximately 30%. As a result of these and other runway extension actions, and based on current operating plans, the Company expects to extend its cash runway through the third quarter of 2026, thereby providing additional opportunities to advance development of its live biotherapeutic programs for inflammatory and immune diseases, and pursue potential collaborations.Click here for full release."},{"time":"07:11","ticker":"OPTU","headline":"Optimum Communications misses by $0.15, beats on revs","body":"• Reports Q4 (Dec) loss of $0.15 per share, excluding non-recurring items, $0.15 worse than the FactSet Consensus of ($0.00); revenues fell 2.3% year/year to $2.18 bln vs the $2.13 bln FactSet Consensus."},{"time":"07:09","ticker":"ARVN","headline":"Arvinas announces the appointment of Randy Teel, as President and Chief Executive Officer, as well as a member of the Company's Board of Directors, effective today","body":"• Dr. Teel previously served as Arvinas' Chief Business Officer and is recognized for his strategic leadership in advancing corporate growth and fostering strong industry partnerships.\n• Dr. Teel succeeds John Houston, Ph.D., who is retiring from his role as President, Chief Executive Officer, and Chair of Arvinas' Board of Directors. Dr. Houston will continue to serve as a member of the Board and has entered into a consulting agreement with Arvinas whereby he will provide consulting and advisory services to the company. Briggs Morrison, M.D., has been elected to serve as Chair of the Arvinas Board of Directors, effective today."},{"time":"07:08","ticker":"BTDR","headline":"Bitdeer Technologies misses by $0.60, beats on revs","body":"• Reports Q4 (Dec) loss of $0.73 per share, $0.60 worse than the FactSet Consensus of ($0.13); revenues rose 225.8% year/year to $224.84 mln vs the $204.95 mln FactSet Consensus.\n• \"The fourth quarter of 2025 marked a strategic inflection point as we accelerated our transition toward high-performance compute infrastructure and colocation services,\" said Matt Kong, Chief Business Officer at Bitdeer. \"We expect the global AI infrastructure supply / demand imbalance to widen, and our 3.0 GW power portfolio represents a rare and increasingly valuable strategic asset. As hyperscalers and enterprise customers face extended lead times for power and data center capacity, Bitdeer's operational infrastructure and speed to market provide a compelling competitive advantage.\""},{"time":"07:08","ticker":"TLRY","headline":"Tilray Pharma announces that its European pharmaceutical distribution business, CC Pharma, has entered into a strategic agreement with Smartway Pharmaceuticals, to expand the availability of pharmaceutical products across the United Kingdom","body":"• Through this agreement, CC Pharma and Smartway will jointly support the expansion of parallel import and specialist pharmaceutical supply in the UK, leveraging Smartway's established national distribution infrastructure to facilitate the delivery of pharmaceutical products and CC Pharma's European procurement capability and GMP capacity, marking a notable advancement in Tilray's comprehensive European medical expansion strategy.\n• The UK pharmaceutical market is estimated at nearly 1 billion within this category, and this agreement positions Tilray and CC Pharma to work with Smartway to accelerate access, improve supply reliability, and expand reach through trusted healthcare channels."},{"time":"07:06","ticker":"BRKR","headline":"Bruker misses by $0.06, beats on revs; guides FY26 EPS in-line, revs above consensus","body":"• Reports Q4 (Dec) earnings of $0.59 per share, excluding non-recurring items, $0.06 worse than the FactSet Consensus of $0.65; revenues fell 0.2% year/year to $977.2 mln vs the $963.22 mln FactSet Consensus.\n• Co issues guidance for FY26, sees EPS of $2.10-2.15, excluding non-recurring items, vs. $2.13 FactSet Consensus; sees FY26 revs of $3.57-3.60 bln vs. $3.48 bln FactSet Consensus.\n• \"At the conclusion of a difficult year 2025, with headwinds from academic funding, tariffs and currencies, we are pleased that in the fourth quarter we delivered revenues ahead of our expectations. A recovery in biopharma and industrial research markets in the second half of the year, as well improvements in semiconductor orders enabled our Scientific Instruments segment to achieve a book-to-bill ratio greater than 1.0x for the second quarter in a row, while our BEST segment booked strong multi-year orders.\"\n• \"While our fourth quarter margin recovery progressed well sequentially, it was still lagging our prior guidance. Therefore, we have decided to drive our major cost-savings initiatives beyond the upper end of our previous range, and we are poised to deliver very significant operating margin expansion and double-digit EPS growth in 2026. We expect continued improvements in our markets to drive demand for our differentiated post-genomic discovery, translational and diagnostics solutions. Our FY26 guidance assumes a return to organic revenue growth by the second quarter, with LSD organic growth for the full year.\""},{"time":"07:06","ticker":"CDNA","headline":"CareDx announces clinical validation results for AlloHeme, the first AIpowered NGS surveillance solution for AML and MDS postcell therapy","body":"Ultra-Sensitive, Non-Invasive Surveillance Solution Expected to Launch Commercially in the U.S. in 2027 as Part of CareDx's Transplant+ Precision Medicine PortfolioClick here for full release."},{"time":"07:06","ticker":"HWM","headline":"Howmet Aerospace beats by $0.08, beats on revs; guides Q1 EPS above consensus, revs above consensus; guides FY26 EPS in-line, revs in-line; increases dividend by 20%","body":"• Reports Q4 (Dec) earnings of $1.05 per share, excluding non-recurring items, $0.08 better than the FactSet Consensus of $0.97; revenues rose 14.6% year/year to $2.17 bln vs the $2.12 bln FactSet Consensus.\n• Co issues upside guidance for Q1, sees EPS of $1.09-1.11, excluding non-recurring items, vs. $1.02 FactSet Consensus; sees Q1 revs of $2.225-2.245 bln vs. $2.16 bln FactSet Consensus.\n• Co issues in-line guidance for FY26, sees EPS of $4.35-4.55, excluding non-recurring items, vs. $4.47 FactSet Consensus; sees FY26 revs of $9.0-9.2 bln vs. $9.16 bln FactSet Consensus.\n• The Board of Directors declared a dividend of $0.12 per share on the Company's common stock, to be paid on February 25, 2026, to the holders of record at the close of business on February 6, 2026. This quarterly dividend represents a 20% increase from the first quarter 2025 dividend of $0.10 per share."},{"time":"07:05","ticker":"SLVM","headline":"Sylvamo beats by $0.02, beats on revs","body":"• Reports Q4 (Dec) earnings of $1.08 per share, excluding non-recurring items, $0.02 better than the FactSet Consensus of $1.06; revenues fell 8.2% year/year to $890 mln vs the $858.76 mln FactSet Consensus.\n• \"Our capital spending will peak in 2026 as we execute the majority of our $145 million high-return strategic investments at our Eastover mill, including a paper machine optimization project, a new, state-of-the-art cutsize sheeter and a woodyard modernization project. 2025 and 2026 will be low points in free cash flow as we work through industry headwinds, particularly in Europe, and complete high-return investments. As these conditions normalize and our investments begin to deliver, Sylvamo is well positioned to generate stronger, more sustainable results with the potential to generate annually: > $300 million in free cash flow > 15% return on invested capital Our priorities remain unchanged: maintaining a strong financial position, reinvesting with discipline and returning cash to shareowners over time.\""},{"time":"07:05","ticker":"GILT","headline":"Gilat Satellite received an order for over $16 mln to supply multiple units of the DKET 3421 transportable terminal to a European Ministry of Defense","body":"Deliveries are expected over the next 12 months. Gilat DataPath's WGS-certified DKET 3421 is a combat-proven, 4.2 meter, rugged terminal designed to meet the most demanding mission requirements. Featuring multi-carrier capability and a scalable modem architecture of up to 32 modems, the system enables high-throughput, resilient connectivity for forward-deployed forces. With defense organizations increasingly focused on flexible and rapidly deployable communications, the DKET platform has become a trusted global solution for hub-class SATCOM infrastructure in dynamic environments."},{"time":"07:03","ticker":"CROX","headline":"Crocs beats by $0.38, beats on revs; guides Q1 EPS above consensus; guides FY26 EPS above consensus","body":"• Reports Q4 (Dec) earnings of $2.29 per share, excluding non-recurring items, $0.38 better than the FactSet Consensus of $1.91; revenues fell 3.3% year/year to $957.6 mln vs the $916.91 mln FactSet Consensus.\n• Co issues upside guidance for Q1, sees EPS of $2.67-2.77, excluding non-recurring items, vs. $2.52 FactSet Consensus. Revenues to be down approximately 5.5% to 3.5% to the first quarter of 2025, at currency rates as of February 9, 2026. Crocs Brand to be down approximately low-single-digits to the first quarter of 2025. HEYDUDE Brand to be down approximately 18% to 15% to the first quarter of 2025.\n• Co issues upside guidance for FY26, sees EPS of $12.88-13.35, excluding non-recurring items, vs. $11.89 FactSet Consensus. Revenues to be down approximately 1% to up slightly compared to full-year 2025, at currency rates as of February 9, 2026. Crocs Brand to be approximately flat to up 2% compared to full-year 2025. HEYDUDE Brand to be down approximately 9% to 7% compared to full-year 2025."},{"time":"07:03","ticker":"ZTS","headline":"Zoetis beats by $0.08, beats on revs; guides FY26 EPS above consensus, revs in-line","body":"• Reports Q4 (Dec) earnings of $1.48 per share, excluding non-recurring items, $0.08 better than the FactSet Consensus of $1.40; revenues rose 3.0% year/year to $2.39 bln vs the $2.36 bln FactSet Consensus.\n• Co issues guidance for FY26, sees EPS of $7.00-7.10, excluding non-recurring items, vs. $6.83 FactSet Consensus; sees FY26 revs of $9.825-10.025 bln vs. $9.93 bln FactSet Consensus."},{"time":"07:03","ticker":"PACB","headline":"Pacific Biosciences announces a collaboration with iHope, a global rare disease genomics program of Genetic Alliance, to integrate PacBio's HiFi long-read whole-genome sequencing into iHope's international network","body":""},{"time":"07:02","ticker":"CNR","headline":"Core Natural Resources misses by $1.19, beats on revs","body":"• Reports Q4 (Dec) loss of $1.54 per share, excluding non-recurring items, $1.19 worse than the FactSet Consensus of ($0.35); revenues rose 81.8% year/year to $1.04 bln vs the $1 bln FactSet Consensus."},{"time":"07:02","ticker":"DAN","headline":"Dana Inc announces that its board of directors has appointed Byron Foster as Chief Executive Officer, effective July 1, 2026","body":"• This planned effective date allows for a structured transition period. R. Bruce McDonald, who has served as Chairman and CEO since 2024, will continue in his role as Chairman of the Board.\n• Mr. Foster currently serves as Senior Vice President and President of Light Vehicle Systems, Dana's largest business unit."},{"time":"07:01","ticker":"AEP","headline":"American Electric beats by $0.05, beats on revs; guides FY26 EPS in-line","body":"• Reports Q4 (Dec) earnings of $1.19 per share, excluding non-recurring items, $0.05 better than the FactSet Consensus of $1.14; revenues rose 13.2% year/year to $5.31 bln vs the $4.89 bln FactSet Consensus.\n• Co issues in-line guidance for FY26, sees EPS of $6.15-6.45, excluding non-recurring items, vs. $6.32 FactSet Consensus.Reaffirms long-term operating earnings growth rate of 7% to 9%\n• Reaffirms long-term operating earnings growth rate of 7% to 9%"},{"time":"07:01","ticker":"AMG","headline":"Affiliated Managers beats by $0.62, misses on revs","body":"• Reports Q4 (Dec) earnings of $9.48 per share, excluding non-recurring items, $0.62 better than the FactSet Consensus of $8.86; revenues rose 6.2% year/year to $556.6 mln vs the $578.54 mln FactSet Consensus.\n• AUM of $813.3 bln compared to $707.9 bln year ago period.\n• During the fourth quarter of 2025, the Company repurchased approximately $350 million in common stock, bringing full-year share repurchases to approximately $700 million."},{"time":"07:00","ticker":"SUMRX","headline":"Asian Markets Close: Nikkei UNCH, Hang Seng -0.9%, Shanghai +0.1%","body":"• In economic data: Japan's January PPI 0.2% m/m, as expected (last 0.1%); 2.3% yr/yr, as expected (last 2.4%) India's January CPI 2.75% (expected 2.40%; last 1.33%) Australia's February MI Inflation Gauge 5.0% (last 4.6%)\n• Japan's January PPI 0.2% m/m, as expected (last 0.1%); 2.3% yr/yr, as expected (last 2.4%)\n• India's January CPI 2.75% (expected 2.40%; last 1.33%)\n• Australia's February MI Inflation Gauge 5.0% (last 4.6%)\n• Japan's Nikkei: UNCH\n• Hong Kong's Hang Seng: -0.9%\n• China's Shanghai Composite: +0.1%\n• India's Sensex: -0.7%\n• South Korea's Kospi: +3.1%\n• Australia's ASX All Ordinaries: UNCH\n• USD/JPY: -0.1% to 153.14\n• USD/CNH: -0.1% to 6.8975\n• USD/INR: -0.2% to 90.58"},{"time":"07:00","ticker":"PLTR","headline":"Palantir Technologies announces that the Defense Information Systems Agency has authorized Palantir Federal Cloud Service Forward, extending PFCS's existing Impact Level 5 and Impact Level 6 Provisional Authorizations to include on-premises and edge deployments","body":"With this authorization, Palantir's technology stack, including its platforms-Apollo, Gotham, Foundry, and AIP-and underlying infrastructure like Rubix, can be deployed across any environment, from enterprise data centers to the tactical edge, on hardware of the customer's choosing."},{"time":"06:58","ticker":"CBRE","headline":"CBRE Group beats by $0.06, reports revs in-line; guides FY26 EPS in-line","body":"• Reports Q4 (Dec) earnings of $2.73 per share, excluding non-recurring items, $0.06 better than the FactSet Consensus of $2.67; revenues rose 11.8% year/year to $11.63 bln vs the $11.71 bln FactSet Consensus.\n• Resilient Businesses revenue up 12% for Q4 and 13% for 2025.\n• Transactional Businesses revenue up 12% for Q4 and 14% for 2025.\n• Co issues in-line guidance for FY26, sees EPS of $7.30-$7.60, excluding non-recurring items, vs. $7.40 FactSet Consensus."},{"time":"06:56","ticker":"KIM","headline":"Kimco Realty reports FFO in-line, revs in-line; guides FY26 FFO in-line; increases dividend by 4%","body":"• Reports Q4 (Dec) funds from operations of $0.44 per share, in-line with the FactSet Consensus of $0.44; revenues rose 3.3% year/year to $542.5 mln vs the $537.89 mln FactSet Consensus.\n• Co issues in-line guidance for FY26, sees FFO of $1.80-1.84 vs. $1.80 FactSet Consensus.Expects same-property NOI growth of 2.5% to 3.5%\n• Expects same-property NOI growth of 2.5% to 3.5%\n• The board of directors declared a cash dividend of $0.26 per common share (equivalent to $1.04 per annum), representing a 4.0% increase over the quarterly dividend in the corresponding period of the prior year. The quarterly cash dividend on common shares will be payable on March 19, 2026, to shareholders of record on March 6, 2026."},{"time":"06:56","ticker":"USFD","headline":"US Foods beats by $0.04, reports revs in-line; guides FY26 EPS above consensus, revs below consensus","body":"• Reports Q4 (Dec) earnings of $1.04 per share, excluding non-recurring items, $0.04 better than the FactSet Consensus of $1.00; revenues rose 3.3% year/year to $9.8 bln vs the $9.89 bln FactSet Consensus.\n• Co issues mixed guidance for FY26, sees EPS of +18 to +24% yr/yr or $4.70 to $4.94, excluding non-recurring items, vs. $4.71 FactSet Consensus; sees FY26 revs of +4 to +6% yr/yr or $41.00 bln to $41.789 bln vs. $42.03 bln FactSet Consensus."},{"time":"06:55","ticker":"KMX","headline":"CarMax announces that Keith Barr has been appointed President and Chief Executive Officer, and a member of the Board of Directors, effective March 16, 2026","body":"• David McCreight, current Interim President and CEO of CarMax, will transition to his prior duties as an independent Director of the Board. Tom Folliard will remain in his role as Interim Executive Chair of the Board until the Company's Annual Meeting in June 2026, after which he is expected to resume his prior duties as non-executive Chair of the Board.\n• Mr. Barr is a proven leader who has driven transformational growth and operational excellence across large-scale, consumer-centric businesses. Most recently, he served as Chief Executive Officer at InterContinental Hotels Group (IHG), where he led one of the world's largest hospitality companies with 345,000 people working across more than 6,000 properties in over 100 countries."},{"time":"06:54","ticker":"BN","headline":"Brookfield Corporation reports record distributable earnings before realizations of $5.4 billion","body":"BROOKFIELD, NEWS, Feb. 12, 2026 (GLOBE NEWSWIRE) -- Brookfield Corporation (NYSE: BN, TSX: BN) announced strong financial results for the year ended December 31, 2025.Click here for full release."},{"time":"06:54","ticker":"AMG","headline":"Affiliated Managers has acquired an additional minority equity interest in Garda Capital Partners LP","body":"• Increased investment deepens AMG's partnership with Garda, a leading liquid alternatives manager specializing in fixed income relative value, with an excellent long-term investment track record.\n• Garda will remain majority-owned and led by its management team.\n• Transaction is aligned with AMG's long-term growth strategy and further expands Company's exposure to alternative strategies through an increased investment in an attractive, differentiated liquid alternatives manager.\n• Following the transaction, AMG remains a minority investor in Garda and will continue to account for the investment under the equity method. Terms of the transaction were not disclosed."},{"time":"06:53","ticker":"GVA","headline":"Granite Constr beats by $0.19, beats on revs; guides FY26 revs above consensus","body":"• Reports Q4 (Dec) earnings of $1.40 per share, excluding non-recurring items, $0.19 better than the FactSet Consensus of $1.21; revenues rose 19.2% year/year to $1.17 bln vs the $1.15 bln FactSet Consensus.\n• Co issues upside guidance for FY26, sees FY26 revs of $4.9-5.1 bln vs. $4.88 bln FactSet Consensus.Adjusted EBITDA margin in the range of 12.0% to 13.0%Capital expenditures of approximately $140 million to $160 million, including approximately $50 million in planned strategic materials investments.\n• Adjusted EBITDA margin in the range of 12.0% to 13.0%\n• Capital expenditures of approximately $140 million to $160 million, including approximately $50 million in planned strategic materials investments."},{"time":"06:53","ticker":"TU","headline":"Telus announces that, after a 26-year tenure as the company's President and Chief Executive Officer, Darren Entwistle will retire on June 30, 2026","body":"Following a comprehensive succession planning process, the Board of Directors has appointed Victor Dodig President and CEO, effective July 1, 2026. Mr. Dodig, who has served on the TELUS Board of Directors as an Independent Director since May 2022, becomes CEO Designate effective immediately and will join the TELUS leadership team full time on May 1, 2026 to enable a seamless transition."},{"time":"06:52","ticker":"EXC","headline":"Exelon beats by $0.04, reports revs in-line; guides FY26 EPS in-line","body":"• Reports Q4 (Dec) earnings of $0.59 per share, excluding non-recurring items, $0.04 better than the FactSet Consensus of $0.55; revenues fell 1.1% year/year to $5.41 bln vs the $5.39 bln FactSet Consensus.\n• Co issues in-line guidance for FY26, sees EPS of $2.81-2.91, excluding non-recurring items, vs. $2.83 FactSet Consensus.\n• On February 12, 2026, Exelon's Board of Directors declared a regular quarterly dividend of $0.42 per share on Exelon's common stock. The dividend is payable on March 13, 2026, to Exelon shareholders of record as of the close of business on March 2, 2026."},{"time":"06:50","ticker":"MTRN","headline":"Materion beats by $0.02, beats on revs; guides FY26 EPS in-line","body":"• Reports Q4 (Dec) earnings of $1.53 per share, excluding non-recurring items, $0.02 better than the FactSet Consensus of $1.51; revenues rose 12.1% year/year to $489.7 mln vs the $448.78 mln FactSet Consensus.\n• With mid-single digit top line growth and continued margin expansion, we are guiding to the range of $6.00 to $6.50 for full year 2026 adjusted earnings per share, an increase of 15% from prior year at the midpoint. We remain focused on driving towards our mid-term adjusted EBITDA margin target of 23%.\n• Co issues in-line guidance for FY26, sees EPS of $6.00-6.50, excluding non-recurring items, vs. $6.25 FactSet Consensus."},{"time":"06:48","ticker":"SCANX","headline":"Early premarket gappers","body":"• Gapping up: FSLY +40.9%, NVCR +23.9%, CGNX +23.3%, MH +20.7%, ATNI +20.2%, PRCH +20.2%, LNC +11.7%, VKTX +11.6%, EQIX +9.9%, ZBRA +9.3%, WST +8.1%, HUBS +6.1%, WTS +5.5%, CXW +5.4%, BTU +5.2%, LXP +5.1%, MMS +4.6%, AR +4.2%, VCTR +3.9%, PRI +3.8%, WRD +3.4%, MELI +3.2%, FRMI +3.2%, VNT +3.2%, CNR +3.1%, PAG +2.8%, BUD +2.7%, PTLO +2.6%, METC +2.4%, HCC +2.4%, ARLP +2%, CW +2%, GRAB +1.9%, AEE +1.9%, SLF +1.9%, MSI +1.9%, PLMR +1.8%, TPG +1.7%, MSA +1.6%, EMBC +1.5%, EQH +1.5%, GTY +1.4%, FAF +1.3%, QSR +1.2%, LUV +1%, FLR +1%, AMR +1%, SAFE +1%\n• FSLY +40.9%, NVCR +23.9%, CGNX +23.3%, MH +20.7%, ATNI +20.2%, PRCH +20.2%, LNC +11.7%, VKTX +11.6%, EQIX +9.9%, ZBRA +9.3%, WST +8.1%, HUBS +6.1%, WTS +5.5%, CXW +5.4%, BTU +5.2%, LXP +5.1%, MMS +4.6%, AR +4.2%, VCTR +3.9%, PRI +3.8%, WRD +3.4%, MELI +3.2%, FRMI +3.2%, VNT +3.2%, CNR +3.1%, PAG +2.8%, BUD +2.7%, PTLO +2.6%, METC +2.4%, HCC +2.4%, ARLP +2%, CW +2%, GRAB +1.9%, AEE +1.9%, SLF +1.9%, MSI +1.9%, PLMR +1.8%, TPG +1.7%, MSA +1.6%, EMBC +1.5%, EQH +1.5%, GTY +1.4%, FAF +1.3%, QSR +1.2%, LUV +1%, FLR +1%, AMR +1%, SAFE +1%\n• Gapping down: ICLR -30.1%, NRGV -17.5%, MICC -15.7%, ROL -15.3%, INSP -15.3%, PAYC -9.1%, ASTS -8.8%, QS -7.8%, CSCO -7.4%, TYL -7.2%, VNDA -7.1%, SNY -6.5%, FBRT -6.4%, NBR -6.3%, CHKP -5.5%, APP -5.3%, ALMU -4.9%, QTWO -4.8%, HIMX -4.2%, BMM -3.9%, NBIX -3.8%, WRN -3.7%, CPA -3.7%, GEO -3.7%, DAR -3%, PPC -2.7%, ETR -2.4%, ALB -2.3%, NE -2.1%, BTI -2.1%, ENTA -2%, MESO -1.9%, AXG -1.8%, UL -1.7%, AMAT -1.4%, TRU -1.4%, NEWP -1.3%, CXT -1.2%, LEG -1.2%, QRVO -1.1%, IRT -1.1%, WCN -1%, SCI -1%\n• ICLR -30.1%, NRGV -17.5%, MICC -15.7%, ROL -15.3%, INSP -15.3%, PAYC -9.1%, ASTS -8.8%, QS -7.8%, CSCO -7.4%, TYL -7.2%, VNDA -7.1%, SNY -6.5%, FBRT -6.4%, NBR -6.3%, CHKP -5.5%, APP -5.3%, ALMU -4.9%, QTWO -4.8%, HIMX -4.2%, BMM -3.9%, NBIX -3.8%, WRN -3.7%, CPA -3.7%, GEO -3.7%, DAR -3%, PPC -2.7%, ETR -2.4%, ALB -2.3%, NE -2.1%, BTI -2.1%, ENTA -2%, MESO -1.9%, AXG -1.8%, UL -1.7%, AMAT -1.4%, TRU -1.4%, NEWP -1.3%, CXT -1.2%, LEG -1.2%, QRVO -1.1%, IRT -1.1%, WCN -1%, SCI -1%"},{"time":"06:47","ticker":"STNG","headline":"Scorpio Tankers beats by $0.06, beats on revs","body":"• Reports Q4 (Dec) earnings of $1.62 per share, excluding non-recurring items, $0.06 better than the FactSet Consensus of $1.56; revenues rose 23.8% year/year to $252.6 mln vs the $232.34 mln FactSet Consensus.\n• On February 11, 2026, the Company's Board of Directors declared a quarterly cash dividend of $0.45 per common share, with a payment date of March 20, 2026 to all shareholders of record as of March 6, 2026 (the record date)."},{"time":"06:47","ticker":"IRM","headline":"Iron Mountain beats by $0.05, beats on revs; guides FY26 FFO in-line, revs above consensus","body":"• Reports Q4 (Dec) funds from operations of $1.44 per share, excluding non-recurring items, $0.05 better than the FactSet Consensus of $1.39; revenues rose 16.6% year/year to $1.84 bln vs the $1.81 bln FactSet Consensus.\n• Co issues guidance for FY26, sees FFO of $5.69-5.79, excluding non-recurring items, vs. $5.70 FactSet Consensus; sees FY26 revs of $7.625-7.725 bln vs. $7.59 bln FactSet Consensus.\n• \"We are pleased to report another record performance in the fourth quarter above our expectations, concluding our fifth consecutive year of all-time highs for Revenue, Adjusted EBITDA, and AFFO. Our team's steadfast commitment to delivering innovative solutions for our customers as part of our growth strategy continues to drive exceptional performance across each of our business segments,\" said William L. Meaney, President and CEO of Iron Mountain. \"Our outlook for continued double digit revenue and profit growth in 2026 remains equally promising, as our growth businesses represent an increasingly larger portion of our revenue and our highly recurring physical records storage business sustains its solid growth trajectory. With strong data center leasing in the fourth quarter, we enter 2026 with momentum underwritten by the 400 megawatts of capacity being energized over the next 24 months. Across all our business areas we are off to a strong start to the year and expect to deliver another year of record performance.\""},{"time":"06:47","ticker":"MRK","headline":"Merck  advances treatment of bladder and kidney cancers with new data at 2026 ASCO GU Cancers Symposium","body":"• First-time data from the Phase 3 KEYNOTE-B15/EV-304 trial evaluating KEYTRUDA, Merck's anti-PD-1 therapy, plus Padcev - enfortumab vedotin-ejfv (PFE ALPMY) as neoadjuvant and adjuvant treatment (before and after surgery) for patients with muscle-invasive bladder cancer who are eligible for cisplatin (abstract #LBA630, Oral abstract session B: Urothelial carcinoma), which will be featured in the official ASCO GU Press Program.\n• Results from the first interim analysis of the Phase 3 LITESPARK-022 trial evaluating KEYTRUDA in combination with WELIREG, Merck's first-in-class oral hypoxia-inducible factor-2 alpha (HIF-2a) inhibitor, as a treatment for patients with clear cell renal cell carcinoma (RCC) following nephrectomy (abstract #LBA418, Oral abstract session C: Renal cell cancer and testicular cancer), which will be featured in the official ASCO GU Press Program.\n• First presentation of data from the Phase 3 LITESPARK-011 trial evaluating WELIREG plus (ESAIY) LENVIMA, an orally available multiple receptor tyrosine kinase inhibitor (TKI) discovered by Eisai, as a treatment for patients with advanced RCC whose disease progressed on or after treatment with anti-PD-1/L1 therapy (abstract #LBA417, Oral abstract session C: Renal cell cancer and testicular cancer), which will be featured in the official ASCO GU Press Program.\n• First-time data presentation for the Phase 2 MK-2870-002 study evaluating sac-TMT plus KEYTRUDA for patients with advanced urothelial carcinoma (abstract #744, Poster session B: Prostate cancer and urothelial carcinoma)."},{"time":"06:45","ticker":"BRO","headline":"Brown &amp; Brown has entered into an accelerated share repurchase program with Bank of America, N.A. for $250 mln of the Company's common stock","body":"The ASR is part of the Company's board-approved $1.5 bln share repurchase authorization announced on October 22, 2025."},{"time":"06:42","ticker":"AMG","headline":"Affiliated Managers announced that Thomas M. Wojcik will be stepping down as the President and Chief Operating Officer, effective on March 6, 2026","body":"Upon Mr. Wojcik's departure, his responsibilities will be allocated to other members of the senior leadership team."},{"time":"06:39","ticker":"UTZ","headline":"Utz Brands beats by $0.01, reports revs in-line; guides FY26 EPS below consensus; announces buyback","body":"• Reports Q4 (Dec) earnings of $0.26 per share, excluding non-recurring items, $0.01 better than the FactSet Consensus of $0.25; revenues rose 0.4% year/year to $342.2 mln vs the $343.43 mln FactSet Consensus.\n• Co issues downside guidance for FY26, sees EPS of -3 to -6% yr/yr or $0.77 to $0.80, excluding non-recurring items, vs. $0.89 FactSet Consensus.FY26 organic net sales growth expected between 2% and 3%.\n• FY26 organic net sales growth expected between 2% and 3%.\n• Board approved $50 mln buyback."},{"time":"06:38","ticker":"VNT","headline":"Vontier beats by $0.01, beats on revs; guides Q1 EPS below consensus, revs below consensus; guides FY26 EPS in-line, revs above consensus","body":"• Reports Q4 (Dec) earnings of $0.86 per share, excluding non-recurring items, $0.01 better than the FactSet Consensus of $0.85; revenues rose 4.1% year/year to $808.5 mln vs the $764.7 mln FactSet Consensus.\n• Co issues downside guidance for Q1, sees EPS of $0.78-$0.81, excluding non-recurring items, vs. $0.82 FactSet Consensus; sees Q1 revs of $730-$740 mln vs. $752.96 mln FactSet Consensus.\n• Co issues guidance for FY26, sees EPS of $3.35-$3.50, excluding non-recurring items, vs. $3.40 FactSet Consensus; sees FY26 revs of $3.10-$3.15 bln vs. $3.09 bln FactSet Consensus."},{"time":"06:38","ticker":"PBF","headline":"PBF Energy beats by $0.59, reports revs in-line","body":"• Reports Q4 (Dec) earnings of $0.49 per share, excluding non-recurring items, $0.59 better than the FactSet Consensus of ($0.10); revenues fell 2.9% year/year to $7.14 bln vs the $7.11 bln FactSet Consensus.\n• Martinez Refinery Update: Construction activities are expected to be complete by February 16, 2026, at the 157,000 barrel per day Martinez, California refinery following the February 1, 2025, incident.\n• The company announced today that it will pay a quarterly dividend of $0.275 per share of Class A Common Stock on March 11, 2026, to shareholders of record at the close of business on February 25, 2026."},{"time":"06:38","ticker":"ASTS","headline":"AST SpaceMobile announces pricing of private offering of $1.0 billion of convertible senior notes due 2036","body":"• The sale of the Notes to the initial purchasers is expected to settle on February 17, 2026, subject to customary closing conditions.\n• The Notes have an initial conversion price of approximately $116.30 per share of AST SpaceMobile's Class A common stock, which represents a premium of approximately 20% to the last reported sale price of AST SpaceMobile's Class A common stock on February 11, 2026.\n• AST SpaceMobile estimates that the net proceeds from the Notes Offering will be approximately $983.7 million (or approximately $1,131.4 million if the initial purchasers' option to purchase additional Notes is exercised in full), after deducting the initial purchasers' discounts and commissions and estimated offering expenses payable by AST SpaceMobile. AST SpaceMobile intends to use the net proceeds from the Notes Offering for general corporate purposes, including without limitation, accelerating the deployment of AST SpaceMobile's controlled spectrum bands on a global basis, monetizing the capabilities of AST SpaceMobile's proprietary technology to capture the evolving commercial opportunities related to artificial intelligence, enhancing investment in government space opportunities in the U.S, reducing higher interest debt, and pursuing opportunistic investments to accelerate AST SpaceMobile's SpaceMobile Service and capabilities.\n• The Notes will be senior, unsecured obligations of AST SpaceMobile. The Notes will accrue interest at an annual rate of 2.250%, payable semiannually in arrears on April 15 and October 15 of each year, beginning on October 15, 2026. The Notes will mature on April 15, 2036, unless earlier converted or repurchased."},{"time":"06:37","ticker":"AMG","headline":"Affiliated Managers announces its acquisition of a minority equity interest in HighBrook Investo","body":"• AMG invests in HighBrook, a real estate investment manager specializing in thematic value-add opportunities in the U.S. and Europe.\n• HighBrook to leverage AMG's strategic capabilities to enhance its long-term success and continue to build an enduring firm.\n• Partnership further diversifies AMG's business and expands its participation in global private markets.\n• The terms of the transaction were not disclosed.\n• HighBrook's management team will continue to hold the majority of the firm's equity and direct its day-to-day operations. As part of the agreement, Mr. Carr and other senior members of the HighBrook leadership team have entered into long-term commitments with the firm."},{"time":"06:36","ticker":"ZBRA","headline":"Zebra Tech reports EPS in-line, revs in-line; guides Q1 EPS in-line, revs in-line; guides FY26 EPS in-line, revs in-line; Authorizes repurchase of $1 bln of common stock","body":"• Reports Q4 (Dec) earnings of $4.33 per share, excluding non-recurring items, in-line with the FactSet Consensus of $4.33; revenues rose 10.6% year/year to $1.48 bln vs the $1.47 bln FactSet Consensus.\n• Co issues in-line guidance for Q1, sees EPS of $4.05-$4.35, excluding non-recurring items, vs. $4.15 FactSet Consensus; sees Q1 revs growth of 11-15%, equating to revenue of $1.45-$1.50 bln vs. $1.45 bln FactSet Consensus.\n• Co issues in-line guidance for FY26, sees EPS of $17.70-$18.30, excluding non-recurring items, vs. $17.79 FactSet Consensus; sees FY26 revs growth of 9-13%, equating to revenue of $5.88-$6.09 bln vs. $5.94 bln FactSet Consensus.\n• Zebra's Board of Directors has authorized the repurchase of $1 billion of common stock, which augments the previous $1 billion purchase authorization."},{"time":"06:35","ticker":"FTAI","headline":"FTAI Aviation Ltd. announces the following executive appointments, which are effective immediately","body":"• David Moreno has been appointed to the new role of President. As President, Mr. Moreno will be responsible for steering the Company's strategic growth initiatives and managing the day-to-day performance of the business.Mr. Moreno is the President of FTAI. From 2021 to 2026, Mr. Moreno served as Chief Operating Officer where he was responsible for the Company's growth initiatives, strategic acquisitions and partnerships.\n• Mr. Moreno is the President of FTAI. From 2021 to 2026, Mr. Moreno served as Chief Operating Officer where he was responsible for the Company's growth initiatives, strategic acquisitions and partnerships.\n• Stacy Kuperus has been appointed to the role of Chief Operating Officer. In this role, Ms. Kuperus will be focused on overseeing the Company's global aviation operations and driving performance and operational excellence across the Company's engine maintenance facilities.Ms. Kuperus is the Chief Operating Officer of FTAI. From 2021 to 2026, Ms. Kuperus served as Chief Portfolio Officer where she was responsible for business operations and deal execution across the various portfolios of owned assets.\n• Ms. Kuperus is the Chief Operating Officer of FTAI. From 2021 to 2026, Ms. Kuperus served as Chief Portfolio Officer where she was responsible for business operations and deal execution across the various portfolios of owned assets."},{"time":"06:34","ticker":"ETR","headline":"Entergy misses by $0.01; guides FY26 EPS in-line","body":"• Reports Q4 (Dec) earnings of $0.51 per share, excluding non-recurring items, $0.01 worse than the FactSet Consensus of $0.52.\n• Co issues in-line guidance for FY26, sees EPS of $4.25 to $4.45, excluding non-recurring items, vs. $4.38 FactSet Consensus."},{"time":"06:34","ticker":"ASTS","headline":"AST SpaceMobile prices repurchases of convertible senior notes to be funded by concurrent registered direct offerings of class A common stock","body":"• The Co. announces the pricing of cash repurchases of approximately $46.5 million aggregate principal amount of its 4.25% convertible senior notes due 2032 and $250.0 million of its 2.375% convertible senior notes due 2032 and its offering of approximately 6.3 million shares of its Class A common stock to holders of Existing Notes participating in the Repurchases in two separate direct placements registered under the Securities Act of 1933, as amended.\n• With this series of transactions, AST SpaceMobile will issue approximately 1.15 million incremental shares to the underlying shares of the Existing Notes being repurchased while removing approximately $300 million of debt from the balance sheet and approximately $51.4 million of remaining interest. Both the closing of the Repurchases and the Registered Direct Offerings are expected to take place on or about February 20, 2026. Each Registered Direct Offering and the Repurchases of the relevant series of Existing Notes to be funded by such offering are cross-conditional.\n• AST SpaceMobile intends to use the net proceeds from the relevant Registered Direct Offering, together with cash on hand, to repurchase approximately $46.5 million principal amount of the 4.25% Convertible Notes and $250.0 million principal amount of the 2.375% Convertible Notes, respectively, for cash pursuant to separate, privately negotiated transactions with a limited number of holders of such Existing Notes. After giving effect to the Repurchases, approximately $3.5 million aggregate principal amount of the 4.25% Convertible Notes will remain outstanding and $325.0 million aggregate principal amount of the 2.375% Convertible Notes will remain outstanding."},{"time":"06:34","ticker":"QSR","headline":"Restaurant Brands Int'l beats by $0.01, beats on revs","body":"• Reports Q4 (Dec) earnings of $0.96 per share, excluding non-recurring items, $0.01 better than the FactSet Consensus of $0.95; revenues rose 7.4% year/year to $2.47 bln vs the $2.41 bln FactSet Consensus.Consolidated system-wide sales grow 5.8% in the fourth quarter. Consolidated comparable sales up 3.1% in Q4, led by 6.1% at INTL, 2.8% at TH Canada and 2.6% at BK US.\n• Consolidated system-wide sales grow 5.8% in the fourth quarter.\n• Consolidated comparable sales up 3.1% in Q4, led by 6.1% at INTL, 2.8% at TH Canada and 2.6% at BK US.\n• RBI continues to expect the following long-term consolidated performance on average, from 2024 to 2028: 3%+ Comparable Sales; and 8%+ organic Adjusted Operating Income growth. In addition, the Company continues to expect to reach 5%+ Net Restaurant Growth towards the end of its algorithm period.\n• 3%+ Comparable Sales; and\n• 8%+ organic Adjusted Operating Income growth.\n• In addition, the Company continues to expect to reach 5%+ Net Restaurant Growth towards the end of its algorithm period.\n• The RBI board of directors has declared a dividend of $0.65 per common share and partnership exchangeable unit of RBI LP for the first quarter of 2026. The dividend will be payable on April 2, 2026 to shareholders and unitholders of record at the close of business on March 19, 2026. RBI also announced an annual total dividend target of $2.60 per RBI common share and per partnership exchangeable unit of RBI LP for 2026."},{"time":"06:32","ticker":"RPC","headline":"Ridgepost Capital reports fourth quarter and full year 2025 earnings results","body":"DALLAS, Feb. 12, 2026 (GLOBE NEWSWIRE) -- Ridgepost Capital, Inc (NYSE: RPC) (\"Ridgepost Capital\" or the \"Company\"), a leading private markets solutions provider, today reported financial results for the fourth quarter and year ended December 31, 2025.Click here for full release."},{"time":"06:28","ticker":"ICLR","headline":"ICON plc conducting internal investigation initiated by the Audit Committee into certain of the company's accounting practices and controls; Is also withdrawing previously issued FY25 financial guidance","body":"• Co announces an ongoing internal investigation initiated by the Audit Committee of the Board of Directors in late October 2025 into certain of the Company's accounting practices and controls, following concerns reported to the Audit Committee through Company management. Outside legal counsel is conducting the investigation with the support of forensic and technical accounting firms.\n• The investigation primarily focuses on revenue recognition in fiscal years 2023 through 2025. The Company is in the process of evaluating the design and operation of certain internal controls over financial reporting and expects to report one or more material weaknesses as a result.\n• While the investigation is continuing, at this time, preliminary indications are that the Company's revenue in 2023 and 2024 may have been overstated by less than two percent for each fiscal year.\n• Due to the ongoing investigation, including a delay of normal quarter and year-end reporting processes, the Company is not yet able to communicate its 2025 financial performance and is withdrawing its previously issued 2025 full year financial guidance."},{"time":"06:27","ticker":"ZBRA","headline":"Zebra Tech had approved a $1 bkn increase to the Company's existing authorization to repurchase shares of Zebra Technologies Corporation Common Stock","body":"This increase to the repurchase authorization augments the $1 bln authorization that was announced on July 30, 2019 and the previous $1 blnincrease to the authorization that was announced on May 17, 2022."},{"time":"06:20","ticker":"WFG","headline":"West Fraser announces fourth quarter 2025 results","body":"VANCOUVER, BC, Feb. 11, 2026 /PRNewswire/ - West Fraser Timber Co. Ltd. (\"West Fraser\" or the \"Company\") (TSX and NYSE: WFG) reported today the fourth quarter results of 2025 (\"Q4-25\"). All dollar amounts in this news release are expressed in U.S. dollars unless noted otherwise.Click here for full release."},{"time":"06:20","ticker":"TRU","headline":"TransUnion beats by $0.04, beats on revs; guides Q1 EPS below consensus, revs above consensus; guides FY26 EPS below consensus, revs above consensus","body":"• Reports Q4 (Dec) earnings of $1.07 per share, excluding non-recurring items, $0.04 better than the FactSet Consensus of $1.03; revenues rose 13.0% year/year to $1.17 bln vs the $1.13 bln FactSet Consensus.\n• Co issues mixed guidance for Q1, sees EPS of $1.08-1.10, excluding non-recurring items, vs. $1.16 FactSet Consensus; sees Q1 revs of $1.195-1.205 bln vs. $1.19 bln FactSet Consensus.\n• Co issues mixed guidance for FY26, sees EPS of $4.63-4.71, excluding non-recurring items, vs. $4.88 FactSet Consensus; sees FY26 revs of $4.946-4.981 bln vs. $4.94 bln FactSet Consensus.\n• TransUnion's Board of Directors has declared a cash dividend of $0.125 per share for the fourth quarter of 2025. The dividend will be payable on March 13, 2026, to shareholders of record on February 26, 2026."},{"time":"06:18","ticker":"LGO","headline":"Largo Resources provides update on status of Iron Ore Calcine commercial transaction","body":"• Iron Ore Calcine Transaction update: The purchaser has failed to make the initial payment under the terms of the US$56 million iron ore sale agreement and Largo will terminate the contract if payment is not received by February 20, 2026 and potentially pursue alternative transactions for this iron ore calcines with other interested parties. Largo believes that is has ample cash on hand to offset this potential near term set back.\n• U.S. FeV prices have increased approximately 30% over the past month, materially outpacing European price movements.\n• Structural supply constraints in the U.S. market persist, driven by limited conversion capacity and restricted access to certain alternative origins, in part due to U.S. tariffs and sanctions.\n• Largo is well positioned to supply the U.S. market as a reliable, Western-aligned primary producer, subject to existing tariff constraints."},{"time":"06:17","ticker":"ATNI","headline":"ATN International to sell 214 U.S. towers for up to $297 mln in cash","body":"• ATN International agreed to divest 214 Southwestern U.S. towers and related operations to an affiliate of Everest Infrastructure Partners for up to $297 mln in an all-cash transaction.Co expects initial closing in Q2 2026 with $250--$270 mln in gross proceeds, of which $20--$35 mln will be subject to post-closing conditions; an additional $27--$47 mln is tied to milestone-based subsequent closings.Estimated taxes, minority payouts, and transaction expenses are expected to total 25--30% of gross proceeds; Co plans to use proceeds to reduce debt and invest in core operations, including ~$70 mln to repay its CoBank revolver.Upon full completion, Co anticipates an annualized reduction of $5--$7 mln in revenue, $4--$6 mln in operating income, and $10--$13 mln in EBITDA from removing the tower portfolio.\n• Co expects initial closing in Q2 2026 with $250--$270 mln in gross proceeds, of which $20--$35 mln will be subject to post-closing conditions; an additional $27--$47 mln is tied to milestone-based subsequent closings.\n• Estimated taxes, minority payouts, and transaction expenses are expected to total 25--30% of gross proceeds; Co plans to use proceeds to reduce debt and invest in core operations, including ~$70 mln to repay its CoBank revolver.\n• Upon full completion, Co anticipates an annualized reduction of $5--$7 mln in revenue, $4--$6 mln in operating income, and $10--$13 mln in EBITDA from removing the tower portfolio."},{"time":"06:14","ticker":"GEL","headline":"Genesis Energy, L.P.","body":"• Reports Q4 (Dec) earnings of $0.04 per share; revenues rose 10.5% year/year to $440.76 mln."},{"time":"06:13","ticker":"GEO","headline":"Geo Group announces that GEO's Chief Executive Officer, J. David Donahue, has notified the Company of his retirement, effective February 28, 2026","body":"GEO further announced that the Company's Founder and Executive Chairman, Dr. George C. Zoley, will return to the position of Chairman and Chief Executive Officer under an amended employment agreement effective March 1, 2026 through April 2, 2029."},{"time":"06:09","ticker":"LNC","headline":"Lincoln National beats by $0.31, beats on revs","body":"• Reports Q4 (Dec) earnings of $2.21 per share, excluding non-recurring items, $0.31 better than the FactSet Consensus of $1.90; revenues fell 2.8% year/year to $4.92 bln vs the $4.85 bln FactSet Consensus."},{"time":"06:09","ticker":"AVNT","headline":"Avient beats by $0.01, beats on revs; guides Q1 EPS in-line; guides FY26 EPS in-line","body":"• Reports Q4 (Dec) earnings of $0.56 per share, excluding non-recurring items, $0.01 better than the FactSet Consensus of $0.55; revenues rose 1.9% year/year to $761 mln vs the $748.4 mln FactSet Consensus.\n• Co issues in-line guidance for Q1, sees EPS of $0.81, excluding non-recurring items, vs. $0.81 FactSet Consensus.\n• Co issues in-line guidance for FY26, sees EPS of $2.93-$3.17, excluding non-recurring items, vs. $3.06 FactSet Consensus.\n• \"Demand conditions are expected to remain mixed as we start 2026, and while we are optimistic for improving macro trends, we are not relying on it to deliver earnings growth. We expect the carryover impact of our 2025 initiatives and continued focus on productivity and cash preservation to enable earnings growth in 2026, should the demand environment not improve,\" said Jamie Beggs, Senior Vice President and Chief Financial Officer, Avient Corporation."},{"time":"06:08","ticker":"SWX","headline":"Southwest Gas and Carl C. Icahn mutually agreed to terminate that certain Amended and Restated Cooperation Agreement","body":"As a result of such termination, all rights and obligations of the Parties thereunder were terminated, and the Cooperation Agreement is of no further force or effect. Notwithstanding the termination of the Cooperation Agreement, Andrew W. Evans, Henry P. Linginfelter and Ruby Sharma, each of whom was nominated as a director pursuant to the terms of the Cooperation Agreement, will remain on the Company's board of directors, and, subject to the Company's standard evaluation process of director candidates, the Company expects to renominate each of them for reelection at the Company's 2026 annual meeting of stockholders."},{"time":"06:07","ticker":"WST","headline":"West Pharm beats by $0.21, beats on revs; guides Q1 EPS mostly above consensus, revs above consensus; guides FY26 EPS above consensus, revs in-line","body":"• Reports Q4 (Dec) earnings of $2.04 per share, excluding non-recurring items, $0.21 better than the FactSet Consensus of $1.83; revenues rose 7.5% year/year to $805 mln vs the $794.89 mln FactSet Consensus.\n• Co issues guidance for Q1, sees EPS of $1.65-1.70, excluding non-recurring items, vs. $1.65 FactSet Consensus; sees Q1 revs of $770-790 mln vs. $762.94 mln FactSet Consensus.\n• Co issues guidance for FY26, sees EPS of $7.85-8.20, excluding non-recurring items, vs. $7.76 FactSet Consensus; sees FY26 revs of $3.215-3.275 bln vs. $3.24 bln FactSet Consensus."},{"time":"06:06","ticker":"LXP","headline":"LXP Industrial Trust misses by $0.03, beats on revs; guides FY26 FFO below consensus","body":"• Reports Q4 (Dec) funds from operations of $0.79 per share, excluding non-recurring items, $0.03 worse than the FactSet Consensus of $0.82; revenues fell 14.0% year/year to $86.7 mln vs the $82.41 mln FactSet Consensus.\n• Same-Store NOI increased 2.9% for the full year and was in line for the quarter compared to the same periods in 2024.\n• Co issues downside guidance for FY26, sees FFO of $3.22-$3.37, excluding non-recurring items, vs. $3.45 FactSet Consensus."},{"time":"06:04","ticker":"PCG","headline":"PG&amp;E reports EPS in-line; guides FY26 EPS above consensus","body":"• Reports Q4 (Dec) earnings of $0.36 per share, excluding non-recurring items, in-line with the FactSet Consensus of $0.36.\n• Co issues upside guidance for FY26, sees EPS of $1.64-1.66, excluding non-recurring items, vs. $1.63 FactSet Consensus and prior guidance of $1.62-1.66.Targeting customer bill inflation of 0-3% versus 2-4% previously\n• Targeting customer bill inflation of 0-3% versus 2-4% previously"},{"time":"06:03","ticker":"GEO","headline":"Geo Group reports Q4 results; guides Q1 revs below consensus; guides FY26 revs in-line","body":"• Reports Q4 (Dec) earnings of $0.25 per share, excluding non-recurring items; revenues rose 16.5% year/year to $707.7 mln vs the $667.26 mln FactSet Consensus.\n• Co issues downside guidance for Q1, sees Q1 revs of $680-$690 mln vs. $690.71 mln FactSet Consensus.\n• Co issues in-line guidance for FY26, sees FY26 revs of $2.9-$3.1 bln vs. $2.95 bln FactSet Consensus. Expects full year 2026 Adjusted EBITDA to be in a range of $490 million to $510 million. Expects total Capital Expenditures for the full year 2026 to be between $120 million and $155 million."},{"time":"06:00","ticker":"","headline":"S&P futures vs fair value: +19.00. Nasdaq futures vs fair value: +71.00.","body":""},{"time":"06:00","ticker":"","headline":"European Markets","body":"FTSE...10497.7...+25.60...+0.20%. DAX...25186.32...+330.20...+1.30%."},{"time":"06:00","ticker":"","headline":"Asian Markets","body":"Nikkei...57639.84...-10.70...0.00%. Hang Seng...27032.55...-233.80...-0.90%."},{"time":"06:00","ticker":"SUMRX","headline":"Overnight Summary -- Global markets edge up, earnings momentum offsets softer U.K. growth","body":"• Global markets are leaning cautiously higher this morning, with U.S. futures firmly above fair value and Europe gaining momentum, while Asia shows divergence and commodities ease slightly as rates hold steady. S&P futures are up about 18 points, trading around 6978. The market witnessed a slow but methodical grind higher, setting the low of 6952.25 early in the session. The S&P trades closer to overnight high of 6986.25.\n• Asian markets close mixed on Thursday as stronger-than-expected U.S. jobs data boost confidence in the global growth outlook but temper expectations for near-term Federal Reserve rate cuts. Japan finishes little changed, with the Nikkei 225 slipping marginally after briefly topping 58,000, as traders digest a pullback in the yen and Prime Minister Takaichi's pledge of responsible stimulus, while stock-specific moves drive volatility in names like Shiseido and Honda. China edges higher, with the Shanghai Composite up modestly amid reports that the U.S. and China may extend their trade truce ahead of an April summit between Presidents Trump and Xi. Hong Kong underperforms, with the Hang Seng down 0.86% on weakness in technology shares, as a firmer dollar pressures precious metals and oil ticks up on ongoing U.S.--Iran tensions.\n• European equities trade at record highs, with the Stoxx 600 up 0.4% as strong corporate earnings offset softer U.K. growth data. The FTSE 100 trades positive, even as U.K. fourth-quarter GDP grew just 0.1% sequentially and 1.0% year-over-year, both below forecasts. Earnings drive sentiment, with Siemens surging after raising its fiscal 2026 outlook, EssilorLuxottica soaring on strong AI-glasses demand, and Legrand lifting its dividend and growth targets. M&A activity adds fuel, as Schroders spikes on a 9.9 bln takeover by Nuveen, while British American Tobacco announces a larger buyback and Unilever slips despite modest sales growth.\n• S&P Futures vs Fair Value: +18.0\n• 10 yr Note: 4.175%\n• USD/JPY: 152.99 -0.28\n• EUR/USD: 1.1878 +0.0004\n• Europe: FTSE: +0.2% DAX: +1.3% CAC: +0.6%\n• Asia: Hang Seng: -0.9% Shanghai: +0.1% Nikkei: 0.0%\n• Gold (5086.60 -11.90) Silver (83.380 -0.540) Crude (64.32 -0.31)"},{"time":"05:50","ticker":"WIRES","headline":"On The Wires","body":"• Oracle (ORCL) Health announced its Clinical AI Agent, Clinical Note is now available in the UK. The new AI solution allows caregivers at the NHS and private practices to use an ambient voice and screen-driven assistant to draft patient notes, so they can reduce administrative tasks and devote more time to patient care. Trusts participating in the pilot program, including Barts Health NHS Trust, Imperial College Healthcare NHS Trust, and Milton Keynes University Hospital, are now deploying the solution more broadly across their organizations.\n• Jacobs (J) has secured a four-year contract extension from the U.K. Department for Transport to continue leading the National Security Science and Research (NSSR) program. The program demonstrates how government and industry can work together to accelerate and translate innovation into operational outcomes that strengthen security and resilience across the U.K.'s air, road and rail networks.\n• AIxCrypto Inc. (AIXC) announced its strategic partnership with BitMart to launch a co-branded virtual prepaid card, marking a key milestone in the Company's roadmap to bridge Web3 capabilities with everyday commerce for its global community. Through this partnership, eligible users will gain access to a co-branded virtual prepaid card designed to support everyday digital payments, online spending, and integration with major digital wallet ecosystems. The offering is intended to enhance practical utility and real-world payment flexibility for users engaging with digital asset platforms, subject to applicable terms and regional availability."},{"time":"05:45","ticker":"MBGYY","headline":"Mercedes-Benz Group AG reports FY25 results","body":"• Mercedes-Benz Group delivered adjusted earnings before interest and taxes (EBIT) of 8.2 billion (2024: 13.7 billion). Group revenues came in at 132.2 billion (2024: 145.6 billion). The free cash flow of the industrial business reached 5.4 billion (2024: 9.2 billion), mainly due to positive effects from lighter inventories and negative effects from net investments in property, plant & equipment and intangible assets. The net liquidity of the industrial business stood at 32.2 billion (end of 2024: 31.4 billion).\n• Top-End cars reached 15% of overall sales for Mercedes-Benz Cars in 2025. Leveraging this solid foundation, 140 years after Carl Benz registered his patent for the first motor car, Mercedes-Benz is accelerating the rollout of new products to drive future growth.\n• In November 2025, Mercedes-Benz initiated a share buyback programme of up to 2 billion (not including incidental costs) on the stock exchange over a period of up to 12 months. By the end of 2025, Mercedes-Benz bought back approximately 300 million worth of shares, leaving up to 1.7 billion still to come in 2026. This buyback is based on and in line with the existing capital allocation and buyback policy, which states that any future free cash flow of the industrial business (as available post potential M&A) shall be used to fund dividend payments and share buybacks.\n• Full Release"},{"time":"05:25","ticker":"SSNLF","headline":"Samsung announced that it has begun mass production of its industry-leading HBM4 and has shipped commercial products to customers","body":"• This achievement marks a first in the industry, securing an early leadership position in the HBM4 market.\n• By proactively leveraging its most advanced 6th-generation 10 nanometer (nm)-class DRAM process (1c), the company achieved stable yields and industry-leading performance from the outset of mass production - all accomplished seamlessly and without any additional redesigns.\n• \"Instead of taking the conventional path of utilizing existing proven designs, Samsung took the leap and adopted the most advanced nodes like the 1c DRAM and 4nm logic process for HBM4,\" said Sang Joon Hwang, Executive Vice President and Head of Memory Development at Samsung Electronics. \"By leveraging our process competitiveness and design optimization, we are able to secure substantial performance headroom, enabling us to satisfy our customers' escalating demands for higher performance, when they need them.\"\n• Potential related stocks: WDC, MU, SNDK"},{"time":"05:16","ticker":"CHKP","headline":"Check Point Software beats by $0.64, reports revs in-line","body":"• Reports Q4 (Dec) earnings of $3.40 per share, $0.64 better than the FactSet Consensus of $2.76; revenues rose 5.9% year/year to $744.9 mln vs the $746.36 mln FactSet Consensus."},{"time":"05:14","ticker":"FSM","headline":"Fortuna Silver Mines extends high grade gold mineralization at Sunbird, Including 6.1&nbsp;g/t Au over 18.9 meters, Sgula Mine, Cte d'Ivoire","body":"VANCOUVER, British Columbia, Feb. 12, 2026 (GLOBE NEWSWIRE) -- Fortuna Mining Corp. (NYSE: FSM | TSX: FVI) is pleased to report results from ongoing exploration drilling at the Sunbird deposit, located at the Sgula Mine in Cte d'Ivoire (see Figure 1). Recent drilling has successfully extended mineralization at depth and expanded a second high grade mineralized shoot.Click here for full release."},{"time":"05:11","ticker":"WIRES","headline":"On The Wires","body":"• Broadridge Financial Solutions (BR) announced that its Distributed Ledger Repo platform processed an average of $365 billion in daily repo transactions during January, with volumes totaling $7.3 trillion. The daily average is a 508% increase year-over-year during the same month in 2025, underscoring the continued institutional adoption of tokenized real-asset settlement at scale as the platform sustains momentum from a breakout year.\n• StepStone Group (STEP) announced today it is partnering with Utmost, a leading global provider of insurance-based wealth solutions. This provides Utmost's UK-based clients with access to StepStone's entire suite of evergreen global private markets strategies across Private Equity, Venture Capital & Growth, Private Credit, and Private Infrastructure. StepStone leverages a global perspective on private markets and relationships with a range of experienced investment managers across different investment strategies. Through this partnership, UK investors will be able to diversify their portfolios and have the ability to improve their long-term financial outcomes. This will support not only their own goals but also broader government-backed initiatives designed to encourage investment in unlisted equities and private markets.\n• InterDigital (IDCC) announced that Atle Monrad has been re-elected for a second term to Chair the 3GPP SA6 working group. SA6 is responsible for service architecture, procedures, and information flows that enable applications, vertical services, and critical communications. The group's work ensures network capabilities can be effectively exposed and leveraged by vertical industries, emerging service providers, and public safety organizations.\n• Garrett Motion Inc. (GTX) announced the first commercial application of its largest MEG turbocharger platform with Weichai's next-generation large-bore engine programs. This deployment marks an important advancement in extending Garrett's advanced turbocharging technologies into higher power applications for marine propulsion and power generation systems."},{"time":"05:10","ticker":"ANL","headline":"Adlai Nortye announces first patient enrolled in global Phase 1 Trial of Pan-RAS (ON) Inhibitor AN9025 for Solid Tumors Harboring RAS Mutations","body":"SINGAPORE and NORTH BRUNSWICK, N.J. and HANGZHOU, China, Feb. 12, 2026 (GLOBE NEWSWIRE) -- Adlai Nortye Ltd. (NASDAQ: ANL) (the \"Company\" or \"Adlai Nortye\"), a clinical-stage biotechnology company focused on the development of innovative cancer therapies, today announced that the first patient has been dosed in the United States in early February in its ongoing Phase 1 clinical trial of AN9025, a pan-RAS (ON) inhibitor.Click here for full release."},{"time":"05:08","ticker":"WIRES","headline":"On The Wires","body":"• Broadridge Financial Solutions Inc. (BR) announced that Nissay Asset Management Corporation has implemented Broadridge's Mortgage--Backed Securities Trade Assignment Portal, becoming the first asset management company in Japan to adopt the solution. Trade Assignment Portal automates and digitizes Nissay Asset Management's Assignment of Trade processes for TBA (To-Be-Announced) trading of mortgage--backed securities, allowing the firm to instantly create and electronically sign contract documents, send AOT letters to multiple recipients at once, and track progress in real time. The solution also stores completed AOTs securely in the cloud, significantly reducing manual workload and improving transparency.\n• CME Group (CME) announced plans to launch four South Asia edible oil futures contracts on March 2, 2026, pending regulatory review. The new products are cash-settled and include two outright contracts and two spread contracts that will be based on the Fastmarkets Soyoil CFR India and Crude Palm Oil CFR West Coast India assessments.\n• Mitek Systems (MITK) announced enhancements to its SEPBLAC-compliant digital onboarding capabilities for the Spanish market, designed to help regulated entities defend against a rapidly escalating wave of AI-driven identity fraud. The enhancements strengthen Mitek's unassisted video verification solution, used across Spain for SEPBLAC-compliant remote identity verification."},{"time":"04:59","ticker":"BUD","headline":"Anheuser-Busch InBev beats by $0.07, reports revs in-line","body":"• Reports Q4 (Dec) earnings of $0.95 per share, $0.07 better than the FactSet Consensus of $0.88; revenues rose 6.2% year/year to $15.55 bln vs the $15.59 bln FactSet Consensus.\n• 2026 OutlookOverall Performance: Co expects EBITDA to grow in line with our medium-term outlook of between 4-8%. The outlook for FY26 reflects current assessment of inflation and other macroeconomic conditions.Net Finance Costs: Net pension interest expenses and accretion expenses are expected to be in the range of $190 to 220 million per quarter, depending on currency and interest rate fluctuations. Co expects the average gross debt coupon in FY26 to be approximately 4%.Net Capital Expenditure: Co expects net capital expenditure of between $3.5 and 4.0 billion in FY26.\n• Overall Performance: Co expects EBITDA to grow in line with our medium-term outlook of between 4-8%. The outlook for FY26 reflects current assessment of inflation and other macroeconomic conditions.\n• Net Finance Costs: Net pension interest expenses and accretion expenses are expected to be in the range of $190 to 220 million per quarter, depending on currency and interest rate fluctuations. Co expects the average gross debt coupon in FY26 to be approximately 4%.\n• Net Capital Expenditure: Co expects net capital expenditure of between $3.5 and 4.0 billion in FY26."},{"time":"04:51","ticker":"WRD","headline":"WeRide and Uber (UBER) launch first downtown commercial robotaxi service in Abu Dhabi","body":"• WeRide (WRD) and Uber Technologies (UBER) began the first commercial robotaxi operations in downtown Abu Dhabi, expanding coverage to ~70% of the city's core areas.Service now operates across Khalifa City, Masdar City, Rabdan, and routes between Corniche Road and the Sheikh Zayed Grand Mosque, endorsed by the Integrated Transport Centre.Riders can access WeRide's Robotaxi GXR via UberX, Uber Comfort, or a dedicated \"Autonomous\" option; vehicles currently include an onboard safety specialist.Fleet has quadrupled since December 2024 launch, with over 200 robotaxis in the Middle East and a target to deploy at least 1,200 units across Abu Dhabi, Dubai, and Riyadh as soon as 2027.\n• Service now operates across Khalifa City, Masdar City, Rabdan, and routes between Corniche Road and the Sheikh Zayed Grand Mosque, endorsed by the Integrated Transport Centre.\n• Riders can access WeRide's Robotaxi GXR via UberX, Uber Comfort, or a dedicated \"Autonomous\" option; vehicles currently include an onboard safety specialist.\n• Fleet has quadrupled since December 2024 launch, with over 200 robotaxis in the Middle East and a target to deploy at least 1,200 units across Abu Dhabi, Dubai, and Riyadh as soon as 2027."},{"time":"04:46","ticker":"NRGV","headline":"Energy Vault upsizes and prices offering of $140.0 mln of 5.250% convertible senior notes due 2031","body":"• The offering was upsized from the previously announced offering size of $125.0 million aggregate principal amount of Notes."},{"time":"04:44","ticker":"NKTR","headline":"Nektar Therapeutics prices offering $400 mln offering consisting of common stock and warrants","body":"• Co priced an upsized $400 mln underwritten public offering of common stock and pre-funded warrants.Co is selling 6,603,449 shares at $58.00 per share and 293,103 pre-funded warrants at $57.9999, with a $0.0001 exercise price.Gross proceeds are expected to total approximately $400 mln before underwriting discounts and expenses.\n• Co is selling 6,603,449 shares at $58.00 per share and 293,103 pre-funded warrants at $57.9999, with a $0.0001 exercise price.\n• Gross proceeds are expected to total approximately $400 mln before underwriting discounts and expenses."},{"time":"04:42","ticker":"NTST","headline":"NETSTREIT prices 10.98 mln shares of common stock at $19.00 per share","body":""},{"time":"04:39","ticker":"AMAT","headline":"Applied Materials settles export probe with Commerce for $252.5 mln; DOJ, SEC close reviews","body":"• Applied Materials reached a civil settlement with the U.S. Department of Commerce's Bureau of Industry and Security, agreeing to pay $252.5 mln to resolve export regulation allegations tied to China shipments between Nov. 2020 and July 2022.The matter stemmed from a misunderstanding of the applicability of certain U.S. Export Administration Regulations.The U.S. Department of Justice and the Securities and Exchange Commission have closed related investigations without taking action.With the settlement, the U.S. government's review is concluded, removing a regulatory overhang as Applied focuses on semiconductor demand and its technology roadmap.\n• The matter stemmed from a misunderstanding of the applicability of certain U.S. Export Administration Regulations.\n• The U.S. Department of Justice and the Securities and Exchange Commission have closed related investigations without taking action.\n• With the settlement, the U.S. government's review is concluded, removing a regulatory overhang as Applied focuses on semiconductor demand and its technology roadmap."},{"time":"04:35","ticker":"NWE","headline":"NorthWestern misses by $0.02, reports revs in-line; guides FY26 EPS in-line; raises dividend","body":"• Reports Q4 (Dec) earnings of $1.17 per share, excluding non-recurring items, $0.02 worse than the FactSet Consensus of $1.19; revenues rose 10.9% year/year to $414.3 mln vs the $414.26 mln FactSet Consensus.\n• Co issues in-line guidance for FY26, sees EPS of $3.68-3.83, excluding non-recurring items, vs. $3.83 FactSet Consensus.Co is affirming long-term diluted earnings per share growth guidance of 4% to 6%, based on 2024 adjusted diluted non-GAAP EPS baseline of $3.40.\n• Co is affirming long-term diluted earnings per share growth guidance of 4% to 6%, based on 2024 adjusted diluted non-GAAP EPS baseline of $3.40.\n• Additionally, is announcing a $3.2 billion capital investment plan for 2026-2030, which is expected to support rate base growth of 4% to 6% from our 2024 base year of approximately $5.4 billion. Co anticipates funding capital expenditures through cash flows from operations, available credit sources, debt issuances, and future rate increases. In order to fund South Dakota generation investment, equity issuances are expected beginning in 2027.\n• Dividend DeclaredNorthWestern Energy Group's Board of Directors has declared a quarterly common stock dividend of $0.67 per share, representing a 1.5% increase over the previous quarter's dividend. The dividend is payable on March 31, 2026, to shareholders of record as of March 13, 2026.Looking ahead, co remains committed to maintaining a dividend payout ratio within our targeted range of 60-70% over the long term.\n• NorthWestern Energy Group's Board of Directors has declared a quarterly common stock dividend of $0.67 per share, representing a 1.5% increase over the previous quarter's dividend. The dividend is payable on March 31, 2026, to shareholders of record as of March 13, 2026.\n• Looking ahead, co remains committed to maintaining a dividend payout ratio within our targeted range of 60-70% over the long term."},{"time":"04:28","ticker":"APC","headline":"ARKO Petroleum Corp. (Nasdaq) prices 11,111,111 share IPO at $18.00 per share, at the low end of the $18-20 expected range","body":""},{"time":"04:26","ticker":"AXG","headline":"Solowin Holdings secures up to $100 mln financing to expand stablecoin and tokenization strategy","body":"• SOLOWIN HOLDINGS (AXG) entered a securities purchase agreement with Streeterville Capital for up to $100 mln via pre-paid purchase agreements tied to Class A ordinary shares.The initial tranche of ~$5.4 mln (before OID and expenses) has closed; additional tranches are subject to mutual consent.Proceeds are earmarked for expanding the company's stablecoin and asset tokenization businesses, advancing AI and blockchain security R&D, and supporting global expansion.Terms were disclosed in a Form 6-K and related 424B5 prospectus supplement filed February 9, 2026; structure implies potential future share issuance depending on drawdowns.\n• The initial tranche of ~$5.4 mln (before OID and expenses) has closed; additional tranches are subject to mutual consent.\n• Proceeds are earmarked for expanding the company's stablecoin and asset tokenization businesses, advancing AI and blockchain security R&D, and supporting global expansion.\n• Terms were disclosed in a Form 6-K and related 424B5 prospectus supplement filed February 9, 2026; structure implies potential future share issuance depending on drawdowns."},{"time":"04:22","ticker":"FRMI","headline":"Fermi America advances Hyundai E&amp;C partnership for four AP1000 units at Project Matador","body":"• Fermi Inc. deepened its partnership with Hyundai Engineering & Construction Co., Ltd. to advance FEED work for four AP1000 reactors at its 11GW Project Matador campus near Amarillo, Texas.The companies engaged U.S. contractors at Hyundai E&C's nuclear technology seminar in Dallas to strengthen supply chain and workforce readiness as part of a broader push to restart large-scale U.S. nuclear construction.FEED activities include site layout, cooling system evaluations, and cost/schedule development to support a potential EPC pathway.Management highlighted AI-driven load growth and said Project Matador is positioned as one of the few advanced U.S. nuclear projects with active NRC engagement and readiness to break ground.\n• The companies engaged U.S. contractors at Hyundai E&C's nuclear technology seminar in Dallas to strengthen supply chain and workforce readiness as part of a broader push to restart large-scale U.S. nuclear construction.\n• FEED activities include site layout, cooling system evaluations, and cost/schedule development to support a potential EPC pathway.\n• Management highlighted AI-driven load growth and said Project Matador is positioned as one of the few advanced U.S. nuclear projects with active NRC engagement and readiness to break ground."},{"time":"04:20","ticker":"ODV","headline":"Osisko Development provides infill drilling update on its 13,000-meter Lowhee Program at Cariboo Gold Project","body":"MONTREAL, Feb. 11, 2026 (GLOBE NEWSWIRE) -- OsiskoDevelopment Corp. (NYSE: ODV, TSXV: ODV) (\"Osisko Development\" or the \"Company\") is pleased to announce new infill drilling results from its ongoing 13,000-meter program on 10 meter drill spacing that commenced in August 2025 in the Lowhee Zone of the Company's permitted, 100%-owned Cariboo Gold Project (\"Cariboo\" or the \"Project\"), located in central British Columbia (\"B.C.\"), Canada. The six drill hole fans reported herein comprise an additional ~5,043 meters (\"m\") of underground infill drilling, bringing the total tally of drilling with full results to 11,025 m, or ~80% of the planned total.Click here for full release."},{"time":"04:13","ticker":"MESO","headline":"Mesoblast highlights Ryoncil survival data at ASTCT/CIBMTR; adult pivotal trial set to begin","body":"• Mesoblast Limited presented data showing Ryoncil (remestemcel-L-rknd) delivered similarly high survival in steroid-refractory acute GVHD across children and adults, second- or third-line use, and ruxolitinib-nave or resistant patients.\n• Ryoncil is the first FDA-approved mesenchymal stromal cell product and the only therapy approved for children under 12 with SR-aGvHD.\n• In EIND patients treated = third line (89% grade III/IV), 15% died before completing therapy vs. 2% in second-line Phase 3 (MSB-GVHD001), underscoring benefit of earlier use post-steroid resistance.\n• Adult EIND patients showed day-100 survival at least comparable to pediatric patients; company plans to initiate a pivotal adult second-line trial this quarter to pursue label expansion."},{"time":"04:11","ticker":"SNY","headline":"Sanofi names Beln Garijo CEO; Hudson to step down","body":"• Sanofi will not renew Paul Hudson's director mandate; his last day as CEO is Feb. 17, 2026.\n• Beln Garijo, currently CEO of Merck KGaA, appointed Chief Executive Officer effective after the April 29, 2026 AGM; Board will propose her as director.\n• Olivier Charmeil named Interim CEO during the transition.\n• Garijo to focus on strengthening R&D productivity, governance, and innovation capacity; previously held senior roles at Sanofi and serves on the board of BBVA; former board member of L'Oral."},{"time":"04:08","ticker":"HEINY","headline":"Heineken launches 375 mln second tranche of 750 mln buyback","body":"• Heineken Holding N.V. begins the second 375 mln tranche of its up to 750 mln two-year share buyback program.\n• Repurchases will mirror its pro rata participation in the Heineken N.V. buyback, selling HEIA shares and buying back HEIO shares daily at VWAP.\n• Program expected to complete by 29 Jan 2027, or earlier if fully utilized."}],"fetchedAt":1770923124309},"savedAt":1770923124310}