{"data":{"updated":"2/12/2026, 7:04:40 AM","entries":[{"time":"06:58","ticker":"CBRE","headline":"CBRE Group beats by $0.06, reports revs in-line; guides FY26 EPS in-line","body":"• Reports Q4 (Dec) earnings of $2.73 per share, excluding non-recurring items, $0.06 better than the FactSet Consensus of $2.67; revenues rose 11.8% year/year to $11.63 bln vs the $11.71 bln FactSet Consensus.\n• Resilient Businesses revenue up 12% for Q4 and 13% for 2025.\n• Transactional Businesses revenue up 12% for Q4 and 14% for 2025.\n• Co issues in-line guidance for FY26, sees EPS of $7.30-$7.60, excluding non-recurring items, vs. $7.40 FactSet Consensus."},{"time":"06:56","ticker":"KIM","headline":"Kimco Realty reports FFO in-line, revs in-line; guides FY26 FFO in-line; increases dividend by 4%","body":"• Reports Q4 (Dec) funds from operations of $0.44 per share, in-line with the FactSet Consensus of $0.44; revenues rose 3.3% year/year to $542.5 mln vs the $537.89 mln FactSet Consensus.\n• Co issues in-line guidance for FY26, sees FFO of $1.80-1.84 vs. $1.80 FactSet Consensus.Expects same-property NOI growth of 2.5% to 3.5%\n• Expects same-property NOI growth of 2.5% to 3.5%\n• The board of directors declared a cash dividend of $0.26 per common share (equivalent to $1.04 per annum), representing a 4.0% increase over the quarterly dividend in the corresponding period of the prior year. The quarterly cash dividend on common shares will be payable on March 19, 2026, to shareholders of record on March 6, 2026."},{"time":"06:56","ticker":"USFD","headline":"US Foods beats by $0.04, reports revs in-line; guides FY26 EPS above consensus, revs below consensus","body":"• Reports Q4 (Dec) earnings of $1.04 per share, excluding non-recurring items, $0.04 better than the FactSet Consensus of $1.00; revenues rose 3.3% year/year to $9.8 bln vs the $9.89 bln FactSet Consensus.\n• Co issues mixed guidance for FY26, sees EPS of +18 to +24% yr/yr or $4.70 to $4.94, excluding non-recurring items, vs. $4.71 FactSet Consensus; sees FY26 revs of +4 to +6% yr/yr or $41.00 bln to $41.789 bln vs. $42.03 bln FactSet Consensus."},{"time":"06:55","ticker":"KMX","headline":"CarMax announces that Keith Barr has been appointed President and Chief Executive Officer, and a member of the Board of Directors, effective March 16, 2026","body":"• David McCreight, current Interim President and CEO of CarMax, will transition to his prior duties as an independent Director of the Board. Tom Folliard will remain in his role as Interim Executive Chair of the Board until the Company's Annual Meeting in June 2026, after which he is expected to resume his prior duties as non-executive Chair of the Board.\n• Mr. Barr is a proven leader who has driven transformational growth and operational excellence across large-scale, consumer-centric businesses. Most recently, he served as Chief Executive Officer at InterContinental Hotels Group (IHG), where he led one of the world's largest hospitality companies with 345,000 people working across more than 6,000 properties in over 100 countries."},{"time":"06:54","ticker":"BN","headline":"Brookfield Corporation reports record distributable earnings before realizations of $5.4 billion","body":"BROOKFIELD, NEWS, Feb. 12, 2026 (GLOBE NEWSWIRE) -- Brookfield Corporation (NYSE: BN, TSX: BN) announced strong financial results for the year ended December 31, 2025.Click here for full release."},{"time":"06:54","ticker":"AMG","headline":"Affiliated Managers has acquired an additional minority equity interest in Garda Capital Partners LP","body":"• Increased investment deepens AMG's partnership with Garda, a leading liquid alternatives manager specializing in fixed income relative value, with an excellent long-term investment track record.\n• Garda will remain majority-owned and led by its management team.\n• Transaction is aligned with AMG's long-term growth strategy and further expands Company's exposure to alternative strategies through an increased investment in an attractive, differentiated liquid alternatives manager.\n• Following the transaction, AMG remains a minority investor in Garda and will continue to account for the investment under the equity method. Terms of the transaction were not disclosed."},{"time":"06:53","ticker":"GVA","headline":"Granite Constr beats by $0.19, beats on revs; guides FY26 revs above consensus","body":"• Reports Q4 (Dec) earnings of $1.40 per share, excluding non-recurring items, $0.19 better than the FactSet Consensus of $1.21; revenues rose 19.2% year/year to $1.17 bln vs the $1.15 bln FactSet Consensus.\n• Co issues upside guidance for FY26, sees FY26 revs of $4.9-5.1 bln vs. $4.88 bln FactSet Consensus.Adjusted EBITDA margin in the range of 12.0% to 13.0%Capital expenditures of approximately $140 million to $160 million, including approximately $50 million in planned strategic materials investments.\n• Adjusted EBITDA margin in the range of 12.0% to 13.0%\n• Capital expenditures of approximately $140 million to $160 million, including approximately $50 million in planned strategic materials investments."},{"time":"06:53","ticker":"TU","headline":"Telus announces that, after a 26-year tenure as the company's President and Chief Executive Officer, Darren Entwistle will retire on June 30, 2026","body":"Following a comprehensive succession planning process, the Board of Directors has appointed Victor Dodig President and CEO, effective July 1, 2026. Mr. Dodig, who has served on the TELUS Board of Directors as an Independent Director since May 2022, becomes CEO Designate effective immediately and will join the TELUS leadership team full time on May 1, 2026 to enable a seamless transition."},{"time":"06:52","ticker":"EXC","headline":"Exelon beats by $0.04, reports revs in-line; guides FY26 EPS in-line","body":"• Reports Q4 (Dec) earnings of $0.59 per share, excluding non-recurring items, $0.04 better than the FactSet Consensus of $0.55; revenues fell 1.1% year/year to $5.41 bln vs the $5.39 bln FactSet Consensus.\n• Co issues in-line guidance for FY26, sees EPS of $2.81-2.91, excluding non-recurring items, vs. $2.83 FactSet Consensus.\n• On February 12, 2026, Exelon's Board of Directors declared a regular quarterly dividend of $0.42 per share on Exelon's common stock. The dividend is payable on March 13, 2026, to Exelon shareholders of record as of the close of business on March 2, 2026."},{"time":"06:50","ticker":"MTRN","headline":"Materion beats by $0.02, beats on revs; guides FY26 EPS in-line","body":"• Reports Q4 (Dec) earnings of $1.53 per share, excluding non-recurring items, $0.02 better than the FactSet Consensus of $1.51; revenues rose 12.1% year/year to $489.7 mln vs the $448.78 mln FactSet Consensus.\n• With mid-single digit top line growth and continued margin expansion, we are guiding to the range of $6.00 to $6.50 for full year 2026 adjusted earnings per share, an increase of 15% from prior year at the midpoint. We remain focused on driving towards our mid-term adjusted EBITDA margin target of 23%.\n• Co issues in-line guidance for FY26, sees EPS of $6.00-6.50, excluding non-recurring items, vs. $6.25 FactSet Consensus."},{"time":"06:48","ticker":"SCANX","headline":"Early premarket gappers","body":"• Gapping up: FSLY +40.9%, NVCR +23.9%, CGNX +23.3%, MH +20.7%, ATNI +20.2%, PRCH +20.2%, LNC +11.7%, VKTX +11.6%, EQIX +9.9%, ZBRA +9.3%, WST +8.1%, HUBS +6.1%, WTS +5.5%, CXW +5.4%, BTU +5.2%, LXP +5.1%, MMS +4.6%, AR +4.2%, VCTR +3.9%, PRI +3.8%, WRD +3.4%, MELI +3.2%, FRMI +3.2%, VNT +3.2%, CNR +3.1%, PAG +2.8%, BUD +2.7%, PTLO +2.6%, METC +2.4%, HCC +2.4%, ARLP +2%, CW +2%, GRAB +1.9%, AEE +1.9%, SLF +1.9%, MSI +1.9%, PLMR +1.8%, TPG +1.7%, MSA +1.6%, EMBC +1.5%, EQH +1.5%, GTY +1.4%, FAF +1.3%, QSR +1.2%, LUV +1%, FLR +1%, AMR +1%, SAFE +1%\n• FSLY +40.9%, NVCR +23.9%, CGNX +23.3%, MH +20.7%, ATNI +20.2%, PRCH +20.2%, LNC +11.7%, VKTX +11.6%, EQIX +9.9%, ZBRA +9.3%, WST +8.1%, HUBS +6.1%, WTS +5.5%, CXW +5.4%, BTU +5.2%, LXP +5.1%, MMS +4.6%, AR +4.2%, VCTR +3.9%, PRI +3.8%, WRD +3.4%, MELI +3.2%, FRMI +3.2%, VNT +3.2%, CNR +3.1%, PAG +2.8%, BUD +2.7%, PTLO +2.6%, METC +2.4%, HCC +2.4%, ARLP +2%, CW +2%, GRAB +1.9%, AEE +1.9%, SLF +1.9%, MSI +1.9%, PLMR +1.8%, TPG +1.7%, MSA +1.6%, EMBC +1.5%, EQH +1.5%, GTY +1.4%, FAF +1.3%, QSR +1.2%, LUV +1%, FLR +1%, AMR +1%, SAFE +1%\n• Gapping down: ICLR -30.1%, NRGV -17.5%, MICC -15.7%, ROL -15.3%, INSP -15.3%, PAYC -9.1%, ASTS -8.8%, QS -7.8%, CSCO -7.4%, TYL -7.2%, VNDA -7.1%, SNY -6.5%, FBRT -6.4%, NBR -6.3%, CHKP -5.5%, APP -5.3%, ALMU -4.9%, QTWO -4.8%, HIMX -4.2%, BMM -3.9%, NBIX -3.8%, WRN -3.7%, CPA -3.7%, GEO -3.7%, DAR -3%, PPC -2.7%, ETR -2.4%, ALB -2.3%, NE -2.1%, BTI -2.1%, ENTA -2%, MESO -1.9%, AXG -1.8%, UL -1.7%, AMAT -1.4%, TRU -1.4%, NEWP -1.3%, CXT -1.2%, LEG -1.2%, QRVO -1.1%, IRT -1.1%, WCN -1%, SCI -1%\n• ICLR -30.1%, NRGV -17.5%, MICC -15.7%, ROL -15.3%, INSP -15.3%, PAYC -9.1%, ASTS -8.8%, QS -7.8%, CSCO -7.4%, TYL -7.2%, VNDA -7.1%, SNY -6.5%, FBRT -6.4%, NBR -6.3%, CHKP -5.5%, APP -5.3%, ALMU -4.9%, QTWO -4.8%, HIMX -4.2%, BMM -3.9%, NBIX -3.8%, WRN -3.7%, CPA -3.7%, GEO -3.7%, DAR -3%, PPC -2.7%, ETR -2.4%, ALB -2.3%, NE -2.1%, BTI -2.1%, ENTA -2%, MESO -1.9%, AXG -1.8%, UL -1.7%, AMAT -1.4%, TRU -1.4%, NEWP -1.3%, CXT -1.2%, LEG -1.2%, QRVO -1.1%, IRT -1.1%, WCN -1%, SCI -1%"},{"time":"06:47","ticker":"STNG","headline":"Scorpio Tankers beats by $0.06, beats on revs","body":"• Reports Q4 (Dec) earnings of $1.62 per share, excluding non-recurring items, $0.06 better than the FactSet Consensus of $1.56; revenues rose 23.8% year/year to $252.6 mln vs the $232.34 mln FactSet Consensus.\n• On February 11, 2026, the Company's Board of Directors declared a quarterly cash dividend of $0.45 per common share, with a payment date of March 20, 2026 to all shareholders of record as of March 6, 2026 (the record date)."},{"time":"06:47","ticker":"IRM","headline":"Iron Mountain beats by $0.05, beats on revs; guides FY26 FFO in-line, revs above consensus","body":"• Reports Q4 (Dec) funds from operations of $1.44 per share, excluding non-recurring items, $0.05 better than the FactSet Consensus of $1.39; revenues rose 16.6% year/year to $1.84 bln vs the $1.81 bln FactSet Consensus.\n• Co issues guidance for FY26, sees FFO of $5.69-5.79, excluding non-recurring items, vs. $5.70 FactSet Consensus; sees FY26 revs of $7.625-7.725 bln vs. $7.59 bln FactSet Consensus.\n• \"We are pleased to report another record performance in the fourth quarter above our expectations, concluding our fifth consecutive year of all-time highs for Revenue, Adjusted EBITDA, and AFFO. Our team's steadfast commitment to delivering innovative solutions for our customers as part of our growth strategy continues to drive exceptional performance across each of our business segments,\" said William L. Meaney, President and CEO of Iron Mountain. \"Our outlook for continued double digit revenue and profit growth in 2026 remains equally promising, as our growth businesses represent an increasingly larger portion of our revenue and our highly recurring physical records storage business sustains its solid growth trajectory. With strong data center leasing in the fourth quarter, we enter 2026 with momentum underwritten by the 400 megawatts of capacity being energized over the next 24 months. Across all our business areas we are off to a strong start to the year and expect to deliver another year of record performance.\""},{"time":"06:47","ticker":"MRK","headline":"Merck  advances treatment of bladder and kidney cancers with new data at 2026 ASCO GU Cancers Symposium","body":"• First-time data from the Phase 3 KEYNOTE-B15/EV-304 trial evaluating KEYTRUDA, Merck's anti-PD-1 therapy, plus Padcev - enfortumab vedotin-ejfv (PFE ALPMY) as neoadjuvant and adjuvant treatment (before and after surgery) for patients with muscle-invasive bladder cancer who are eligible for cisplatin (abstract #LBA630, Oral abstract session B: Urothelial carcinoma), which will be featured in the official ASCO GU Press Program.\n• Results from the first interim analysis of the Phase 3 LITESPARK-022 trial evaluating KEYTRUDA in combination with WELIREG, Merck's first-in-class oral hypoxia-inducible factor-2 alpha (HIF-2a) inhibitor, as a treatment for patients with clear cell renal cell carcinoma (RCC) following nephrectomy (abstract #LBA418, Oral abstract session C: Renal cell cancer and testicular cancer), which will be featured in the official ASCO GU Press Program.\n• First presentation of data from the Phase 3 LITESPARK-011 trial evaluating WELIREG plus (ESAIY) LENVIMA, an orally available multiple receptor tyrosine kinase inhibitor (TKI) discovered by Eisai, as a treatment for patients with advanced RCC whose disease progressed on or after treatment with anti-PD-1/L1 therapy (abstract #LBA417, Oral abstract session C: Renal cell cancer and testicular cancer), which will be featured in the official ASCO GU Press Program.\n• First-time data presentation for the Phase 2 MK-2870-002 study evaluating sac-TMT plus KEYTRUDA for patients with advanced urothelial carcinoma (abstract #744, Poster session B: Prostate cancer and urothelial carcinoma)."},{"time":"06:45","ticker":"BRO","headline":"Brown &amp; Brown has entered into an accelerated share repurchase program with Bank of America, N.A. for $250 mln of the Company's common stock","body":"The ASR is part of the Company's board-approved $1.5 bln share repurchase authorization announced on October 22, 2025."},{"time":"06:42","ticker":"AMG","headline":"Affiliated Managers announced that Thomas M. Wojcik will be stepping down as the President and Chief Operating Officer, effective on March 6, 2026","body":"Upon Mr. Wojcik's departure, his responsibilities will be allocated to other members of the senior leadership team."},{"time":"06:39","ticker":"UTZ","headline":"Utz Brands beats by $0.01, reports revs in-line; guides FY26 EPS below consensus; announces buyback","body":"• Reports Q4 (Dec) earnings of $0.26 per share, excluding non-recurring items, $0.01 better than the FactSet Consensus of $0.25; revenues rose 0.4% year/year to $342.2 mln vs the $343.43 mln FactSet Consensus.\n• Co issues downside guidance for FY26, sees EPS of -3 to -6% yr/yr or $0.77 to $0.80, excluding non-recurring items, vs. $0.89 FactSet Consensus.FY26 organic net sales growth expected between 2% and 3%.\n• FY26 organic net sales growth expected between 2% and 3%.\n• Board approved $50 mln buyback."},{"time":"06:38","ticker":"VNT","headline":"Vontier beats by $0.01, beats on revs; guides Q1 EPS below consensus, revs below consensus; guides FY26 EPS in-line, revs above consensus","body":"• Reports Q4 (Dec) earnings of $0.86 per share, excluding non-recurring items, $0.01 better than the FactSet Consensus of $0.85; revenues rose 4.1% year/year to $808.5 mln vs the $764.7 mln FactSet Consensus.\n• Co issues downside guidance for Q1, sees EPS of $0.78-$0.81, excluding non-recurring items, vs. $0.82 FactSet Consensus; sees Q1 revs of $730-$740 mln vs. $752.96 mln FactSet Consensus.\n• Co issues guidance for FY26, sees EPS of $3.35-$3.50, excluding non-recurring items, vs. $3.40 FactSet Consensus; sees FY26 revs of $3.10-$3.15 bln vs. $3.09 bln FactSet Consensus."},{"time":"06:38","ticker":"PBF","headline":"PBF Energy beats by $0.59, reports revs in-line","body":"• Reports Q4 (Dec) earnings of $0.49 per share, excluding non-recurring items, $0.59 better than the FactSet Consensus of ($0.10); revenues fell 2.9% year/year to $7.14 bln vs the $7.11 bln FactSet Consensus.\n• Martinez Refinery Update: Construction activities are expected to be complete by February 16, 2026, at the 157,000 barrel per day Martinez, California refinery following the February 1, 2025, incident.\n• The company announced today that it will pay a quarterly dividend of $0.275 per share of Class A Common Stock on March 11, 2026, to shareholders of record at the close of business on February 25, 2026."},{"time":"06:38","ticker":"ASTS","headline":"AST SpaceMobile announces pricing of private offering of $1.0 billion of convertible senior notes due 2036","body":"• The sale of the Notes to the initial purchasers is expected to settle on February 17, 2026, subject to customary closing conditions.\n• The Notes have an initial conversion price of approximately $116.30 per share of AST SpaceMobile's Class A common stock, which represents a premium of approximately 20% to the last reported sale price of AST SpaceMobile's Class A common stock on February 11, 2026.\n• AST SpaceMobile estimates that the net proceeds from the Notes Offering will be approximately $983.7 million (or approximately $1,131.4 million if the initial purchasers' option to purchase additional Notes is exercised in full), after deducting the initial purchasers' discounts and commissions and estimated offering expenses payable by AST SpaceMobile. AST SpaceMobile intends to use the net proceeds from the Notes Offering for general corporate purposes, including without limitation, accelerating the deployment of AST SpaceMobile's controlled spectrum bands on a global basis, monetizing the capabilities of AST SpaceMobile's proprietary technology to capture the evolving commercial opportunities related to artificial intelligence, enhancing investment in government space opportunities in the U.S, reducing higher interest debt, and pursuing opportunistic investments to accelerate AST SpaceMobile's SpaceMobile Service and capabilities.\n• The Notes will be senior, unsecured obligations of AST SpaceMobile. The Notes will accrue interest at an annual rate of 2.250%, payable semiannually in arrears on April 15 and October 15 of each year, beginning on October 15, 2026. The Notes will mature on April 15, 2036, unless earlier converted or repurchased."},{"time":"06:37","ticker":"AMG","headline":"Affiliated Managers announces its acquisition of a minority equity interest in HighBrook Investo","body":"• AMG invests in HighBrook, a real estate investment manager specializing in thematic value-add opportunities in the U.S. and Europe.\n• HighBrook to leverage AMG's strategic capabilities to enhance its long-term success and continue to build an enduring firm.\n• Partnership further diversifies AMG's business and expands its participation in global private markets.\n• The terms of the transaction were not disclosed.\n• HighBrook's management team will continue to hold the majority of the firm's equity and direct its day-to-day operations. As part of the agreement, Mr. Carr and other senior members of the HighBrook leadership team have entered into long-term commitments with the firm."},{"time":"06:36","ticker":"ZBRA","headline":"Zebra Tech reports EPS in-line, revs in-line; guides Q1 EPS in-line, revs in-line; guides FY26 EPS in-line, revs in-line; Authorizes repurchase of $1 bln of common stock","body":"• Reports Q4 (Dec) earnings of $4.33 per share, excluding non-recurring items, in-line with the FactSet Consensus of $4.33; revenues rose 10.6% year/year to $1.48 bln vs the $1.47 bln FactSet Consensus.\n• Co issues in-line guidance for Q1, sees EPS of $4.05-$4.35, excluding non-recurring items, vs. $4.15 FactSet Consensus; sees Q1 revs growth of 11-15%, equating to revenue of $1.45-$1.50 bln vs. $1.45 bln FactSet Consensus.\n• Co issues in-line guidance for FY26, sees EPS of $17.70-$18.30, excluding non-recurring items, vs. $17.79 FactSet Consensus; sees FY26 revs growth of 9-13%, equating to revenue of $5.88-$6.09 bln vs. $5.94 bln FactSet Consensus.\n• Zebra's Board of Directors has authorized the repurchase of $1 billion of common stock, which augments the previous $1 billion purchase authorization."},{"time":"06:35","ticker":"FTAI","headline":"FTAI Aviation Ltd. announces the following executive appointments, which are effective immediately","body":"• David Moreno has been appointed to the new role of President. As President, Mr. Moreno will be responsible for steering the Company's strategic growth initiatives and managing the day-to-day performance of the business.Mr. Moreno is the President of FTAI. From 2021 to 2026, Mr. Moreno served as Chief Operating Officer where he was responsible for the Company's growth initiatives, strategic acquisitions and partnerships.\n• Mr. Moreno is the President of FTAI. From 2021 to 2026, Mr. Moreno served as Chief Operating Officer where he was responsible for the Company's growth initiatives, strategic acquisitions and partnerships.\n• Stacy Kuperus has been appointed to the role of Chief Operating Officer. In this role, Ms. Kuperus will be focused on overseeing the Company's global aviation operations and driving performance and operational excellence across the Company's engine maintenance facilities.Ms. Kuperus is the Chief Operating Officer of FTAI. From 2021 to 2026, Ms. Kuperus served as Chief Portfolio Officer where she was responsible for business operations and deal execution across the various portfolios of owned assets.\n• Ms. Kuperus is the Chief Operating Officer of FTAI. From 2021 to 2026, Ms. Kuperus served as Chief Portfolio Officer where she was responsible for business operations and deal execution across the various portfolios of owned assets."},{"time":"06:34","ticker":"ETR","headline":"Entergy misses by $0.01; guides FY26 EPS in-line","body":"• Reports Q4 (Dec) earnings of $0.51 per share, excluding non-recurring items, $0.01 worse than the FactSet Consensus of $0.52.\n• Co issues in-line guidance for FY26, sees EPS of $4.25 to $4.45, excluding non-recurring items, vs. $4.38 FactSet Consensus."},{"time":"06:34","ticker":"ASTS","headline":"AST SpaceMobile prices repurchases of convertible senior notes to be funded by concurrent registered direct offerings of class A common stock","body":"• The Co. announces the pricing of cash repurchases of approximately $46.5 million aggregate principal amount of its 4.25% convertible senior notes due 2032 and $250.0 million of its 2.375% convertible senior notes due 2032 and its offering of approximately 6.3 million shares of its Class A common stock to holders of Existing Notes participating in the Repurchases in two separate direct placements registered under the Securities Act of 1933, as amended.\n• With this series of transactions, AST SpaceMobile will issue approximately 1.15 million incremental shares to the underlying shares of the Existing Notes being repurchased while removing approximately $300 million of debt from the balance sheet and approximately $51.4 million of remaining interest. Both the closing of the Repurchases and the Registered Direct Offerings are expected to take place on or about February 20, 2026. Each Registered Direct Offering and the Repurchases of the relevant series of Existing Notes to be funded by such offering are cross-conditional.\n• AST SpaceMobile intends to use the net proceeds from the relevant Registered Direct Offering, together with cash on hand, to repurchase approximately $46.5 million principal amount of the 4.25% Convertible Notes and $250.0 million principal amount of the 2.375% Convertible Notes, respectively, for cash pursuant to separate, privately negotiated transactions with a limited number of holders of such Existing Notes. After giving effect to the Repurchases, approximately $3.5 million aggregate principal amount of the 4.25% Convertible Notes will remain outstanding and $325.0 million aggregate principal amount of the 2.375% Convertible Notes will remain outstanding."},{"time":"06:34","ticker":"QSR","headline":"Restaurant Brands Int'l beats by $0.01, beats on revs","body":"• Reports Q4 (Dec) earnings of $0.96 per share, excluding non-recurring items, $0.01 better than the FactSet Consensus of $0.95; revenues rose 7.4% year/year to $2.47 bln vs the $2.41 bln FactSet Consensus.Consolidated system-wide sales grow 5.8% in the fourth quarter. Consolidated comparable sales up 3.1% in Q4, led by 6.1% at INTL, 2.8% at TH Canada and 2.6% at BK US.\n• Consolidated system-wide sales grow 5.8% in the fourth quarter.\n• Consolidated comparable sales up 3.1% in Q4, led by 6.1% at INTL, 2.8% at TH Canada and 2.6% at BK US.\n• RBI continues to expect the following long-term consolidated performance on average, from 2024 to 2028: 3%+ Comparable Sales; and 8%+ organic Adjusted Operating Income growth. In addition, the Company continues to expect to reach 5%+ Net Restaurant Growth towards the end of its algorithm period.\n• 3%+ Comparable Sales; and\n• 8%+ organic Adjusted Operating Income growth.\n• In addition, the Company continues to expect to reach 5%+ Net Restaurant Growth towards the end of its algorithm period.\n• The RBI board of directors has declared a dividend of $0.65 per common share and partnership exchangeable unit of RBI LP for the first quarter of 2026. The dividend will be payable on April 2, 2026 to shareholders and unitholders of record at the close of business on March 19, 2026. RBI also announced an annual total dividend target of $2.60 per RBI common share and per partnership exchangeable unit of RBI LP for 2026."},{"time":"06:32","ticker":"RPC","headline":"Ridgepost Capital reports fourth quarter and full year 2025 earnings results","body":"DALLAS, Feb. 12, 2026 (GLOBE NEWSWIRE) -- Ridgepost Capital, Inc (NYSE: RPC) (\"Ridgepost Capital\" or the \"Company\"), a leading private markets solutions provider, today reported financial results for the fourth quarter and year ended December 31, 2025.Click here for full release."},{"time":"06:28","ticker":"ICLR","headline":"ICON plc conducting internal investigation initiated by the Audit Committee into certain of the company's accounting practices and controls; Is also withdrawing previously issued FY25 financial guidance","body":"• Co announces an ongoing internal investigation initiated by the Audit Committee of the Board of Directors in late October 2025 into certain of the Company's accounting practices and controls, following concerns reported to the Audit Committee through Company management. Outside legal counsel is conducting the investigation with the support of forensic and technical accounting firms.\n• The investigation primarily focuses on revenue recognition in fiscal years 2023 through 2025. The Company is in the process of evaluating the design and operation of certain internal controls over financial reporting and expects to report one or more material weaknesses as a result.\n• While the investigation is continuing, at this time, preliminary indications are that the Company's revenue in 2023 and 2024 may have been overstated by less than two percent for each fiscal year.\n• Due to the ongoing investigation, including a delay of normal quarter and year-end reporting processes, the Company is not yet able to communicate its 2025 financial performance and is withdrawing its previously issued 2025 full year financial guidance."},{"time":"06:27","ticker":"ZBRA","headline":"Zebra Tech had approved a $1 bkn increase to the Company's existing authorization to repurchase shares of Zebra Technologies Corporation Common Stock","body":"This increase to the repurchase authorization augments the $1 bln authorization that was announced on July 30, 2019 and the previous $1 blnincrease to the authorization that was announced on May 17, 2022."},{"time":"06:20","ticker":"WFG","headline":"West Fraser announces fourth quarter 2025 results","body":"VANCOUVER, BC, Feb. 11, 2026 /PRNewswire/ - West Fraser Timber Co. Ltd. (\"West Fraser\" or the \"Company\") (TSX and NYSE: WFG) reported today the fourth quarter results of 2025 (\"Q4-25\"). All dollar amounts in this news release are expressed in U.S. dollars unless noted otherwise.Click here for full release."},{"time":"06:20","ticker":"TRU","headline":"TransUnion beats by $0.04, beats on revs; guides Q1 EPS below consensus, revs above consensus; guides FY26 EPS below consensus, revs above consensus","body":"• Reports Q4 (Dec) earnings of $1.07 per share, excluding non-recurring items, $0.04 better than the FactSet Consensus of $1.03; revenues rose 13.0% year/year to $1.17 bln vs the $1.13 bln FactSet Consensus.\n• Co issues mixed guidance for Q1, sees EPS of $1.08-1.10, excluding non-recurring items, vs. $1.16 FactSet Consensus; sees Q1 revs of $1.195-1.205 bln vs. $1.19 bln FactSet Consensus.\n• Co issues mixed guidance for FY26, sees EPS of $4.63-4.71, excluding non-recurring items, vs. $4.88 FactSet Consensus; sees FY26 revs of $4.946-4.981 bln vs. $4.94 bln FactSet Consensus.\n• TransUnion's Board of Directors has declared a cash dividend of $0.125 per share for the fourth quarter of 2025. The dividend will be payable on March 13, 2026, to shareholders of record on February 26, 2026."},{"time":"06:18","ticker":"LGO","headline":"Largo Resources provides update on status of Iron Ore Calcine commercial transaction","body":"• Iron Ore Calcine Transaction update: The purchaser has failed to make the initial payment under the terms of the US$56 million iron ore sale agreement and Largo will terminate the contract if payment is not received by February 20, 2026 and potentially pursue alternative transactions for this iron ore calcines with other interested parties. Largo believes that is has ample cash on hand to offset this potential near term set back.\n• U.S. FeV prices have increased approximately 30% over the past month, materially outpacing European price movements.\n• Structural supply constraints in the U.S. market persist, driven by limited conversion capacity and restricted access to certain alternative origins, in part due to U.S. tariffs and sanctions.\n• Largo is well positioned to supply the U.S. market as a reliable, Western-aligned primary producer, subject to existing tariff constraints."},{"time":"06:17","ticker":"ATNI","headline":"ATN International to sell 214 U.S. towers for up to $297 mln in cash","body":"• ATN International agreed to divest 214 Southwestern U.S. towers and related operations to an affiliate of Everest Infrastructure Partners for up to $297 mln in an all-cash transaction.Co expects initial closing in Q2 2026 with $250--$270 mln in gross proceeds, of which $20--$35 mln will be subject to post-closing conditions; an additional $27--$47 mln is tied to milestone-based subsequent closings.Estimated taxes, minority payouts, and transaction expenses are expected to total 25--30% of gross proceeds; Co plans to use proceeds to reduce debt and invest in core operations, including ~$70 mln to repay its CoBank revolver.Upon full completion, Co anticipates an annualized reduction of $5--$7 mln in revenue, $4--$6 mln in operating income, and $10--$13 mln in EBITDA from removing the tower portfolio.\n• Co expects initial closing in Q2 2026 with $250--$270 mln in gross proceeds, of which $20--$35 mln will be subject to post-closing conditions; an additional $27--$47 mln is tied to milestone-based subsequent closings.\n• Estimated taxes, minority payouts, and transaction expenses are expected to total 25--30% of gross proceeds; Co plans to use proceeds to reduce debt and invest in core operations, including ~$70 mln to repay its CoBank revolver.\n• Upon full completion, Co anticipates an annualized reduction of $5--$7 mln in revenue, $4--$6 mln in operating income, and $10--$13 mln in EBITDA from removing the tower portfolio."},{"time":"06:14","ticker":"GEL","headline":"Genesis Energy, L.P.","body":"• Reports Q4 (Dec) earnings of $0.04 per share; revenues rose 10.5% year/year to $440.76 mln."},{"time":"06:13","ticker":"GEO","headline":"Geo Group announces that GEO's Chief Executive Officer, J. David Donahue, has notified the Company of his retirement, effective February 28, 2026","body":"GEO further announced that the Company's Founder and Executive Chairman, Dr. George C. Zoley, will return to the position of Chairman and Chief Executive Officer under an amended employment agreement effective March 1, 2026 through April 2, 2029."},{"time":"06:09","ticker":"LNC","headline":"Lincoln National beats by $0.31, beats on revs","body":"• Reports Q4 (Dec) earnings of $2.21 per share, excluding non-recurring items, $0.31 better than the FactSet Consensus of $1.90; revenues fell 2.8% year/year to $4.92 bln vs the $4.85 bln FactSet Consensus."},{"time":"06:09","ticker":"AVNT","headline":"Avient beats by $0.01, beats on revs; guides Q1 EPS in-line; guides FY26 EPS in-line","body":"• Reports Q4 (Dec) earnings of $0.56 per share, excluding non-recurring items, $0.01 better than the FactSet Consensus of $0.55; revenues rose 1.9% year/year to $761 mln vs the $748.4 mln FactSet Consensus.\n• Co issues in-line guidance for Q1, sees EPS of $0.81, excluding non-recurring items, vs. $0.81 FactSet Consensus.\n• Co issues in-line guidance for FY26, sees EPS of $2.93-$3.17, excluding non-recurring items, vs. $3.06 FactSet Consensus.\n• \"Demand conditions are expected to remain mixed as we start 2026, and while we are optimistic for improving macro trends, we are not relying on it to deliver earnings growth. We expect the carryover impact of our 2025 initiatives and continued focus on productivity and cash preservation to enable earnings growth in 2026, should the demand environment not improve,\" said Jamie Beggs, Senior Vice President and Chief Financial Officer, Avient Corporation."},{"time":"06:08","ticker":"SWX","headline":"Southwest Gas and Carl C. Icahn mutually agreed to terminate that certain Amended and Restated Cooperation Agreement","body":"As a result of such termination, all rights and obligations of the Parties thereunder were terminated, and the Cooperation Agreement is of no further force or effect. Notwithstanding the termination of the Cooperation Agreement, Andrew W. Evans, Henry P. Linginfelter and Ruby Sharma, each of whom was nominated as a director pursuant to the terms of the Cooperation Agreement, will remain on the Company's board of directors, and, subject to the Company's standard evaluation process of director candidates, the Company expects to renominate each of them for reelection at the Company's 2026 annual meeting of stockholders."},{"time":"06:07","ticker":"WST","headline":"West Pharm beats by $0.21, beats on revs; guides Q1 EPS mostly above consensus, revs above consensus; guides FY26 EPS above consensus, revs in-line","body":"• Reports Q4 (Dec) earnings of $2.04 per share, excluding non-recurring items, $0.21 better than the FactSet Consensus of $1.83; revenues rose 7.5% year/year to $805 mln vs the $794.89 mln FactSet Consensus.\n• Co issues guidance for Q1, sees EPS of $1.65-1.70, excluding non-recurring items, vs. $1.65 FactSet Consensus; sees Q1 revs of $770-790 mln vs. $762.94 mln FactSet Consensus.\n• Co issues guidance for FY26, sees EPS of $7.85-8.20, excluding non-recurring items, vs. $7.76 FactSet Consensus; sees FY26 revs of $3.215-3.275 bln vs. $3.24 bln FactSet Consensus."},{"time":"06:06","ticker":"LXP","headline":"LXP Industrial Trust misses by $0.03, beats on revs; guides FY26 FFO below consensus","body":"• Reports Q4 (Dec) funds from operations of $0.79 per share, excluding non-recurring items, $0.03 worse than the FactSet Consensus of $0.82; revenues fell 14.0% year/year to $86.7 mln vs the $82.41 mln FactSet Consensus.\n• Same-Store NOI increased 2.9% for the full year and was in line for the quarter compared to the same periods in 2024.\n• Co issues downside guidance for FY26, sees FFO of $3.22-$3.37, excluding non-recurring items, vs. $3.45 FactSet Consensus."},{"time":"06:04","ticker":"PCG","headline":"PG&amp;E reports EPS in-line; guides FY26 EPS above consensus","body":"• Reports Q4 (Dec) earnings of $0.36 per share, excluding non-recurring items, in-line with the FactSet Consensus of $0.36.\n• Co issues upside guidance for FY26, sees EPS of $1.64-1.66, excluding non-recurring items, vs. $1.63 FactSet Consensus and prior guidance of $1.62-1.66.Targeting customer bill inflation of 0-3% versus 2-4% previously\n• Targeting customer bill inflation of 0-3% versus 2-4% previously"},{"time":"06:03","ticker":"GEO","headline":"Geo Group reports Q4 results; guides Q1 revs below consensus; guides FY26 revs in-line","body":"• Reports Q4 (Dec) earnings of $0.25 per share, excluding non-recurring items; revenues rose 16.5% year/year to $707.7 mln vs the $667.26 mln FactSet Consensus.\n• Co issues downside guidance for Q1, sees Q1 revs of $680-$690 mln vs. $690.71 mln FactSet Consensus.\n• Co issues in-line guidance for FY26, sees FY26 revs of $2.9-$3.1 bln vs. $2.95 bln FactSet Consensus. Expects full year 2026 Adjusted EBITDA to be in a range of $490 million to $510 million. Expects total Capital Expenditures for the full year 2026 to be between $120 million and $155 million."},{"time":"06:00","ticker":"","headline":"S&P futures vs fair value: +19.00. Nasdaq futures vs fair value: +71.00.","body":""},{"time":"06:00","ticker":"","headline":"European Markets","body":"FTSE...10497.7...+25.60...+0.20%. DAX...25186.32...+330.20...+1.30%."},{"time":"06:00","ticker":"","headline":"Asian Markets","body":"Nikkei...57639.84...-10.70...0.00%. Hang Seng...27032.55...-233.80...-0.90%."},{"time":"06:00","ticker":"SUMRX","headline":"Overnight Summary -- Global markets edge up, earnings momentum offsets softer U.K. growth","body":"• Global markets are leaning cautiously higher this morning, with U.S. futures firmly above fair value and Europe gaining momentum, while Asia shows divergence and commodities ease slightly as rates hold steady. S&P futures are up about 18 points, trading around 6978. The market witnessed a slow but methodical grind higher, setting the low of 6952.25 early in the session. The S&P trades closer to overnight high of 6986.25.\n• Asian markets close mixed on Thursday as stronger-than-expected U.S. jobs data boost confidence in the global growth outlook but temper expectations for near-term Federal Reserve rate cuts. Japan finishes little changed, with the Nikkei 225 slipping marginally after briefly topping 58,000, as traders digest a pullback in the yen and Prime Minister Takaichi's pledge of responsible stimulus, while stock-specific moves drive volatility in names like Shiseido and Honda. China edges higher, with the Shanghai Composite up modestly amid reports that the U.S. and China may extend their trade truce ahead of an April summit between Presidents Trump and Xi. Hong Kong underperforms, with the Hang Seng down 0.86% on weakness in technology shares, as a firmer dollar pressures precious metals and oil ticks up on ongoing U.S.--Iran tensions.\n• European equities trade at record highs, with the Stoxx 600 up 0.4% as strong corporate earnings offset softer U.K. growth data. The FTSE 100 trades positive, even as U.K. fourth-quarter GDP grew just 0.1% sequentially and 1.0% year-over-year, both below forecasts. Earnings drive sentiment, with Siemens surging after raising its fiscal 2026 outlook, EssilorLuxottica soaring on strong AI-glasses demand, and Legrand lifting its dividend and growth targets. M&A activity adds fuel, as Schroders spikes on a 9.9 bln takeover by Nuveen, while British American Tobacco announces a larger buyback and Unilever slips despite modest sales growth.\n• S&P Futures vs Fair Value: +18.0\n• 10 yr Note: 4.175%\n• USD/JPY: 152.99 -0.28\n• EUR/USD: 1.1878 +0.0004\n• Europe: FTSE: +0.2% DAX: +1.3% CAC: +0.6%\n• Asia: Hang Seng: -0.9% Shanghai: +0.1% Nikkei: 0.0%\n• Gold (5086.60 -11.90) Silver (83.380 -0.540) Crude (64.32 -0.31)"},{"time":"05:50","ticker":"WIRES","headline":"On The Wires","body":"• Oracle (ORCL) Health announced its Clinical AI Agent, Clinical Note is now available in the UK. The new AI solution allows caregivers at the NHS and private practices to use an ambient voice and screen-driven assistant to draft patient notes, so they can reduce administrative tasks and devote more time to patient care. Trusts participating in the pilot program, including Barts Health NHS Trust, Imperial College Healthcare NHS Trust, and Milton Keynes University Hospital, are now deploying the solution more broadly across their organizations.\n• Jacobs (J) has secured a four-year contract extension from the U.K. Department for Transport to continue leading the National Security Science and Research (NSSR) program. The program demonstrates how government and industry can work together to accelerate and translate innovation into operational outcomes that strengthen security and resilience across the U.K.'s air, road and rail networks.\n• AIxCrypto Inc. (AIXC) announced its strategic partnership with BitMart to launch a co-branded virtual prepaid card, marking a key milestone in the Company's roadmap to bridge Web3 capabilities with everyday commerce for its global community. Through this partnership, eligible users will gain access to a co-branded virtual prepaid card designed to support everyday digital payments, online spending, and integration with major digital wallet ecosystems. The offering is intended to enhance practical utility and real-world payment flexibility for users engaging with digital asset platforms, subject to applicable terms and regional availability."},{"time":"05:45","ticker":"MBGYY","headline":"Mercedes-Benz Group AG reports FY25 results","body":"• Mercedes-Benz Group delivered adjusted earnings before interest and taxes (EBIT) of 8.2 billion (2024: 13.7 billion). Group revenues came in at 132.2 billion (2024: 145.6 billion). The free cash flow of the industrial business reached 5.4 billion (2024: 9.2 billion), mainly due to positive effects from lighter inventories and negative effects from net investments in property, plant & equipment and intangible assets. The net liquidity of the industrial business stood at 32.2 billion (end of 2024: 31.4 billion).\n• Top-End cars reached 15% of overall sales for Mercedes-Benz Cars in 2025. Leveraging this solid foundation, 140 years after Carl Benz registered his patent for the first motor car, Mercedes-Benz is accelerating the rollout of new products to drive future growth.\n• In November 2025, Mercedes-Benz initiated a share buyback programme of up to 2 billion (not including incidental costs) on the stock exchange over a period of up to 12 months. By the end of 2025, Mercedes-Benz bought back approximately 300 million worth of shares, leaving up to 1.7 billion still to come in 2026. This buyback is based on and in line with the existing capital allocation and buyback policy, which states that any future free cash flow of the industrial business (as available post potential M&A) shall be used to fund dividend payments and share buybacks.\n• Full Release"},{"time":"05:25","ticker":"SSNLF","headline":"Samsung announced that it has begun mass production of its industry-leading HBM4 and has shipped commercial products to customers","body":"• This achievement marks a first in the industry, securing an early leadership position in the HBM4 market.\n• By proactively leveraging its most advanced 6th-generation 10 nanometer (nm)-class DRAM process (1c), the company achieved stable yields and industry-leading performance from the outset of mass production - all accomplished seamlessly and without any additional redesigns.\n• \"Instead of taking the conventional path of utilizing existing proven designs, Samsung took the leap and adopted the most advanced nodes like the 1c DRAM and 4nm logic process for HBM4,\" said Sang Joon Hwang, Executive Vice President and Head of Memory Development at Samsung Electronics. \"By leveraging our process competitiveness and design optimization, we are able to secure substantial performance headroom, enabling us to satisfy our customers' escalating demands for higher performance, when they need them.\"\n• Potential related stocks: WDC, MU, SNDK"},{"time":"05:16","ticker":"CHKP","headline":"Check Point Software beats by $0.64, reports revs in-line","body":"• Reports Q4 (Dec) earnings of $3.40 per share, $0.64 better than the FactSet Consensus of $2.76; revenues rose 5.9% year/year to $744.9 mln vs the $746.36 mln FactSet Consensus."},{"time":"05:14","ticker":"FSM","headline":"Fortuna Silver Mines extends high grade gold mineralization at Sunbird, Including 6.1&nbsp;g/t Au over 18.9 meters, Sgula Mine, Cte d'Ivoire","body":"VANCOUVER, British Columbia, Feb. 12, 2026 (GLOBE NEWSWIRE) -- Fortuna Mining Corp. (NYSE: FSM | TSX: FVI) is pleased to report results from ongoing exploration drilling at the Sunbird deposit, located at the Sgula Mine in Cte d'Ivoire (see Figure 1). Recent drilling has successfully extended mineralization at depth and expanded a second high grade mineralized shoot.Click here for full release."},{"time":"05:11","ticker":"WIRES","headline":"On The Wires","body":"• Broadridge Financial Solutions (BR) announced that its Distributed Ledger Repo platform processed an average of $365 billion in daily repo transactions during January, with volumes totaling $7.3 trillion. The daily average is a 508% increase year-over-year during the same month in 2025, underscoring the continued institutional adoption of tokenized real-asset settlement at scale as the platform sustains momentum from a breakout year.\n• StepStone Group (STEP) announced today it is partnering with Utmost, a leading global provider of insurance-based wealth solutions. This provides Utmost's UK-based clients with access to StepStone's entire suite of evergreen global private markets strategies across Private Equity, Venture Capital & Growth, Private Credit, and Private Infrastructure. StepStone leverages a global perspective on private markets and relationships with a range of experienced investment managers across different investment strategies. Through this partnership, UK investors will be able to diversify their portfolios and have the ability to improve their long-term financial outcomes. This will support not only their own goals but also broader government-backed initiatives designed to encourage investment in unlisted equities and private markets.\n• InterDigital (IDCC) announced that Atle Monrad has been re-elected for a second term to Chair the 3GPP SA6 working group. SA6 is responsible for service architecture, procedures, and information flows that enable applications, vertical services, and critical communications. The group's work ensures network capabilities can be effectively exposed and leveraged by vertical industries, emerging service providers, and public safety organizations.\n• Garrett Motion Inc. (GTX) announced the first commercial application of its largest MEG turbocharger platform with Weichai's next-generation large-bore engine programs. This deployment marks an important advancement in extending Garrett's advanced turbocharging technologies into higher power applications for marine propulsion and power generation systems."},{"time":"05:10","ticker":"ANL","headline":"Adlai Nortye announces first patient enrolled in global Phase 1 Trial of Pan-RAS (ON) Inhibitor AN9025 for Solid Tumors Harboring RAS Mutations","body":"SINGAPORE and NORTH BRUNSWICK, N.J. and HANGZHOU, China, Feb. 12, 2026 (GLOBE NEWSWIRE) -- Adlai Nortye Ltd. (NASDAQ: ANL) (the \"Company\" or \"Adlai Nortye\"), a clinical-stage biotechnology company focused on the development of innovative cancer therapies, today announced that the first patient has been dosed in the United States in early February in its ongoing Phase 1 clinical trial of AN9025, a pan-RAS (ON) inhibitor.Click here for full release."},{"time":"05:08","ticker":"WIRES","headline":"On The Wires","body":"• Broadridge Financial Solutions Inc. (BR) announced that Nissay Asset Management Corporation has implemented Broadridge's Mortgage--Backed Securities Trade Assignment Portal, becoming the first asset management company in Japan to adopt the solution. Trade Assignment Portal automates and digitizes Nissay Asset Management's Assignment of Trade processes for TBA (To-Be-Announced) trading of mortgage--backed securities, allowing the firm to instantly create and electronically sign contract documents, send AOT letters to multiple recipients at once, and track progress in real time. The solution also stores completed AOTs securely in the cloud, significantly reducing manual workload and improving transparency.\n• CME Group (CME) announced plans to launch four South Asia edible oil futures contracts on March 2, 2026, pending regulatory review. The new products are cash-settled and include two outright contracts and two spread contracts that will be based on the Fastmarkets Soyoil CFR India and Crude Palm Oil CFR West Coast India assessments.\n• Mitek Systems (MITK) announced enhancements to its SEPBLAC-compliant digital onboarding capabilities for the Spanish market, designed to help regulated entities defend against a rapidly escalating wave of AI-driven identity fraud. The enhancements strengthen Mitek's unassisted video verification solution, used across Spain for SEPBLAC-compliant remote identity verification."},{"time":"04:59","ticker":"BUD","headline":"Anheuser-Busch InBev beats by $0.07, reports revs in-line","body":"• Reports Q4 (Dec) earnings of $0.95 per share, $0.07 better than the FactSet Consensus of $0.88; revenues rose 6.2% year/year to $15.55 bln vs the $15.59 bln FactSet Consensus.\n• 2026 OutlookOverall Performance: Co expects EBITDA to grow in line with our medium-term outlook of between 4-8%. The outlook for FY26 reflects current assessment of inflation and other macroeconomic conditions.Net Finance Costs: Net pension interest expenses and accretion expenses are expected to be in the range of $190 to 220 million per quarter, depending on currency and interest rate fluctuations. Co expects the average gross debt coupon in FY26 to be approximately 4%.Net Capital Expenditure: Co expects net capital expenditure of between $3.5 and 4.0 billion in FY26.\n• Overall Performance: Co expects EBITDA to grow in line with our medium-term outlook of between 4-8%. The outlook for FY26 reflects current assessment of inflation and other macroeconomic conditions.\n• Net Finance Costs: Net pension interest expenses and accretion expenses are expected to be in the range of $190 to 220 million per quarter, depending on currency and interest rate fluctuations. Co expects the average gross debt coupon in FY26 to be approximately 4%.\n• Net Capital Expenditure: Co expects net capital expenditure of between $3.5 and 4.0 billion in FY26."},{"time":"04:51","ticker":"WRD","headline":"WeRide and Uber (UBER) launch first downtown commercial robotaxi service in Abu Dhabi","body":"• WeRide (WRD) and Uber Technologies (UBER) began the first commercial robotaxi operations in downtown Abu Dhabi, expanding coverage to ~70% of the city's core areas.Service now operates across Khalifa City, Masdar City, Rabdan, and routes between Corniche Road and the Sheikh Zayed Grand Mosque, endorsed by the Integrated Transport Centre.Riders can access WeRide's Robotaxi GXR via UberX, Uber Comfort, or a dedicated \"Autonomous\" option; vehicles currently include an onboard safety specialist.Fleet has quadrupled since December 2024 launch, with over 200 robotaxis in the Middle East and a target to deploy at least 1,200 units across Abu Dhabi, Dubai, and Riyadh as soon as 2027.\n• Service now operates across Khalifa City, Masdar City, Rabdan, and routes between Corniche Road and the Sheikh Zayed Grand Mosque, endorsed by the Integrated Transport Centre.\n• Riders can access WeRide's Robotaxi GXR via UberX, Uber Comfort, or a dedicated \"Autonomous\" option; vehicles currently include an onboard safety specialist.\n• Fleet has quadrupled since December 2024 launch, with over 200 robotaxis in the Middle East and a target to deploy at least 1,200 units across Abu Dhabi, Dubai, and Riyadh as soon as 2027."},{"time":"04:46","ticker":"NRGV","headline":"Energy Vault upsizes and prices offering of $140.0 mln of 5.250% convertible senior notes due 2031","body":"• The offering was upsized from the previously announced offering size of $125.0 million aggregate principal amount of Notes."},{"time":"04:44","ticker":"NKTR","headline":"Nektar Therapeutics prices offering $400 mln offering consisting of common stock and warrants","body":"• Co priced an upsized $400 mln underwritten public offering of common stock and pre-funded warrants.Co is selling 6,603,449 shares at $58.00 per share and 293,103 pre-funded warrants at $57.9999, with a $0.0001 exercise price.Gross proceeds are expected to total approximately $400 mln before underwriting discounts and expenses.\n• Co is selling 6,603,449 shares at $58.00 per share and 293,103 pre-funded warrants at $57.9999, with a $0.0001 exercise price.\n• Gross proceeds are expected to total approximately $400 mln before underwriting discounts and expenses."},{"time":"04:42","ticker":"NTST","headline":"NETSTREIT prices 10.98 mln shares of common stock at $19.00 per share","body":""},{"time":"04:39","ticker":"AMAT","headline":"Applied Materials settles export probe with Commerce for $252.5 mln; DOJ, SEC close reviews","body":"• Applied Materials reached a civil settlement with the U.S. Department of Commerce's Bureau of Industry and Security, agreeing to pay $252.5 mln to resolve export regulation allegations tied to China shipments between Nov. 2020 and July 2022.The matter stemmed from a misunderstanding of the applicability of certain U.S. Export Administration Regulations.The U.S. Department of Justice and the Securities and Exchange Commission have closed related investigations without taking action.With the settlement, the U.S. government's review is concluded, removing a regulatory overhang as Applied focuses on semiconductor demand and its technology roadmap.\n• The matter stemmed from a misunderstanding of the applicability of certain U.S. Export Administration Regulations.\n• The U.S. Department of Justice and the Securities and Exchange Commission have closed related investigations without taking action.\n• With the settlement, the U.S. government's review is concluded, removing a regulatory overhang as Applied focuses on semiconductor demand and its technology roadmap."},{"time":"04:35","ticker":"NWE","headline":"NorthWestern misses by $0.02, reports revs in-line; guides FY26 EPS in-line; raises dividend","body":"• Reports Q4 (Dec) earnings of $1.17 per share, excluding non-recurring items, $0.02 worse than the FactSet Consensus of $1.19; revenues rose 10.9% year/year to $414.3 mln vs the $414.26 mln FactSet Consensus.\n• Co issues in-line guidance for FY26, sees EPS of $3.68-3.83, excluding non-recurring items, vs. $3.83 FactSet Consensus.Co is affirming long-term diluted earnings per share growth guidance of 4% to 6%, based on 2024 adjusted diluted non-GAAP EPS baseline of $3.40.\n• Co is affirming long-term diluted earnings per share growth guidance of 4% to 6%, based on 2024 adjusted diluted non-GAAP EPS baseline of $3.40.\n• Additionally, is announcing a $3.2 billion capital investment plan for 2026-2030, which is expected to support rate base growth of 4% to 6% from our 2024 base year of approximately $5.4 billion. Co anticipates funding capital expenditures through cash flows from operations, available credit sources, debt issuances, and future rate increases. In order to fund South Dakota generation investment, equity issuances are expected beginning in 2027.\n• Dividend DeclaredNorthWestern Energy Group's Board of Directors has declared a quarterly common stock dividend of $0.67 per share, representing a 1.5% increase over the previous quarter's dividend. The dividend is payable on March 31, 2026, to shareholders of record as of March 13, 2026.Looking ahead, co remains committed to maintaining a dividend payout ratio within our targeted range of 60-70% over the long term.\n• NorthWestern Energy Group's Board of Directors has declared a quarterly common stock dividend of $0.67 per share, representing a 1.5% increase over the previous quarter's dividend. The dividend is payable on March 31, 2026, to shareholders of record as of March 13, 2026.\n• Looking ahead, co remains committed to maintaining a dividend payout ratio within our targeted range of 60-70% over the long term."},{"time":"04:28","ticker":"APC","headline":"ARKO Petroleum Corp. (Nasdaq) prices 11,111,111 share IPO at $18.00 per share, at the low end of the $18-20 expected range","body":""},{"time":"04:26","ticker":"AXG","headline":"Solowin Holdings secures up to $100 mln financing to expand stablecoin and tokenization strategy","body":"• SOLOWIN HOLDINGS (AXG) entered a securities purchase agreement with Streeterville Capital for up to $100 mln via pre-paid purchase agreements tied to Class A ordinary shares.The initial tranche of ~$5.4 mln (before OID and expenses) has closed; additional tranches are subject to mutual consent.Proceeds are earmarked for expanding the company's stablecoin and asset tokenization businesses, advancing AI and blockchain security R&D, and supporting global expansion.Terms were disclosed in a Form 6-K and related 424B5 prospectus supplement filed February 9, 2026; structure implies potential future share issuance depending on drawdowns.\n• The initial tranche of ~$5.4 mln (before OID and expenses) has closed; additional tranches are subject to mutual consent.\n• Proceeds are earmarked for expanding the company's stablecoin and asset tokenization businesses, advancing AI and blockchain security R&D, and supporting global expansion.\n• Terms were disclosed in a Form 6-K and related 424B5 prospectus supplement filed February 9, 2026; structure implies potential future share issuance depending on drawdowns."},{"time":"04:22","ticker":"FRMI","headline":"Fermi America advances Hyundai E&amp;C partnership for four AP1000 units at Project Matador","body":"• Fermi Inc. deepened its partnership with Hyundai Engineering & Construction Co., Ltd. to advance FEED work for four AP1000 reactors at its 11GW Project Matador campus near Amarillo, Texas.The companies engaged U.S. contractors at Hyundai E&C's nuclear technology seminar in Dallas to strengthen supply chain and workforce readiness as part of a broader push to restart large-scale U.S. nuclear construction.FEED activities include site layout, cooling system evaluations, and cost/schedule development to support a potential EPC pathway.Management highlighted AI-driven load growth and said Project Matador is positioned as one of the few advanced U.S. nuclear projects with active NRC engagement and readiness to break ground.\n• The companies engaged U.S. contractors at Hyundai E&C's nuclear technology seminar in Dallas to strengthen supply chain and workforce readiness as part of a broader push to restart large-scale U.S. nuclear construction.\n• FEED activities include site layout, cooling system evaluations, and cost/schedule development to support a potential EPC pathway.\n• Management highlighted AI-driven load growth and said Project Matador is positioned as one of the few advanced U.S. nuclear projects with active NRC engagement and readiness to break ground."},{"time":"04:20","ticker":"ODV","headline":"Osisko Development provides infill drilling update on its 13,000-meter Lowhee Program at Cariboo Gold Project","body":"MONTREAL, Feb. 11, 2026 (GLOBE NEWSWIRE) -- OsiskoDevelopment Corp. (NYSE: ODV, TSXV: ODV) (\"Osisko Development\" or the \"Company\") is pleased to announce new infill drilling results from its ongoing 13,000-meter program on 10 meter drill spacing that commenced in August 2025 in the Lowhee Zone of the Company's permitted, 100%-owned Cariboo Gold Project (\"Cariboo\" or the \"Project\"), located in central British Columbia (\"B.C.\"), Canada. The six drill hole fans reported herein comprise an additional ~5,043 meters (\"m\") of underground infill drilling, bringing the total tally of drilling with full results to 11,025 m, or ~80% of the planned total.Click here for full release."},{"time":"04:13","ticker":"MESO","headline":"Mesoblast highlights Ryoncil survival data at ASTCT/CIBMTR; adult pivotal trial set to begin","body":"• Mesoblast Limited presented data showing Ryoncil (remestemcel-L-rknd) delivered similarly high survival in steroid-refractory acute GVHD across children and adults, second- or third-line use, and ruxolitinib-nave or resistant patients.\n• Ryoncil is the first FDA-approved mesenchymal stromal cell product and the only therapy approved for children under 12 with SR-aGvHD.\n• In EIND patients treated = third line (89% grade III/IV), 15% died before completing therapy vs. 2% in second-line Phase 3 (MSB-GVHD001), underscoring benefit of earlier use post-steroid resistance.\n• Adult EIND patients showed day-100 survival at least comparable to pediatric patients; company plans to initiate a pivotal adult second-line trial this quarter to pursue label expansion."},{"time":"04:11","ticker":"SNY","headline":"Sanofi names Beln Garijo CEO; Hudson to step down","body":"• Sanofi will not renew Paul Hudson's director mandate; his last day as CEO is Feb. 17, 2026.\n• Beln Garijo, currently CEO of Merck KGaA, appointed Chief Executive Officer effective after the April 29, 2026 AGM; Board will propose her as director.\n• Olivier Charmeil named Interim CEO during the transition.\n• Garijo to focus on strengthening R&D productivity, governance, and innovation capacity; previously held senior roles at Sanofi and serves on the board of BBVA; former board member of L'Oral."},{"time":"04:08","ticker":"HEINY","headline":"Heineken launches 375 mln second tranche of 750 mln buyback","body":"• Heineken Holding N.V. begins the second 375 mln tranche of its up to 750 mln two-year share buyback program.\n• Repurchases will mirror its pro rata participation in the Heineken N.V. buyback, selling HEIA shares and buying back HEIO shares daily at VWAP.\n• Program expected to complete by 29 Jan 2027, or earlier if fully utilized."}],"fetchedAt":1770897880675},"savedAt":1770897880675}