{"data":{"updated":"2/12/2026, 6:04:26 AM","entries":[{"time":"06:00","ticker":"SUMRX","headline":"Overnight Summary -- Global markets edge up, earnings momentum offsets softer U.K. growth","body":"• Global markets are leaning cautiously higher this morning, with U.S. futures firmly above fair value and Europe gaining momentum, while Asia shows divergence and commodities ease slightly as rates hold steady. S&P futures are up about 18 points, trading around 6978. The market witnessed a slow but methodical grind higher, setting the low of 6952.25 early in the session. The S&P trades closer to overnight high of 6986.25.\n• Asian markets close mixed on Thursday as stronger-than-expected U.S. jobs data boost confidence in the global growth outlook but temper expectations for near-term Federal Reserve rate cuts. Japan finishes little changed, with the Nikkei 225 slipping marginally after briefly topping 58,000, as traders digest a pullback in the yen and Prime Minister Takaichi's pledge of responsible stimulus, while stock-specific moves drive volatility in names like Shiseido and Honda. China edges higher, with the Shanghai Composite up modestly amid reports that the U.S. and China may extend their trade truce ahead of an April summit between Presidents Trump and Xi. Hong Kong underperforms, with the Hang Seng down 0.86% on weakness in technology shares, as a firmer dollar pressures precious metals and oil ticks up on ongoing U.S.--Iran tensions.\n• European equities trade at record highs, with the Stoxx 600 up 0.4% as strong corporate earnings offset softer U.K. growth data. The FTSE 100 trades positive, even as U.K. fourth-quarter GDP grew just 0.1% sequentially and 1.0% year-over-year, both below forecasts. Earnings drive sentiment, with Siemens surging after raising its fiscal 2026 outlook, EssilorLuxottica soaring on strong AI-glasses demand, and Legrand lifting its dividend and growth targets. M&A activity adds fuel, as Schroders spikes on a 9.9 bln takeover by Nuveen, while British American Tobacco announces a larger buyback and Unilever slips despite modest sales growth.\n• S&P Futures vs Fair Value: +18.0\n• 10 yr Note: 4.175%\n• USD/JPY: 152.99 -0.28\n• EUR/USD: 1.1878 +0.0004\n• Europe: FTSE: +0.2% DAX: +1.3% CAC: +0.6%\n• Asia: Hang Seng: -0.9% Shanghai: +0.1% Nikkei: 0.0%\n• Gold (5086.60 -11.90) Silver (83.380 -0.540) Crude (64.32 -0.31)"},{"time":"05:50","ticker":"WIRES","headline":"On The Wires","body":"• Oracle (ORCL) Health announced its Clinical AI Agent, Clinical Note is now available in the UK. The new AI solution allows caregivers at the NHS and private practices to use an ambient voice and screen-driven assistant to draft patient notes, so they can reduce administrative tasks and devote more time to patient care. Trusts participating in the pilot program, including Barts Health NHS Trust, Imperial College Healthcare NHS Trust, and Milton Keynes University Hospital, are now deploying the solution more broadly across their organizations.\n• Jacobs (J) has secured a four-year contract extension from the U.K. Department for Transport to continue leading the National Security Science and Research (NSSR) program. The program demonstrates how government and industry can work together to accelerate and translate innovation into operational outcomes that strengthen security and resilience across the U.K.'s air, road and rail networks.\n• Samsung Electronics Co (SSNLF) announced that it has begun mass production of its industry-leading HBM4 and has shipped commercial products to customers. This achievement marks a first in the industry, securing an early leadership position in the HBM4 market.\n• AIxCrypto Inc. (AIXC) announced its strategic partnership with BitMart to launch a co-branded virtual prepaid card, marking a key milestone in the Company's roadmap to bridge Web3 capabilities with everyday commerce for its global community. Through this partnership, eligible users will gain access to a co-branded virtual prepaid card designed to support everyday digital payments, online spending, and integration with major digital wallet ecosystems. The offering is intended to enhance practical utility and real-world payment flexibility for users engaging with digital asset platforms, subject to applicable terms and regional availability."},{"time":"05:45","ticker":"MBGYY","headline":"Mercedes-Benz Group AG reports FY25 results","body":"• Mercedes-Benz Group delivered adjusted earnings before interest and taxes (EBIT) of 8.2 billion (2024: 13.7 billion). Group revenues came in at 132.2 billion (2024: 145.6 billion). The free cash flow of the industrial business reached 5.4 billion (2024: 9.2 billion), mainly due to positive effects from lighter inventories and negative effects from net investments in property, plant & equipment and intangible assets. The net liquidity of the industrial business stood at 32.2 billion (end of 2024: 31.4 billion).\n• Top-End cars reached 15% of overall sales for Mercedes-Benz Cars in 2025. Leveraging this solid foundation, 140 years after Carl Benz registered his patent for the first motor car, Mercedes-Benz is accelerating the rollout of new products to drive future growth.\n• In November 2025, Mercedes-Benz initiated a share buyback programme of up to 2 billion (not including incidental costs) on the stock exchange over a period of up to 12 months. By the end of 2025, Mercedes-Benz bought back approximately 300 million worth of shares, leaving up to 1.7 billion still to come in 2026. This buyback is based on and in line with the existing capital allocation and buyback policy, which states that any future free cash flow of the industrial business (as available post potential M&A) shall be used to fund dividend payments and share buybacks.\n• Full Release"},{"time":"05:25","ticker":"SSNLF","headline":"Samsung announced that it has begun mass production of its industry-leading HBM4 and has shipped commercial products to customers","body":"• This achievement marks a first in the industry, securing an early leadership position in the HBM4 market.\n• By proactively leveraging its most advanced 6th-generation 10 nanometer (nm)-class DRAM process (1c), the company achieved stable yields and industry-leading performance from the outset of mass production - all accomplished seamlessly and without any additional redesigns.\n• \"Instead of taking the conventional path of utilizing existing proven designs, Samsung took the leap and adopted the most advanced nodes like the 1c DRAM and 4nm logic process for HBM4,\" said Sang Joon Hwang, Executive Vice President and Head of Memory Development at Samsung Electronics. \"By leveraging our process competitiveness and design optimization, we are able to secure substantial performance headroom, enabling us to satisfy our customers' escalating demands for higher performance, when they need them.\"\n• Potential related stocks: WDC, MU, SNDK"},{"time":"05:16","ticker":"CHKP","headline":"Check Point Software beats by $0.64, reports revs in-line","body":"• Reports Q4 (Dec) earnings of $3.40 per share, $0.64 better than the FactSet Consensus of $2.76; revenues rose 5.9% year/year to $744.9 mln vs the $746.36 mln FactSet Consensus."},{"time":"05:14","ticker":"FSM","headline":"Fortuna Silver Mines extends high grade gold mineralization at Sunbird, Including 6.1&nbsp;g/t Au over 18.9 meters, Sgula Mine, Cte d'Ivoire","body":"VANCOUVER, British Columbia, Feb. 12, 2026 (GLOBE NEWSWIRE) -- Fortuna Mining Corp. (NYSE: FSM | TSX: FVI) is pleased to report results from ongoing exploration drilling at the Sunbird deposit, located at the Sgula Mine in Cte d'Ivoire (see Figure 1). Recent drilling has successfully extended mineralization at depth and expanded a second high grade mineralized shoot.Click here for full release."},{"time":"05:11","ticker":"WIRES","headline":"On The Wires","body":"• Broadridge Financial Solutions (BR) announced that its Distributed Ledger Repo platform processed an average of $365 billion in daily repo transactions during January, with volumes totaling $7.3 trillion. The daily average is a 508% increase year-over-year during the same month in 2025, underscoring the continued institutional adoption of tokenized real-asset settlement at scale as the platform sustains momentum from a breakout year.\n• StepStone Group (STEP) announced today it is partnering with Utmost, a leading global provider of insurance-based wealth solutions. This provides Utmost's UK-based clients with access to StepStone's entire suite of evergreen global private markets strategies across Private Equity, Venture Capital & Growth, Private Credit, and Private Infrastructure. StepStone leverages a global perspective on private markets and relationships with a range of experienced investment managers across different investment strategies. Through this partnership, UK investors will be able to diversify their portfolios and have the ability to improve their long-term financial outcomes. This will support not only their own goals but also broader government-backed initiatives designed to encourage investment in unlisted equities and private markets.\n• InterDigital (IDCC) announced that Atle Monrad has been re-elected for a second term to Chair the 3GPP SA6 working group. SA6 is responsible for service architecture, procedures, and information flows that enable applications, vertical services, and critical communications. The group's work ensures network capabilities can be effectively exposed and leveraged by vertical industries, emerging service providers, and public safety organizations.\n• Garrett Motion Inc. (GTX) announced the first commercial application of its largest MEG turbocharger platform with Weichai's next-generation large-bore engine programs. This deployment marks an important advancement in extending Garrett's advanced turbocharging technologies into higher power applications for marine propulsion and power generation systems."},{"time":"05:10","ticker":"ANL","headline":"Adlai Nortye announces first patient enrolled in global Phase 1 Trial of Pan-RAS (ON) Inhibitor AN9025 for Solid Tumors Harboring RAS Mutations","body":"SINGAPORE and NORTH BRUNSWICK, N.J. and HANGZHOU, China, Feb. 12, 2026 (GLOBE NEWSWIRE) -- Adlai Nortye Ltd. (NASDAQ: ANL) (the \"Company\" or \"Adlai Nortye\"), a clinical-stage biotechnology company focused on the development of innovative cancer therapies, today announced that the first patient has been dosed in the United States in early February in its ongoing Phase 1 clinical trial of AN9025, a pan-RAS (ON) inhibitor.Click here for full release."},{"time":"05:08","ticker":"WIRES","headline":"On The Wires","body":"• Broadridge Financial Solutions Inc. (BR) announced that Nissay Asset Management Corporation has implemented Broadridge's Mortgage--Backed Securities Trade Assignment Portal, becoming the first asset management company in Japan to adopt the solution. Trade Assignment Portal automates and digitizes Nissay Asset Management's Assignment of Trade processes for TBA (To-Be-Announced) trading of mortgage--backed securities, allowing the firm to instantly create and electronically sign contract documents, send AOT letters to multiple recipients at once, and track progress in real time. The solution also stores completed AOTs securely in the cloud, significantly reducing manual workload and improving transparency.\n• CME Group (CME) announced plans to launch four South Asia edible oil futures contracts on March 2, 2026, pending regulatory review. The new products are cash-settled and include two outright contracts and two spread contracts that will be based on the Fastmarkets Soyoil CFR India and Crude Palm Oil CFR West Coast India assessments.\n• Mitek Systems (MITK) announced enhancements to its SEPBLAC-compliant digital onboarding capabilities for the Spanish market, designed to help regulated entities defend against a rapidly escalating wave of AI-driven identity fraud. The enhancements strengthen Mitek's unassisted video verification solution, used across Spain for SEPBLAC-compliant remote identity verification."},{"time":"04:59","ticker":"BUD","headline":"Anheuser-Busch InBev beats by $0.07, reports revs in-line","body":"• Reports Q4 (Dec) earnings of $0.95 per share, $0.07 better than the FactSet Consensus of $0.88; revenues rose 6.2% year/year to $15.55 bln vs the $15.59 bln FactSet Consensus.\n• 2026 OutlookOverall Performance: Co expects EBITDA to grow in line with our medium-term outlook of between 4-8%. The outlook for FY26 reflects current assessment of inflation and other macroeconomic conditions.Net Finance Costs: Net pension interest expenses and accretion expenses are expected to be in the range of $190 to 220 million per quarter, depending on currency and interest rate fluctuations. Co expects the average gross debt coupon in FY26 to be approximately 4%.Net Capital Expenditure: Co expects net capital expenditure of between $3.5 and 4.0 billion in FY26.\n• Overall Performance: Co expects EBITDA to grow in line with our medium-term outlook of between 4-8%. The outlook for FY26 reflects current assessment of inflation and other macroeconomic conditions.\n• Net Finance Costs: Net pension interest expenses and accretion expenses are expected to be in the range of $190 to 220 million per quarter, depending on currency and interest rate fluctuations. Co expects the average gross debt coupon in FY26 to be approximately 4%.\n• Net Capital Expenditure: Co expects net capital expenditure of between $3.5 and 4.0 billion in FY26."},{"time":"04:51","ticker":"WRD","headline":"WeRide and Uber (UBER) launch first downtown commercial robotaxi service in Abu Dhabi","body":"• WeRide (WRD) and Uber Technologies (UBER) began the first commercial robotaxi operations in downtown Abu Dhabi, expanding coverage to ~70% of the city's core areas.Service now operates across Khalifa City, Masdar City, Rabdan, and routes between Corniche Road and the Sheikh Zayed Grand Mosque, endorsed by the Integrated Transport Centre.Riders can access WeRide's Robotaxi GXR via UberX, Uber Comfort, or a dedicated \"Autonomous\" option; vehicles currently include an onboard safety specialist.Fleet has quadrupled since December 2024 launch, with over 200 robotaxis in the Middle East and a target to deploy at least 1,200 units across Abu Dhabi, Dubai, and Riyadh as soon as 2027.\n• Service now operates across Khalifa City, Masdar City, Rabdan, and routes between Corniche Road and the Sheikh Zayed Grand Mosque, endorsed by the Integrated Transport Centre.\n• Riders can access WeRide's Robotaxi GXR via UberX, Uber Comfort, or a dedicated \"Autonomous\" option; vehicles currently include an onboard safety specialist.\n• Fleet has quadrupled since December 2024 launch, with over 200 robotaxis in the Middle East and a target to deploy at least 1,200 units across Abu Dhabi, Dubai, and Riyadh as soon as 2027."},{"time":"04:46","ticker":"NRGV","headline":"Energy Vault upsizes and prices offering of $140.0 mln of 5.250% convertible senior notes due 2031","body":"• The offering was upsized from the previously announced offering size of $125.0 million aggregate principal amount of Notes."},{"time":"04:44","ticker":"NKTR","headline":"Nektar Therapeutics prices offering $400 mln offering consisting of common stock and warrants","body":"• Co priced an upsized $400 mln underwritten public offering of common stock and pre-funded warrants.Co is selling 6,603,449 shares at $58.00 per share and 293,103 pre-funded warrants at $57.9999, with a $0.0001 exercise price.Gross proceeds are expected to total approximately $400 mln before underwriting discounts and expenses.\n• Co is selling 6,603,449 shares at $58.00 per share and 293,103 pre-funded warrants at $57.9999, with a $0.0001 exercise price.\n• Gross proceeds are expected to total approximately $400 mln before underwriting discounts and expenses."},{"time":"04:42","ticker":"NTST","headline":"NETSTREIT prices 10.98 mln shares of common stock at $19.00 per share","body":""},{"time":"04:39","ticker":"AMAT","headline":"Applied Materials settles export probe with Commerce for $252.5 mln; DOJ, SEC close reviews","body":"• Applied Materials reached a civil settlement with the U.S. Department of Commerce's Bureau of Industry and Security, agreeing to pay $252.5 mln to resolve export regulation allegations tied to China shipments between Nov. 2020 and July 2022.The matter stemmed from a misunderstanding of the applicability of certain U.S. Export Administration Regulations.The U.S. Department of Justice and the Securities and Exchange Commission have closed related investigations without taking action.With the settlement, the U.S. government's review is concluded, removing a regulatory overhang as Applied focuses on semiconductor demand and its technology roadmap.\n• The matter stemmed from a misunderstanding of the applicability of certain U.S. Export Administration Regulations.\n• The U.S. Department of Justice and the Securities and Exchange Commission have closed related investigations without taking action.\n• With the settlement, the U.S. government's review is concluded, removing a regulatory overhang as Applied focuses on semiconductor demand and its technology roadmap."},{"time":"04:35","ticker":"NWE","headline":"NorthWestern misses by $0.02, reports revs in-line; guides FY26 EPS in-line; raises dividend","body":"• Reports Q4 (Dec) earnings of $1.17 per share, excluding non-recurring items, $0.02 worse than the FactSet Consensus of $1.19; revenues rose 10.9% year/year to $414.3 mln vs the $414.26 mln FactSet Consensus.\n• Co issues in-line guidance for FY26, sees EPS of $3.68-3.83, excluding non-recurring items, vs. $3.83 FactSet Consensus.Co is affirming long-term diluted earnings per share growth guidance of 4% to 6%, based on 2024 adjusted diluted non-GAAP EPS baseline of $3.40.\n• Co is affirming long-term diluted earnings per share growth guidance of 4% to 6%, based on 2024 adjusted diluted non-GAAP EPS baseline of $3.40.\n• Additionally, is announcing a $3.2 billion capital investment plan for 2026-2030, which is expected to support rate base growth of 4% to 6% from our 2024 base year of approximately $5.4 billion. Co anticipates funding capital expenditures through cash flows from operations, available credit sources, debt issuances, and future rate increases. In order to fund South Dakota generation investment, equity issuances are expected beginning in 2027.\n• Dividend DeclaredNorthWestern Energy Group's Board of Directors has declared a quarterly common stock dividend of $0.67 per share, representing a 1.5% increase over the previous quarter's dividend. The dividend is payable on March 31, 2026, to shareholders of record as of March 13, 2026.Looking ahead, co remains committed to maintaining a dividend payout ratio within our targeted range of 60-70% over the long term.\n• NorthWestern Energy Group's Board of Directors has declared a quarterly common stock dividend of $0.67 per share, representing a 1.5% increase over the previous quarter's dividend. The dividend is payable on March 31, 2026, to shareholders of record as of March 13, 2026.\n• Looking ahead, co remains committed to maintaining a dividend payout ratio within our targeted range of 60-70% over the long term."},{"time":"04:28","ticker":"APC","headline":"ARKO Petroleum Corp. (Nasdaq) prices 11,111,111 share IPO at $18.00 per share, at the low end of the $18-20 expected range","body":""},{"time":"04:26","ticker":"AXG","headline":"Solowin Holdings secures up to $100 mln financing to expand stablecoin and tokenization strategy","body":"• SOLOWIN HOLDINGS (AXG) entered a securities purchase agreement with Streeterville Capital for up to $100 mln via pre-paid purchase agreements tied to Class A ordinary shares.The initial tranche of ~$5.4 mln (before OID and expenses) has closed; additional tranches are subject to mutual consent.Proceeds are earmarked for expanding the company's stablecoin and asset tokenization businesses, advancing AI and blockchain security R&D, and supporting global expansion.Terms were disclosed in a Form 6-K and related 424B5 prospectus supplement filed February 9, 2026; structure implies potential future share issuance depending on drawdowns.\n• The initial tranche of ~$5.4 mln (before OID and expenses) has closed; additional tranches are subject to mutual consent.\n• Proceeds are earmarked for expanding the company's stablecoin and asset tokenization businesses, advancing AI and blockchain security R&D, and supporting global expansion.\n• Terms were disclosed in a Form 6-K and related 424B5 prospectus supplement filed February 9, 2026; structure implies potential future share issuance depending on drawdowns."},{"time":"04:22","ticker":"FRMI","headline":"Fermi America advances Hyundai E&amp;C partnership for four AP1000 units at Project Matador","body":"• Fermi Inc. deepened its partnership with Hyundai Engineering & Construction Co., Ltd. to advance FEED work for four AP1000 reactors at its 11GW Project Matador campus near Amarillo, Texas.The companies engaged U.S. contractors at Hyundai E&C's nuclear technology seminar in Dallas to strengthen supply chain and workforce readiness as part of a broader push to restart large-scale U.S. nuclear construction.FEED activities include site layout, cooling system evaluations, and cost/schedule development to support a potential EPC pathway.Management highlighted AI-driven load growth and said Project Matador is positioned as one of the few advanced U.S. nuclear projects with active NRC engagement and readiness to break ground.\n• The companies engaged U.S. contractors at Hyundai E&C's nuclear technology seminar in Dallas to strengthen supply chain and workforce readiness as part of a broader push to restart large-scale U.S. nuclear construction.\n• FEED activities include site layout, cooling system evaluations, and cost/schedule development to support a potential EPC pathway.\n• Management highlighted AI-driven load growth and said Project Matador is positioned as one of the few advanced U.S. nuclear projects with active NRC engagement and readiness to break ground."},{"time":"04:20","ticker":"ODV","headline":"Osisko Development provides infill drilling update on its 13,000-meter Lowhee Program at Cariboo Gold Project","body":"MONTREAL, Feb. 11, 2026 (GLOBE NEWSWIRE) -- OsiskoDevelopment Corp. (NYSE: ODV, TSXV: ODV) (\"Osisko Development\" or the \"Company\") is pleased to announce new infill drilling results from its ongoing 13,000-meter program on 10 meter drill spacing that commenced in August 2025 in the Lowhee Zone of the Company's permitted, 100%-owned Cariboo Gold Project (\"Cariboo\" or the \"Project\"), located in central British Columbia (\"B.C.\"), Canada. The six drill hole fans reported herein comprise an additional ~5,043 meters (\"m\") of underground infill drilling, bringing the total tally of drilling with full results to 11,025 m, or ~80% of the planned total.Click here for full release."},{"time":"04:13","ticker":"MESO","headline":"Mesoblast highlights Ryoncil survival data at ASTCT/CIBMTR; adult pivotal trial set to begin","body":"• Mesoblast Limited presented data showing Ryoncil (remestemcel-L-rknd) delivered similarly high survival in steroid-refractory acute GVHD across children and adults, second- or third-line use, and ruxolitinib-nave or resistant patients.\n• Ryoncil is the first FDA-approved mesenchymal stromal cell product and the only therapy approved for children under 12 with SR-aGvHD.\n• In EIND patients treated = third line (89% grade III/IV), 15% died before completing therapy vs. 2% in second-line Phase 3 (MSB-GVHD001), underscoring benefit of earlier use post-steroid resistance.\n• Adult EIND patients showed day-100 survival at least comparable to pediatric patients; company plans to initiate a pivotal adult second-line trial this quarter to pursue label expansion."},{"time":"04:11","ticker":"SNY","headline":"Sanofi names Beln Garijo CEO; Hudson to step down","body":"• Sanofi will not renew Paul Hudson's director mandate; his last day as CEO is Feb. 17, 2026.\n• Beln Garijo, currently CEO of Merck KGaA, appointed Chief Executive Officer effective after the April 29, 2026 AGM; Board will propose her as director.\n• Olivier Charmeil named Interim CEO during the transition.\n• Garijo to focus on strengthening R&D productivity, governance, and innovation capacity; previously held senior roles at Sanofi and serves on the board of BBVA; former board member of L'Oral."},{"time":"04:08","ticker":"HEINY","headline":"Heineken launches 375 mln second tranche of 750 mln buyback","body":"• Heineken Holding N.V. begins the second 375 mln tranche of its up to 750 mln two-year share buyback program.\n• Repurchases will mirror its pro rata participation in the Heineken N.V. buyback, selling HEIA shares and buying back HEIO shares daily at VWAP.\n• Program expected to complete by 29 Jan 2027, or earlier if fully utilized."}],"fetchedAt":1770894266484},"savedAt":1770894266484}