{"data":{"updated":"2/11/2026, 5:11:24 AM","entries":[{"time":"04:57","ticker":"WIRES","headline":"On The Wires","body":"• DXC Technology (DXC) announced the opening of its new Customer Experience Center in London. The center is designed to create an environment where DXC's experts can work directly with customers to help them move from experimenting with new technologies, including AI, to execution at scale. It will draw on the collective experience of 6,000 multidisciplinary DXC team members in the UK and Ireland including system architects, software engineers, industry specialists, and service delivery teams. Their collective expertise is reinforced by DXC's global network of 40,000 developers, enabling customers across the United Kingdom and Ireland to co-create solutions that deliver measurable, enterprise-scale business outcomes.\n• Vonage, part of Ericsson (ERIC), announced a strategic collaboration with C3 AI (AI) to launch C3 AI Field Services, a module of the C3 AI Asset Performance Suite of products, integrated with Vonage APIs. The AI-first module combines C3 AI's powerful Enterprise AI capabilities with Vonage's cutting-edge Communications APIs and Network APIs, to deliver superior performance, reliability and experiences for mobile enterprise field operations. This collaboration builds on a broader network-powered solutions offering from Vonage where application-aware networking, including advanced connectivity capabilities such as Quality on Demand, can be applied to support critical field workflows. Quality on Demand is the first advanced network API being showcased and represents one component of Vonage's larger vision for network intelligence that aligns network behavior with application intent.\n• Royal Philips (PHG) announced that the SEISMIC research consortium, coordinated by Philips, together with Erasmus MC as academic lead, has been awarded funding from the Innovative Health Initiative to transform neurosurgery through the seamless integration of minimally invasive surgical techniques and advanced imaging technologies. The EUR 23.5 million public funding will be complemented by EUR 14.9 million in in-kind contributions and additional resources from industry partners, supporting a five-year research and innovation program that also includes eight clinical studies.\n• Kanzhun Limited (BZ) announced the continued execution of its share repurchase program, utilizing over RMB40 million to repurchase 650,180 ordinary shares on February 9 and 10, 2026. In 2026, the Company has deployed nearly RMB260 million toward share repurchases. This move underscores the Company's ongoing commitment to shareholder returns. BOSS Zhipin maintains authorization under its existing program to repurchase up to USD250 million worth of its shares, with the program remaining active until the end of August 2026."},{"time":"04:54","ticker":"NTES","headline":"NetEase misses by RMB3.22, misses on revs","body":"• Reports Q4 (Dec) earnings of RMB 10.95 per share, RMB 3.22 worse than the FactSet Consensus of RMB 14.17; revenues rose 3.0% year/year to RMB 27.55 bln vs the RMB 28.72 bln FactSet Consensus."},{"time":"04:45","ticker":"RZLV","headline":"Rezolve AI to acquire Reward for $230 mln in all-cash deal","body":"• Rezolve Ai PLC agreed to acquire Reward for $230 mln in cash to combine conversational commerce with commerce media capabilities.Co will integrate Reward's first-party transaction data and bank distribution with its AI commerce and payments platform to enable closed-loop measurement from discovery through conversion.Reward brings established relationships with global banks and retailers across the UK, Europe, Middle East and Asia, supporting multinational deployment.Combined platform is positioned to expand in the Americas leveraging Rezolve Ai's existing market presence.\n• Co will integrate Reward's first-party transaction data and bank distribution with its AI commerce and payments platform to enable closed-loop measurement from discovery through conversion.\n• Reward brings established relationships with global banks and retailers across the UK, Europe, Middle East and Asia, supporting multinational deployment.\n• Combined platform is positioned to expand in the Americas leveraging Rezolve Ai's existing market presence."},{"time":"04:44","ticker":"WIRES","headline":"On The Wires","body":"• Intercontinental Exchange, Inc. (ICE) announced the launch of Cryptocurrency futures contracts based on seven CoinDesk Indices including CoinDesk 20 and CoinDesk 5 Indices. The CoinDesk indexed contracts are U.S. dollar denominated and cash-settled. Over $40 billion in assets under management are tied to CoinDesk Indices tracking the price of cryptocurrencies including Bitcoin, Ether and Solana.\n• 8x8, Inc. (EGHT) launched 8x8 Silent Mobile Authentication in the Philippines in partnership with PLDT Enterprise, the corporate business arm of PLDT. Recently, PLDT Enterprise introduced SmartSafe SilentAccess, its flagship solution from the SmartSafe API suite that enables fast, secure mobile user verification by validating users through mobile network and SIM-based signals.\n• AST SpaceMobile, Inc. (ASTS) announced the successful unfolding of its next-generation BlueBird 6 satellite. BlueBird 6 features the largest commercial communications array antenna ever deployed in Low Earth Orbit. Spanning approximately 2,400 square feet, the satellite is engineered to support peak data speeds of up to 120 Mbps with plans to deliver up to ten times the bandwidth capacity of the BlueBird 1-5 series. The aperture enables full 4G and 5G cellular broadband services, including voice, data, and video to standard, unmodified smartphones everywhere. The company is on track to launch 45--60 satellites by the end of 2026, with launches planned every one or two months on average.\n• Franklin Templeton, a unit of Franklin Resources (BEN), and Binance, the world's leading cryptocurrency exchange by trading volume and users, announced a new institutional off-exchange collateral program, making digital markets more secure and capital-efficient. Now live, eligible clients can use tokenized money market fund shares issued through Franklin Templeton's Benji Technology Platform as off-exchange collateral when trading on Binance."},{"time":"04:42","ticker":"GTLB","headline":"GitLab transcend showcases how intelligent orchestration helps accelerate innovation velocity across the software lifecycle","body":"All Remote - GitLab Inc., the intelligent orchestration platform for DevSecOps, today hosted GitLab Transcend, an exclusive virtual event for technology leaders highlighting the true potential of agentic AI for software delivery.Click here for full release."},{"time":"04:39","ticker":"FRMI","headline":"Fermi America secures $500 mln MUFG financing to fund gas turbine purchases","body":"• Fermi Inc. secured a $500 mln non-recourse turbine warehouse facility from MUFG Bank to fund acquisition of three Siemens Energy SGT6-5000F gas turbines.Proceeds will also repay an existing loan and support delivery, construction and deployment of additional turbines as the platform scales.Facility is structured as a repeatable financing vehicle to support future gigawatt-scale equipment purchases ahead of project-level financing.Turbine deliveries are expected to begin in 1H 2026, supporting over 2 GW of controlled generation capacity toward an initial 2.3 GW buildout.\n• Proceeds will also repay an existing loan and support delivery, construction and deployment of additional turbines as the platform scales.\n• Facility is structured as a repeatable financing vehicle to support future gigawatt-scale equipment purchases ahead of project-level financing.\n• Turbine deliveries are expected to begin in 1H 2026, supporting over 2 GW of controlled generation capacity toward an initial 2.3 GW buildout."},{"time":"04:35","ticker":"FLNG","headline":"FLEX LNG reports in-line results; beats on revs","body":"• Reports Q4 EPS of $0.43 vs $0.43 FactSet consensus; revs of $87.5 mln vs $84.4 mlnAverage Time Charter Equivalent rate of $70,119 per day for the fourth quarter 2025, compared to $70,921 per day for the third quarter 2025.The Company declared a dividend for the fourth quarter 2025 of $0.75 per share. The dividend is payable on or about March 12, 2026 to shareholders, on record as of February 27, 2026.\n• Average Time Charter Equivalent rate of $70,119 per day for the fourth quarter 2025, compared to $70,921 per day for the third quarter 2025.\n• The Company declared a dividend for the fourth quarter 2025 of $0.75 per share. The dividend is payable on or about March 12, 2026 to shareholders, on record as of February 27, 2026."},{"time":"04:22","ticker":"GLTO","headline":"Galecto prices offering of 14,473,685 shares of common stock at $19.00 per share","body":""},{"time":"04:21","ticker":"CURB","headline":"Curbline Properties prices offering of 8.0 mln shares of common stock for gross proceeds of ~$204 mln","body":""},{"time":"04:07","ticker":"MWH","headline":"SOLV Energy (Nasdaq) prices 20.5 mln share IPO at $25.00 per share, at the high end of the $22-25 expected range","body":""}],"fetchedAt":1770804684001},"savedAt":1770804684001}