{"data":{"updated":"2/18/2026, 2:33:15 PM","entries":[{"time":"09:32","ticker":"UNIT","headline":"Uniti Wholesale accelerates 2026 expansion; fastWaves&nbsp;delivers 100G/400G in days, not months","body":"LITTLE ROCK, Ark., Feb. 18, 2026 (GLOBE NEWSWIRE) -- Uniti Wholesale today announced accelerated progress on its 2026 expansion plan, including new data center on-ramps, key route upgrades, and the launch of FastWaves-a pre-deployed optical capacity program designed to cut delivery intervals for 100G and 400G wavelength services to less than three weeks on select routes.Click here for full release."},{"time":"09:29","ticker":"PRE","headline":"Prenetics Group Ltd. completes the sale of its 35% equity interest in Insighta to Tencent (TCHEHY) for total cash consideration of $70 million","body":"• Final milestone in strategic transformation positions company to accelerate IM8 global expansion with zero Debt.\n• Q4 and full-year 2025 financial results to be announced on February 18, 2026."},{"time":"09:23","ticker":"CDE","headline":"Coeur Mining shares higher by 3% after it reported its 2025 year-end mineral reserves and resources","body":"• Year-end 2025 proven and probable mineral reserves increased to 4.4 million ounces of gold and 274.4 million ounces of silver, highlighted by a 65% year-over-year increase in gold reserves at Wharf, a 36% year-over-year increase in Palmarejo's gold reserves, and a 9% year-over-year increase in Kensington's gold reserves.\n• Measured and indicated mineral resources totaled 3.1 million ounces of gold, 172.0 million ounces of silver, 1,234 million pounds of zinc and 685.5 million pounds of lead. Gold and silver measured and indicated mineral resources decreased 18% and 14% year-over-year, respectively, partially offset by increases at Rochester and Wharf.\n• Inferred mineral resources increased year-over-year to 3.8 million ounces of gold, 141.8 million ounces of silver, 272.6 million pounds of zinc and 134.7 million pounds of lead. Growth was driven by a 216% increase at Wharf to 1.5 million ounces of gold and strong additions at Palmarejo, where inferred gold resources increased 97% to 1.3 million ounces and inferred silver resources increased 74% to 60.0 million ounces."},{"time":"09:21","ticker":"GRRR","headline":"Gorilla Technology Group proposes acquisition of Shackleton Finance","body":"• Completion of the acquisition is conditional upon approval by the UK Financial Conduct Authority (\"FCA\") under the change in control regime. Approval is not assured and the timing remains subject to this process. Subject to FCA approval, the parties intend to execute a detailed sale and purchase agreement.\n• This announcement does not constitute an offer to invest in any fund or investment product and any future funds will be established and marketed in accordance with applicable regulatory requirements."},{"time":"09:18","ticker":"WRAPX","headline":"S&amp;P futures vs fair value: +20.00. Nasdaq futures vs fair value: +78.00.","body":"The stock market is on track for a higher opening following a hefty slate of economic data this morning. Total housing starts increased 6.2% month-over-month in December to a seasonally adjusted annual rate of 1.404 million units (Briefing.com consensus: 1320K), with single-unit starts up 4.1%. Building permits increased 4.3% to a seasonally adjusted annual rate of 1.448 million (Briefing.com consensus: 1412K), with single-unit permits down 1.7%.The key takeaway from the report is that it is not the answer for a supply-constrained housing market. Single-unit permits were down overall, but they fell the sharpest in the South (-5.3%), which is the nation's largest homebuilding region.Durable goods orders declined 1.4% month-over-month in December (Briefing.com consensus: -2.6%), paced by a 5.3% decline in transportation equipment orders. Excluding transportation, durable goods orders rose 0.9% month-over-month (Briefing.com consensus: 0.3%) following a 0.4% increase in November.The key takeaway from the report is that the weakness was concentrated in the transportation component. Otherwise, it was a solid report featuring a 0.6% increase in nondefense capital goods orders, excluding aircraft, which is a key gauge of business spending. Just released, industrial production increased 0.7% month-over-month in January (Briefing.com consensus 0.4%) following a downwardly revised 0.2% increase (from 0.4%) in December. The capacity utilization rate was 76.2% (Briefing.com consensus 76.5%) versus a downwardly revised 75.7% (from 76.3%) in December."},{"time":"09:18","ticker":"AHL","headline":"Aspen Insurance: Sompo Holdings has received the necessary antitrust and insurance regulatory approvals required to complete its previously announced acquisition of 100% of the issued Class A ordinary shares of Aspen Insurance Holdings Limited through a wholly owned subsidiary of Sompo International Holdings Ltd.","body":"• The transaction is expected to close in the next several days, subject to the satisfaction of customary closing conditions.\n• Aspen brings to Sompo a well-established insurance and reinsurance franchise with a strong underwriting culture. Further, Aspen's top-tier Lloyd's syndicate provides Sompo additional access to support complex risks and reinsurance licensing across untapped markets worldwide.\n• Following closing, Sompo will begin the process of integrating Aspen's capabilities to ensure a globally diversified Property & Casualty platform."},{"time":"09:15","ticker":"ECONX","headline":"January Capacity Utilization 76.2% vs. 76.5% Briefing.com consensus; prior revised to 75.7% from 76.3%","body":""},{"time":"09:15","ticker":"ECONX","headline":"January Industrial Production 0.7% vs. 0.4% Briefing.com consensus; prior revised to 0.2% from 0.4%","body":""},{"time":"09:13","ticker":"PSN","headline":"Parsons Sealing Technologies received an Intent to Award notification from the United States Cyber Command for a sole-source contract to begin production on the company's Joint Cyber Hunt Kit solution","body":"The three-year period of performance contract is new work for the company with an anticipated ceiling value of up to $500 million."},{"time":"09:12","ticker":"WIRES","headline":"On The Wires","body":"• Sprout Social (SPT) announced new AI-driven innovations and an expanded partnership to help brands reach people in the Answer Engine era. These updates empower organizations to create and scale the type of authentic content that consumers and AI answer engines value most. This release features an expanded Reddit partnership, a new AI-powered creator management tool called Recruit, and the Trellis Monitoring Agent for NewsWhip.\n• Synchrony (SYF) announced an expanded strategic partnership with Planet DDS that helps orthodontic and dental practices simplify patient financing and makes it easier for patients to move forward with care."},{"time":"09:10","ticker":"BLZE","headline":"Backblaze announces the launch of Backblaze Flamethrower, a new startup program designed to help early-stage companies build, scale, and reach product-market fit without being slowed down by unpredictable infrastructure costs or complexity","body":""},{"time":"09:10","ticker":"TRV","headline":"Travelers launches AI Claim Assistant, a solution developed using OpenAI model capabilities and APIs","body":""},{"time":"09:10","ticker":"NVO","headline":"Novo Nordisk A/S: Goodpath announces direct-to-employer and self-pay access to Wegovy, including both injectable and newly-approved oral formulations, through a collaboration with Novo Nordisk","body":"• New DTE and self-pay employer pathways support flexible program design and transparent GLP-1 costs, with clinically-led prescribing and care plans.\n• Goodpath's whole-person weight care approach treats the comorbidities that drive total cost of care.\n• Goodpath supports both oral and injectable Wegovy options, enabling clinicians to tailor treatment to individual patient needs."},{"time":"09:09","ticker":"WIRES","headline":"On The Wires","body":"• 8x8 (EGHT) launches platform-wide upgrades to simplify CX, cutting handle times and streamlining workforce management.\n• Rimini Street (RMNI) announces that Cubic Corporation has partnered with Rimini Street to support its strategy to modernize while maintaining SAP ECC as a stable core and to explore AI and automation initiatives across its broader application landscape."},{"time":"09:08","ticker":"DD","headline":"DuPont selected by United Utilities to supply MemCor membrane bioreactor systems for wastewater treatment plant expansions at three facilities","body":"• United Utilities has selected DuPont Water Solutions to supply MemCor membrane bioreactor (MBR) systems for wastewater treatment plant expansions at three facilities. The advanced membrane system will help United Utilities expand wastewater treatment capacity, meet stricter discharge requirements and produce high-quality treated effluent."},{"time":"09:08","ticker":"KDP","headline":"Keurig Dr Pepper announces flavorful new innovation across its refreshment portfolio","body":"BURLINGTON, Mass. and FRISCO, Texas, Feb. 18, 2026 /PRNewswire/ -- Keurig Dr Pepper (NASDAQ: KDP) is entering 2026 with an unrivaled commitment to flavor leadership, debuting innovations across its carbonated soft drinks (CSDs), teas, waters, energy and juice drinks portfolios. Building on the success of 2025's hits-like Dr Pepper Blackberry, last year's top CSD innovation1-the lineup of more than 35 new varieties across owned and partner brands delivers what consumers want most: bold new flavors, twists on nostalgic favorites, more zero sugar options and expanded energy offerings.Click here for full release."},{"time":"09:06","ticker":"PCT","headline":"PureCycle Technologies and TOPPAN announce a partnership to advance sustainability in flexible films and thermoformed packaging applications","body":"• The collaboration addresses growing brand owner demand for high-quality recycled content to meet emerging regulatory requirements worldwide.Through this partnership, PureCycle and TOPPAN have successfully developed and produced a snack bar wrapper containing more than 30% recycled content, demonstrating the performance capabilities of PureCycle's PureFive resin in demanding flexible packaging applications.\n• The wrapper showcases the printability and functionality needed by the world's leading snack brands while significantly reducing environmental impact."},{"time":"09:06","ticker":"ROP","headline":"Roper: iPipeline launches AI-first digital platform for life, annuities and wealth, debuting with iGO Evolve","body":"• Co announces the launch of its AI-first digital platform for life, annuities, and wealth, designed to help carriers and their distribution partners bring products to market faster and deliver smarter, more personalized experiences.\n• The new iPipeline platform is built with intelligence embedded at its core, combining an open, integration ready architecture with configurable workflows and low-code tools that reduce reliance on custom development.\n• iPipeline operates as a business unit of Roper Technologies (ROP)."},{"time":"09:06","ticker":"GENI","headline":"Genius Sports issues letter from CEO","body":"When we entered official data rights agreements, the economics were questioned. When we signed our long-term partnership with the NFL, many doubted the scale and sustainability of the opportunity. When we acquired Second Spectrum, there were similar concerns about commercial application. In each case, our thesis was rooted in structural change rather than short-term convention. Over time, execution clarified what the strategy already anticipated.Click here for full release."},{"time":"09:05","ticker":"JPM","headline":"JPMorgan Chase announces plans to open more than 160 new branches in over 30 states and renovate nearly 600 locations this year as part of a multibillion-dollar investment to expand access to affordable and convenient financial services nationwide","body":"• Expansion part of multibillion, multiyear investment to grow and modernize branch network.\n• Plans call for renovating nearly 600 locations nationwide."},{"time":"09:05","ticker":"IBRX","headline":"ImmunityBio Receives authorization from the European Commission for ANKTIVA with BCG for non-muscle invasive bladder cancer carcinoma in Situ, expanding global access to 33 countries","body":"• ANKTIVA plus BCG, with a 71% complete response rate, is the first immunotherapy to receive marketing authorization in Europe for non-muscle invasive bladder cancer (NMIBC) with carcinoma in situ (CIS), with or without papillary tumors, where no treatment was previously authorized for BCG-unresponsive disease\n• European Commission conditional marketing authorization enables commercial availability across all 27 European Union (EU) member states plus Iceland, Norway, and Liechtenstein, bringing the total number of countries where ANKTIVA is authorized to 33\n• ANKTIVA is now authorized across four regulatory jurisdictions: the United States (FDA, April 2024), United Kingdom (MHRA, July 2025), Kingdom of Saudi Arabia (SFDA, January 2026), and the European Union (EC, February 2026)\n• More than 150,000 patients are diagnosed annually with NMIBC across Europe; the European Commission's decision addresses an unmet medical need where the primary alternative for BCG-unresponsive patients has been radical cystectomy\n• Global regulatory footprint of 33 countries built in under two years from initial FDA approval"},{"time":"09:04","ticker":"RUM","headline":"Rumble and Tether announce the addition of USA, Tether's U.S. dollar-backed stablecoin, to Rumble Wallet","body":"• Co and Tether announce the addition of USA?, Tether's U.S. dollar-backed stablecoin, to Rumble Wallet, the non-custodial crypto wallet integrated directly into the Rumble platform.\n• Rumble Wallet already had supported Tether (USD?), Tether Gold (XAU?), and Bitcoin (BTC), enabling audiences to tip creators natively in crypto."},{"time":"09:02","ticker":"GSIT","headline":"GSI Technology: Galloway Capital Partners announces a 5.02% stake in GSI Technology, Inc.","body":""},{"time":"09:02","ticker":"WRAPX","headline":"S&amp;P futures vs fair value: +13.00. Nasdaq futures vs fair value: +46.00.","body":"• In economic data: Japan's January trade surplus JPY460 bln (expected deficit of JPY180 bln; last deficit of JPY60 bln). January Imports -2.5% yr/yr (expected 3.0%; last 5.2%) and Exports 16.8% yr/yr (expected 12.0%; last 5.1%) Australia's January MI Leading Index -0.1% m/m (last 0.1%). Q4 Wage Price Index 0.8% qtr/qtr, as expected (last 0.8%); 3.4% yr/yr (last 3.3%) New Zealand's Q4 Input PPI -0.5% qtr/qtr (expected 0.4%; last 0.2%); 0.1% qtr/qtr (expected 0.6%; last 0.6%)\n• Japan's January trade surplus JPY460 bln (expected deficit of JPY180 bln; last deficit of JPY60 bln). January Imports -2.5% yr/yr (expected 3.0%; last 5.2%) and Exports 16.8% yr/yr (expected 12.0%; last 5.1%)\n• Australia's January MI Leading Index -0.1% m/m (last 0.1%). Q4 Wage Price Index 0.8% qtr/qtr, as expected (last 0.8%); 3.4% yr/yr (last 3.3%)\n• New Zealand's Q4 Input PPI -0.5% qtr/qtr (expected 0.4%; last 0.2%); 0.1% qtr/qtr (expected 0.6%; last 0.6%)\n• Japan's Nikkei: +1.0%\n• Hong Kong's Hang Seng: CLOSED\n• China's Shanghai Composite: CLOSED\n• India's Sensex: +0.3%\n• South Korea's Kospi: CLOSED\n• Australia's ASX All Ordinaries: +0.6%\n• In economic data: U.K.'s January CPI -0.5% m/m, as expected (last 0.4%); 3.0% yr/yr, as expected (last 3.4%). January Core CPI -0.6% m/m (expected -0.7%; last 0.3%); 3.1% yr/yr (expected 3.0%; last 3.2%). January Input PPI 0.4% m/m, as expected (last -0.5%) and Output PPI 0.0% m/m (expected 0.2%; last -0.1%). January House Price Index 2.4% yr/yr (expected 1.8%; last 2.5%) France's January CPI -0.3% m/m, as expected (last 0.1%); 0.3% yr/yr, as expected (last 0.8%)\n• U.K.'s January CPI -0.5% m/m, as expected (last 0.4%); 3.0% yr/yr, as expected (last 3.4%). January Core CPI -0.6% m/m (expected -0.7%; last 0.3%); 3.1% yr/yr (expected 3.0%; last 3.2%). January Input PPI 0.4% m/m, as expected (last -0.5%) and Output PPI 0.0% m/m (expected 0.2%; last -0.1%). January House Price Index 2.4% yr/yr (expected 1.8%; last 2.5%)\n• France's January CPI -0.3% m/m, as expected (last 0.1%); 0.3% yr/yr, as expected (last 0.8%)\n• STOXX Europe 600: +0.8%\n• Germany's DAX: +0.7%\n• U.K.'s FTSE 100: +1.1%\n• France's CAC 40: +0.3%\n• Italy's FTSE MIB: +1.1%\n• Spain's IBEX 35: +1.0%"},{"time":"09:00","ticker":"HCAT","headline":"Health Catalyst appoints Ben Albert as Chief Executive Officer, effective February 12","body":"• In connection with the appointment, Health Catalyst accelerated the timing of its previously announced succession plan for Dan Burton, who has stepped down as CEO and as a member of the Board. As Mr. Burton retires from his position as CEO, Health Catalyst expects that he will continue to serve as an employee with the title of strategic advisor.\n• Health Catalyst also expects to enter into a transition agreement with Mr. Burton. Health Catalyst today also announced actions to reduce the size of the Board. Dawn Smith and Duncan Gallagher stepped down from the Board, effective February 17, 2026, and John Kane will step down on April 1, 2026.\n• These changes are in addition to the planned departure of Matt Kolb, who previously notified the Company that he will not seek reelection as a director at the 2026 Annual Meeting of Shareholders and will complete his board service immediately prior to the 2026 Annual Meeting. As a result of these changes, the size of the Board has been reduced at the effective time of each of the departures and will ultimately be set at five directors immediately prior to the 2026 Annual Meeting."},{"time":"09:00","ticker":"VOYA","headline":"Voya Financial announces that the suite of MyCompass Investment Solutions offered on its recordkeeping platform has reached $10 bln in assets under management","body":"Launched in the fall of 2019 by Great Gray Trust Company (Great Gray) as trustee, the suite of MyCompass target date funds is available to many of Voya's Retirement clients. Created to address the unique retirement needs of individual plan participants, MyCompass achieved $2 billion in AUM approximately two years after launch demonstrating the demand for target date products."},{"time":"08:38","ticker":"WIRES","headline":"On The Wires","body":"• Ameresco (AMRC) announces that is has partnered with the Bradford Exempted Village School District in Bradford, Ohio on a rooftop photovoltaic solar installation project for the district's academic school building, delivering on-site renewable power to support the school while advancing long-term sustainability for the rural Ohio community.\n• Lakeland Industries (LAKE) announces that its California PPE Recon, subsidiary, which specializes in personal protective equipment (PPE) care and maintenance services, has been selected to provide turnout gear maintenance and decontamination cleaning services for the City of Newport Beach Fire Department.\n• Alpha Cognition Inc. (ACOG) announces that the United States Patent and Trademark Office has issued U.S. Patent Application No. 12,551,491, entitled \"Dosage Regimens for Benzgalantamine.\""},{"time":"08:37","ticker":"VUZI","headline":"Vuzix launches All-in-One enterprise solutions kits featuring native Microsoft Teams (MSFT) and Zoom (ZM) for hands-free remote assistance","body":"New turnkey deployment model simplifies smart glasses adoption for frontline teams."},{"time":"08:37","ticker":"WIRES","headline":"On The Wires","body":"• Kratos Defense & Security Solutions (KTOS) announced that it has been awarded a contract through the Department of War's Joint Hypersonics Transition Office to support test and evaluation of thermal protection systems for hypersonic vehicles. For this program, Kratos will leverage decades of expertise in hypersonics to analyze various missions and flight environments to understand appropriate testing conditions. Kratos will establish standard test conditions and techniques to accelerate materials development and can be used as a baseline for other similar aerothermal test facilities.\n• Hammurabi, a division of accident and health managing general underwriter Xchange Benefits LLC, a subsidiary of Octave Specialty Grou (OSG) unveiled an artificial intelligence platform that fundamentally transforms how medical stop loss insurance is underwritten, replacing a traditionally labor-intensive process with near-instant risk prediction and pricing accuracy. Designed to deliver efficiencies in the $40 billion medical stop loss market, Hammurabi's proprietary neuro-semiotic models apply advanced machine learning to predict employer health risk with speed and precision. The result is a dramatic reduction in standard market underwriting timelines-from days to minutes-while delivering accurate pricing and actionable insights for both employers and producers."},{"time":"08:37","ticker":"TARS","headline":"Tarsus Pharmaceuticals appoints former Allergan CEO, David Pyott, to its Board of Directors","body":"• Co announces the appointment of David E. I. Pyott, a distinguished leader in the global biopharmaceutical industry and former Chairman and CEO of Allergan, Inc., to its Board of Directors.\n• Mr. Pyott brings decades of global leadership experience spanning innovative R&D, product development, and commercial execution. During his 17-year tenure as CEO of Allergan, he transformed the company from a focused eye care business with approximately $1 billion in sales into a global specialty pharmaceutical and medical device leader generating more than $7 billion in revenue."},{"time":"08:36","ticker":"WRAPX","headline":"S&amp;P futures vs fair value: +30.00. Nasdaq futures vs fair value: +130.00.","body":"The S&P 500 futures currently trade 30 points above fair value. Housing starts in December increased 6.2% month-over-month to a seasonally adjusted annual rate of 1.404 million (Briefing.com consensus: 1.320 million). Building permits increased 4.3% to a seasonally adjusted annual rate of 1.448 million (Briefing.com consensus: 1.412 million). Durable goods orders decreased 1.4% month-over-month in December (Briefing.com consensus: -2.6%) following an upwardly revised 5.4% increase (from 5.3%) for November. Excluding transportation, durable goods orders rose 0.9% month-over-month (Briefing.com consensus: 0.3%) following a downwardly revised 0.4% increase (from 0.5%) for November."},{"time":"08:36","ticker":"GDC","headline":"GD Culture Group Limited announces up to $100 million share repurchase program","body":"• Co announced that its board of directors has authorized a share repurchase program under which the Company may repurchase up to US$100 million worth of its shares within the next 6 months ending on August 17, 2026, subject to market conditions.\n• Under the share repurchase program, the Company may periodically repurchase its common stock through open market or privately negotiated transactions thereof in compliance with applicable securities laws and the Company's insider trading policy. The number of common stocks to be repurchased and the timing of repurchases will be determined by management at its discretion and will depend on a number of factors, including, but not limited to, bitcoin price based on the CME CF Bitcoin Reference Rate - New York Variant, price, trading volume and general market conditions of the shares, along with the Company's working capital requirements and general business conditions and applicable legal requirements. The Company's board of directors will review the share repurchase program periodically, and may authorize adjustments to its terms and/or size."},{"time":"08:36","ticker":"LAES","headline":"SEALSQ Corp announces its collaboration with Lattice Semiconductor (LSCC) to integrate TPM-based advanced post-quantum security capabilities into select Lattice FPGA solutions","body":"This collaboration addresses the rapidly growing need for quantum-resistant technologies in mission-critical applications for edge computing and other high-stakes environments."},{"time":"08:34","ticker":"YDDL","headline":"One and one Green Technologies expands into the European market with E-waste agreement in Spain","body":"• Co announces its first supply agreement in Europe, expanding beyond the Asia-Pacific markets.\n• Co has entered into a supply agreement with Recuperaciones Hermanos Huang S.L., a Madrid-based electronic waste recovery specialist, to source high-quality e-waste from Spain.\n• This supply agreement establishes One and One's first European procurement channel with an initial shipment of 22 metric tons to be delievered to Manila North Port. This agreement establishes a new supply channel for One and One to participate in Europe's e-waste recycling market."},{"time":"08:33","ticker":"KULR","headline":"KULR Technology and Hylio announce strategic collaboration to produce texas-manufactured battery systems for U.S.-built unmanned agricultural drones","body":"• The collaboration aims to design, prototype, qualify, and domestically manufacture NDAA-compliant (National Defense Authorization Act) battery systems in Texas for integration into Hylio's unmanned aerial systems platforms. The companies intend to focus on high-performance, mission-critical battery architectures tailored to Hylio's agricultural and defense-adjacent applications, with an emphasis on secure, U.S.-based supply chains.\n• Under the collaboration, KULR expects that the engineering, integration, and manufacturing activities will be centered in Texas.\n• The jointly developed products are expected to support customers requiring trusted, certifiable energy storage solutions for government, defense, and critical-infrastructure use cases, while also enhancing performance and reliability across commercial agricultural operations."},{"time":"08:33","ticker":"TEM","headline":"Tempus AI announces the launch of its new HRD-RNA algorithm","body":"• This next-generation model represents a significant improvement in identifying Homologous Recombination Deficiency, providing a more robust, functional assessment of tumor biology compared to traditional static DNA-based assays.\n• Tempus HRD-RNA is an AI-driven, 1,660-gene logistic regression model designed to identify patients likely to respond to platinum-based chemotherapy or PARP inhibitors. Unlike traditional DNA tests that analyze static \"genomic scars\"-which may persist even after a patient develops drug resistance-this RNA-based approach provides a dynamic, real-time assessment of a tumor's functional status."},{"time":"08:33","ticker":"C","headline":"Citigroup announces sale of its Russian business to Renaissance Capital","body":"• Co announced it has signed and closed the sale of AO Citibank, Citi's former Russian subsidiary, to Renaissance Capital (RenCap). The transaction resulted in Citi's full exit from its operations in Russia and included all remaining businesses, as well as approximately 800 employees.Citi announced its intent to exit its consumer business in the country in April 2021 and in March 2022 expanded the scope of that exit process to include other lines of business. The transaction has received all necessary regulatory approvals.\n• Citi's Head of International Ernesto Torres Cant said, \"We've now completed the final steps in Citi's exit from Russia, a process that began in March 2022. We greatly appreciate the professionalism and hard work of our colleagues throughout this process.\"\n• The divestiture of the remaining business operations is expected to provide an estimated benefit to Citi's Common Equity Tier 1 capital in the first quarter of 2026 of approximately $4 billion, primarily driven by the deconsolidation of associated risk-weighted assets, a reduction in disallowed deferred tax assets and the release of associated currency translation adjustment (CTA) loss. While a benefit in the first quarter of 2026, the cumulative impact of the $1.6 billion CTA loss is regulatory capital neutral to Citi."},{"time":"08:32","ticker":"ECONX","headline":"December Building Permits 1.448 mln vs. 1.412 mln Briefing.com consensus; prior 1.388 mln","body":""},{"time":"08:31","ticker":"ECONX","headline":"December Housing Starts 1.404 mln vs. 1.32 mln Briefing.com consensus; prior 1.322 mln","body":""},{"time":"08:30","ticker":"ECONX","headline":"December Durable Orders -ex transportation 0.9% vs. 0.3% Briefing.com consensus; prior revised to 0.4% from 0.5%","body":""},{"time":"08:30","ticker":"ECONX","headline":"December Durable Orders -1.4% vs. -2.6% Briefing.com consensus; prior revised to 5.4% from 5.3%","body":""},{"time":"08:22","ticker":"PGR","headline":"Progressive reports January 2026 EPS of $1.98 vs. $1.90 last year; Net premiums written +4% yr/yr to $6.735 bln","body":""},{"time":"08:17","ticker":"PLTR","headline":"Palantir Technologies and Rackspace Technology (RXT) announce a strategic partnership to help enterprises rapidly deploy and operate Palantir's Foundry and Artificial Intelligence Platform in production to achieve measurable business outcomes","body":"• Through this partnership, Rackspace's governed operating model will provide consistent security, operating controls and compliance from edge to core to cloud enabling customers to deploy AI use cases with Palantir in production in weeks or months versus months or years.\n• The companies are also collaborating to run Palantir software in Rackspace's Private Cloud and UK Sovereign data centers.\n• This is especially critical for regulated industries where AI deployments must meet strict data sovereignty and compliance requirements."},{"time":"08:16","ticker":"SSYS","headline":"Stratasys announces the launch of its new dental anatomical model preset, a 3D-printed solution for simulation-based training that is designed to help dental schools, training centers, and medical device manufacturers deliver more realistic and consistent hands-on education","body":"The cost-effective solution makes training more accessible by minimizing complexity and eliminating the ethical challenges of traditional training methods."},{"time":"08:15","ticker":"NVRI","headline":"Enviri Corporation: Harsco Environmental secures new 10-year contract with Lloyds Metals and Energy Limited","body":"• Harsco Environmental, a division of Enviri Corporation (NVRI) and a global leader in providing innovative environmental solutions, announced it has signed a 10-year contract with Lloyds Metals and Energy Limited, a major steel and mining company in India.\n• Under the agreement, Harsco Environmental will provide the design, build, commission, operation, and maintenance of the metal recovery plant along with all associated slag processing at LMEL's integrated steel plant in Maharashtra, India. The agreement is expected to create 54 new jobs in the region and will begin in 2027."},{"time":"08:14","ticker":"DNA","headline":"Ginkgo Bioworks and Invaio Sciences enter collaboration to develop manufacturing technology for peptide-based agricultural products","body":"• Collaboration aims to develop a commercialization-ready microorganism to manufacture next-generation peptide crop solutions at grower-friendly costs.\n• As a part of the commercialization of its peptide-based products, Invaio will leverage Ginkgo's platform and best-in-class microbial strains for protein production. Ginkgo's strains have been engineered to provide advanced starting points for protein and peptide-based products through industrial-scale fermentation. In this collaboration, Ginkgo will further optimize its strains and fermentation processes to deliver on Invaio's production goals."},{"time":"08:12","ticker":"GSK","headline":"GlaxoSmithKline's AREXVY associated with reductions in certain RSV-related risks including heart attack, stroke and severe flare-ups of COPD and Asthma","body":"GSK's AREXVY Associated With Reductions in Certain RSV-Related Risks Including Heart Attack, Stroke and Severe Flare-Ups of COPD and Asthma, Real World Study ShowsClick here for full release."},{"time":"08:11","ticker":"WIRES","headline":"On The Wires","body":"• The Kraft Heinz Company (KHC) announces the appointment of Nicolas Amaya (\"Nico\") as President, North America, effective February 23, 2026. Pedro Navio, current President, North America, will step down on February 22 to pursue other opportunities.\n• Sezzle Inc. (SEZL) announce the launch of Sezzle Mobile, an unlimited mobile phone plan starting at $29.99 per month, designed for users who increasingly rely on Sezzle as a single destination for managing their everyday spending."},{"time":"08:09","ticker":"VLN","headline":"Valens Semiconductor and MCNEX announce the joint development and availability of a new family of high-resolution front and rear automotive cameras that deliver QHD video over unshielded twisted pair (UTP) or low-cost Coax channels, powered by Valens' VA7000 A-PHY chipsets","body":"The cameras enable OEMs to significantly reduce the cost and complexity of their wiring harness while retaining high image quality for ADAS and autonomous applications."},{"time":"08:09","ticker":"VHUB","headline":"VenHub Global announces its latest innovation that marks a significant advancement in automated retail operations","body":"The new VenHub Vision System is a vision-based system that automates shelf calibration and instantly generates real-time planograms. Designed to enhance VenHub's automated Smart Store platform, the new system redefines how retail spaces organize, adapt, and respond to shifting merchandise demand."},{"time":"08:09","ticker":"SM","headline":"SM Energy announced that it has entered into an agreement to sell certain South Texas assets to Caturus Energy, LLC for a cash purchase price of $950 mln","body":"• \"This timely asset sale largely accomplishes one of our key priorities of selling more than $1.0 billion in assets, which will enable us to reduce debt and strengthen our capital structure,\" said President and CEO Beth McDonald. \"We are excited about the impact this divestiture has on our balance sheet and look forward to sharing our updated return-of-capital program when we report earnings next week.\"\n• SM Energy has agreed to sell approximately 61,000 net acres and approximately 260 producing wells in its southern Maverick Basin position in Webb County, Texas, along with related support facilities. Production from these assets is expected to average approximately 37-39 MBoe/d in 2026 (45% liquids, 9% oil) and generate approximately $160 million of asset-level cash flows for the full year, excluding corporate burdens. As of December 31, 2025, net proved reserves associated with these properties were approximately 168 MMBoe.\n• The Transaction is expected to close in the second quarter of 2026 with an effective date of February 1, 2026. SM Energy expects to prioritize debt reduction with the proceeds, reinforcing its commitment to balance sheet strength and financial flexibility."},{"time":"08:08","ticker":"MSGS","headline":"MSG Sports' Board of Directors unanimously approved a plan to explore a possible spin-off that would separate its New York Knicks business from its New York Rangers business","body":"• Co announces that its board of directors has unanimously approved a plan to explore a possible spin-off that would separate its New York Knicks business from its New York Rangers business, creating two distinct publicly traded companies.\n• The possible transaction would enable shareholders to more clearly evaluate each company's assets and growth prospects, while providing both companies with enhanced strategic and financial flexibility.\n• If the Company proceeds with the spin-off transaction, it is expected to be structured as a tax-free spin-off to all Company shareholders and upon completion of the contemplated separation, it is expected that record holders of Company Class A and Class B common stock would receive a pro-rata distribution of 100% of the common stock in the newly created public company.\n• The Company has not set a timetable for completion of this process. Completion of the transaction would be subject to various conditions, including required league approvals, receipt of a tax opinion from counsel and Company board approval."},{"time":"08:08","ticker":"LBTYA","headline":"Liberty Global and Telefnica have announced an agreement to acquire Substantial Group","body":"• Founded in 2019, Substantial Group, owned by investors Advencap, DigitalBridge and Soho Square Capital, is the UK's second largest alternative fibre provider, expected to have more than 3.4 million fibre premises and over 500,000 customers by completion. The acquisition will be made by the parties' joint venture company, nexfibre, and will unlock 3.5 billion of investment in the UK market.\n• The combination of nexfibre, Substantial Group's fibre network (Netomnia) and the customers on 2.1 million Virgin Media O2 premises (which will be upgraded to fibre by nexfibre), will create a scaled, financially secure challenger to BT Openreach, with a full fibre footprint of around 8 million premises by the end of 2027. When combined with the growing fibre footprint of Virgin Media O2, co-owned by Liberty Global and Telefnica, the two networks will collectively reach 20 million premises and give internet service providers a highly attractive wholesale alternative to the incumbent.\n• Infravia, Liberty Global and Telefnica are committing 1bn in new net funding for nexfibre to fund the transaction -- made up of 850m from Infravia and 150m jointly from Liberty Global and Telefnica, with Virgin Media O2 committing traffic on 4.6m overlapping and adjacent homes."},{"time":"08:05","ticker":"KRT","headline":"Karat Packaging finalizes new sourcing arrangements and has begun importing certain products from South America","body":"• Co announces it has finalized new sourcing arrangements and begun importing certain products from South America, further diversifying its global supply network and reinforcing its long-term cost structure.\n• The Company also welcomed the recent U.S. reciprocal tariff reduction on Taiwanese goods to a maximum rate of 15 percent without stacking, down from 20 percent. The Company believes this change is significant for Karat, as roughly half of its global sourcing is from the region.\n• The lower tariff environment, together with the new South American arrangements, is expected to position the Company to further enhance its cost structure and long-term financial performance."},{"time":"08:05","ticker":"HUMA","headline":"Humacyte announces presentation of Symvess long-term safety and efficacy results at VESS Meeting","body":"- After up to 36 months of follow-up, extremity arterial trauma patients had high rates of limb salvage, low rates of infection, and no unprovoked structural failures -Click here for full release."},{"time":"08:05","ticker":"SDA","headline":"SunCar Technology Group integrated ByteDance's Doubao  into its digital auto insurance platform beginning in Q3 2025","body":"• SunCar is now expanding this integration with the launch of its Personalized Auto Insurance AI Agent.\n• Recently, US Insurtech company, Insurify, launched its ChatGPT app to provide AI-powered insurance shopping for consumers. SunCar is pursuing a comparable strategy in China's B2B market, integrating Doubao's GenAI technology to serve distribution partners and their end customers. The Company's Personalized Auto Insurance AI Agent provides drivers with AI-powered insurance services while delivering improved ROI to SunCar's OEM and distribution partners."},{"time":"08:03","ticker":"DDD","headline":"3D Systems expands NextDent Jetted Denture Solution with three new base shades to enhance aesthetics, production flexibility, and patient satisfaction","body":"• Adds three new denture base shades (DP, LP, RP) to better match diverse natural gum tones and address real patient diversity Expands production flexibility for dental laboratories.\n• Reinforces market leadership in monolithic, multi-material denture printing.\n• Delivers up to 300% faster production, over 50% less manual labor, and one-day turnaround (vs. five days traditional) - slashing labor, streamlining workflows, and cutting costs for labs."},{"time":"08:03","ticker":"INV","headline":"Innventure issues statement on Commonwealth Asset Management Schedule 13D and reiterates commitment to value creation strategy","body":"ORLANDO, Fla., Feb. 18, 2026 (GLOBE NEWSWIRE) -- Innventure, Inc. (NASDAQ: INV) (\"Innventure\"), an industrial growth conglomerate, today issued the following statement in response to the Schedule 13 D filed by Commonwealth Asset Management:Click here for full release."},{"time":"08:02","ticker":"WRAPX","headline":"S&amp;P futures vs fair value: +28.00. Nasdaq futures vs fair value: +125.00.","body":"• JPMorgan Chase (JPM 308.00, +0.87, +0.3%) aims to open 160 branches across dozens of states, according to Financial Times.\n• NVIDIA (NVDA 188.53, +3.56, +1.9%) and Meta Platforms (META 638.51, -0.78, -0.1%) expanded thier chip partnership for Meta's AI buildout, according to CNBC.\n• Palo Alto Networks (PANW 151.39, -12.11, -7.4% beat EPS estimates by $0.09, reported revenues in-line, guidesd Q3 EPS below consensus with revenues above consensus; guided FY26 EPS below consensus with revenues above consensus.\n• Japan's January trade balance showed strong export growth with exports to the EU and China making up for lower exports to the U.S. Japan's trade minister announced that $36 bln will be invested into three projects in the U.S. as part of the trade deal.\n• The Reserve Bank of New Zealand left its official cash rate at 2.25%, as expected.\n• The central bank's forward guidance left the door open for a rate hike by the end of the year.\n• Japan's January trade surplus JPY460 bln (expected deficit of JPY180 bln; last deficit of JPY60 bln). January Imports -2.5% yr/yr (expected 3.0%; last 5.2%) and Exports 16.8% yr/yr (expected 12.0%; last 5.1%)\n• Australia's January MI Leading Index -0.1% m/m (last 0.1%). Q4 Wage Price Index 0.8% qtr/qtr, as expected (last 0.8%); 3.4% yr/yr (last 3.3%)\n• New Zealand's Q4 Input PPI -0.5% qtr/qtr (expected 0.4%; last 0.2%); 0.1% qtr/qtr (expected 0.6%; last 0.6%)\n• British inflation decelerated notably in January, increasing expectations for a March rate cut from the Bank of England.\n• European Central Bank President Lagarde is reportedly planning to leave her post before the French presidential election in early 2027, though her term as ECB president does not end until October 2027.\n• European Central Bank policymaker Villeroy de Galhau said that French growth is expected to exceed 1.0% this year, adding that the ECB has won the battle against inflation.\n• U.K.'s January CPI -0.5% m/m, as expected (last 0.4%); 3.0% yr/yr, as expected (last 3.4%). January Core CPI -0.6% m/m (expected -0.7%; last 0.3%); 3.1% yr/yr (expected 3.0%; last 3.2%). January Input PPI 0.4% m/m, as expected (last -0.5%) and Output PPI 0.0% m/m (expected 0.2%; last -0.1%). January House Price Index 2.4% yr/yr (expected 1.8%; last 2.5%)\n• France's January CPI -0.3% m/m, as expected (last 0.1%); 0.3% yr/yr, as expected (last 0.8%)"},{"time":"08:00","ticker":"BONDX","headline":"Overnight Treasury Market Summary","body":"• U.S. Treasuries are on track for a slightly lower start after another subdued night. Treasury futures faced some pressure during the early part of the Asian session before nestling into a sideways range that has remained in effect over the past few hours. Once again, the overnight volume was on the lower side due to continued Lunar New Year closures, though the market received some noteworthy data, including cool CPI from the U.K. and France. Also of note, Japan's trade minister announced that $36 bln will be invested into three projects in the U.S. as part of the trade deal. The U.S. session will feature a full data slate and the U.S. Treasury will sell $16 bln in 20-yr bonds at 13:00 ET. Crude oil is on the rise while the U.S. Dollar Index is up 0.1% at 97.20.\n• Yield Check: 2-yr: +1 bp to 3.45% 3-yr: +1 bp to 3.48% 5-yr: +1 bp to 3.63% 10-yr: +1 bp to 4.06% 30-yr: +1 bp to 4.69%\n• 2-yr: +1 bp to 3.45%\n• 3-yr: +1 bp to 3.48%\n• 5-yr: +1 bp to 3.63%\n• 10-yr: +1 bp to 4.06%\n• 30-yr: +1 bp to 4.69%\n• News: The Reserve Bank of New Zealand left its official cash rate at 2.25%, as expected. The central bank's forward guidance left the door open for a rate hike by the end of the year. European Central Bank President Lagarde is reportedly planning to leave her post before the French presidential election in early 2027, though her term as ECB president does not end until October 2027. European Central Bank policymaker Villeroy de Galhau said that French growth is expected to exceed 1.0% this year, adding that the ECB has won the battle against inflation. Japan's January trade surplus reached JPY460 bln (expected deficit of JPY180 bln; last deficit of JPY60 bln) as imports fell 2.5% yr/yr (expected 3.0%; last 5.2%) and exports jumped 16.8% yr/yr (expected 12.0%; last 5.1%). Australia's January MI Leading Index was down 0.1% m/m (last 0.1%). Q4 Wage Price Index was up 0.8% qtr/qtr, as expected (last 0.8%), rising 3.4% yr/yr (last 3.3%). New Zealand's Q4 Input PPI was down 0.5% qtr/qtr (expected 0.4%; last 0.2%) but up 0.1% qtr/qtr (expected 0.6%; last 0.6%). U.K.'s January CPI was down 0.5% m/m, as expected (last 0.4%), rising 3.0% yr/yr, as expected (last 3.4%). January Core CPI was down 0.6% m/m (expected -0.7%; last 0.3%), rising 3.1% yr/yr (expected 3.0%; last 3.2%). January Input PPI was up 0.4% m/m, as expected (last -0.5%) and Output PPI was unchanged m/m (expected 0.2%; last -0.1%). January House Price Index rose 2.4% yr/yr (expected 1.8%; last 2.5%). France's January CPI was down 0.3% m/m, as expected (last 0.1%), rising 0.3% yr/yr, as expected (last 0.8%).\n• The Reserve Bank of New Zealand left its official cash rate at 2.25%, as expected. The central bank's forward guidance left the door open for a rate hike by the end of the year.\n• European Central Bank President Lagarde is reportedly planning to leave her post before the French presidential election in early 2027, though her term as ECB president does not end until October 2027.\n• European Central Bank policymaker Villeroy de Galhau said that French growth is expected to exceed 1.0% this year, adding that the ECB has won the battle against inflation.\n• Japan's January trade surplus reached JPY460 bln (expected deficit of JPY180 bln; last deficit of JPY60 bln) as imports fell 2.5% yr/yr (expected 3.0%; last 5.2%) and exports jumped 16.8% yr/yr (expected 12.0%; last 5.1%).\n• Australia's January MI Leading Index was down 0.1% m/m (last 0.1%). Q4 Wage Price Index was up 0.8% qtr/qtr, as expected (last 0.8%), rising 3.4% yr/yr (last 3.3%).\n• New Zealand's Q4 Input PPI was down 0.5% qtr/qtr (expected 0.4%; last 0.2%) but up 0.1% qtr/qtr (expected 0.6%; last 0.6%).\n• U.K.'s January CPI was down 0.5% m/m, as expected (last 0.4%), rising 3.0% yr/yr, as expected (last 3.4%). January Core CPI was down 0.6% m/m (expected -0.7%; last 0.3%), rising 3.1% yr/yr (expected 3.0%; last 3.2%). January Input PPI was up 0.4% m/m, as expected (last -0.5%) and Output PPI was unchanged m/m (expected 0.2%; last -0.1%). January House Price Index rose 2.4% yr/yr (expected 1.8%; last 2.5%).\n• France's January CPI was down 0.3% m/m, as expected (last 0.1%), rising 0.3% yr/yr, as expected (last 0.8%).\n• Commodities: WTI Crude: +2.7% to $63.99/bbl Gold: +0.9% to $4950.10/ozt Copper: +1.2% to $5.71/lb\n• WTI Crude: +2.7% to $63.99/bbl\n• Gold: +0.9% to $4950.10/ozt\n• Copper: +1.2% to $5.71/lb\n• Currencies: EUR/USD: -0.1% to 1.1839 GBP/USD: +0.1% to 1.3570 USD/CNH: +0.1% to 6.8862 USD/JPY: +0.2% to 153.66\n• EUR/USD: -0.1% to 1.1839\n• GBP/USD: +0.1% to 1.3570\n• USD/CNH: +0.1% to 6.8862\n• USD/JPY: +0.2% to 153.66\n• Data out Today: 7:00 ET: Weekly MBA Mortgage Index (actual 2.8%; prior -0.3%) 8:30 ET: December Housing Starts (Briefing.com consensus 1.320 mln; October 1.246 mln) and December Building Permits (Briefing.com consensus 1.412 mln; October 1.330 mln), December Durable Orders (Briefing.com consensus -2.6%; prior 5.3%) and Orders ex-transportation (Briefing.com consensus 0.3%; prior 0.5%) 9:15 ET: January Industrial Production (Briefing.com consensus 0.4%; prior 0.4%) and Capacity Utilization (Briefing.com consensus 76.5%; prior 76.3%) 14:00 ET: January FOMC Minutes 16:00 ET: December Net Long-Term TIC Flows (prior $220.2 bln)\n• 7:00 ET: Weekly MBA Mortgage Index (actual 2.8%; prior -0.3%)\n• 8:30 ET: December Housing Starts (Briefing.com consensus 1.320 mln; October 1.246 mln) and December Building Permits (Briefing.com consensus 1.412 mln; October 1.330 mln), December Durable Orders (Briefing.com consensus -2.6%; prior 5.3%) and Orders ex-transportation (Briefing.com consensus 0.3%; prior 0.5%)\n• 9:15 ET: January Industrial Production (Briefing.com consensus 0.4%; prior 0.4%) and Capacity Utilization (Briefing.com consensus 76.5%; prior 76.3%)\n• 14:00 ET: January FOMC Minutes\n• 16:00 ET: December Net Long-Term TIC Flows (prior $220.2 bln)\n• Treasury Auctions: 13:00 ET: $16 bln 20-yr Treasury bond auction results\n• 13:00 ET: $16 bln 20-yr Treasury bond auction results"},{"time":"07:58","ticker":"CGC","headline":"Canopy Growth announces that shareholders of MTL Cannabis Corp have voted to approve the Company's previously announced acquisition of MTL at a special meeting of shareholders of MTL held February 17","body":"The closing of the Transaction, which remains subject to customary closing conditions, including final court and other third-party approvals, is expected to occur before the end of March 2026."},{"time":"07:50","ticker":"WIRES","headline":"On The Wires","body":"• Tigo Energy (TYGO) announces that the Company's vast network of solar installers has logged 1,500 Green Glove service program engagements. The Green Glove program helps reinforce the Company's ongoing commitment to Total Quality Solar and deliver the best possible installer experience for participants, such as Brighthouse Solar of Central California. In addition to the Green Glove program, Tigo has deployed more than 12,000 customized onboarding sequences, across ten countries, to bring new installation companies up to speed on all things Tigo. From region-specific information to product and software training tips, these sequences are designed to ensure that installers have what they need based on their company's unique profile and location.\n• Aquestive Therapeutics (AQST) announces the appointment of Matthew Greenhawt, MD, MBA, MSc, as Chief Medical Officer, strengthening its leadership team as the Company prepares to resubmit its Anaphylm New Drug Application to the United Stated Food and Drug Administration and advance its clinical pipeline.\n• Hyliion Holdings Corp. (HYLN) announces the successful operation of its full KARNO Core system on diesel fuel. This achievement marks a significant milestone towards the commercialization of the KARNO solution, confirming its operational effectiveness on liquid fuel in addition to its previously validated portfolio of gaseous fuels. During operation at the company's Cincinnati, Ohio facility, the KARNO system successfully exported power to the grid while meeting stringent Tier 4 Final emission requirements without the need for after-treatment systems.\n• QuickLogic Corporation (QUIK) has been awarded a $13 million contract. This funding will support the continued development and demonstration of Strategic Radiation Hardened high reliability Field Programmable Gate Array technology. The initiative aims to meet current and future Department of War strategic and space system requirements.\n• BrightView Landscapes (BV) announces a significant expansion of its partnership with The Villages, Florida's premier residential and recreation community."},{"time":"07:48","ticker":"WING","headline":"Wingstop beats by $0.17, misses on revs; domestic comp -5.8%; sees FY26 domestic comps flat to up low-single digit","body":"• Reports Q4 (Dec) earnings of $1.00 per share, $0.17 better than the FactSet Consensus of $0.83; revenues rose 8.6% year/year to $175.69 mln vs the $177.76 mln FactSet Consensus.Domestic same store sales decreased 5.8% vs. 2024.Digital sales represented 73.2% of system-wide sales.124 net new openings.\n• Domestic same store sales decreased 5.8% vs. 2024.\n• Digital sales represented 73.2% of system-wide sales.\n• 124 net new openings.\n• FY26 guidance:Flat to low-single digit domestic same store sales growth.Global unit growth rate of 15% to 16%.\n• Flat to low-single digit domestic same store sales growth.\n• Global unit growth rate of 15% to 16%."},{"time":"07:42","ticker":"SHAZ","headline":"SharonAI Holdings Inc. prices 4.16 mln share IPO at $30 for total gross proceeds of $125.0 mln; Company originally planned to offer 2.5 mln shares at $49-$51 per share","body":""},{"time":"07:39","ticker":"BWAY","headline":"Brainsway highlights Evernorth removal of prior authorization for TMS coverage","body":"• BrainsWay said Evernorth Behavioral Health, a division of Cigna Group, will eliminate prior authorization requirements for transcranial magnetic stimulation (TMS) for contracted providers, effective March 6, 2026.The change applies to patients covered under Evernorth and Cigna Healthcare plans and impacts more than 18 mln covered lives across 12 states.Evernorth currently covers TMS for major depressive disorder and obsessive-compulsive disorder, potentially streamlining access for eligible patients.Removal of prior authorization could reduce administrative burden for providers and support broader utilization of TMS therapies.\n• The change applies to patients covered under Evernorth and Cigna Healthcare plans and impacts more than 18 mln covered lives across 12 states.\n• Evernorth currently covers TMS for major depressive disorder and obsessive-compulsive disorder, potentially streamlining access for eligible patients.\n• Removal of prior authorization could reduce administrative burden for providers and support broader utilization of TMS therapies."},{"time":"07:36","ticker":"CBIO","headline":"Crescent Biopharma doses first patient in ASCEND Phase 1/2 Clinical Trial of CR-001 for the treatment of advanced solid tumors","body":"ASCEND to evaluate CR-001, a PD-1 x VEGF bispecific antibody, in multiple solid tumor types, including NSCLC and gastrointestinal and gynecological cancers in first-line and previously treated patientsClick here for full release."},{"time":"07:35","ticker":"CLH","headline":"Clean Harbors beats by $0.02, beats on revs; $350 mln expansion of existing share repurchase program; to acquire Depot Connect International","body":"• Reports Q4 (Dec) earnings of $1.62 per share, $0.02 better than the FactSet Consensus of $1.60; revenues rose 4.8% year/year to $1.5 bln vs the $1.46 bln FactSet Consensus.\n• In the first quarter of 2026, Clean Harbors expects Adjusted EBITDA to grow 4% to 7% year over year in its ES segment and be up 1% to 3% on a consolidated basis.\n• For full-year 2026, Clean Harbors expects: Adjusted EBITDA in the range of $1.20 billion to $1.26 billion, with a midpoint of $1.23 billion. This Adjusted EBITDA range is based on anticipated GAAP net income in the range of $410 million to $461 million.Adjusted free cash flow in the range of $480 million to $540 million, with a midpoint of $510 million. This range is based on anticipated net cash from operating activities in the range of $820 million to $940 million.\n• Adjusted EBITDA in the range of $1.20 billion to $1.26 billion, with a midpoint of $1.23 billion. This Adjusted EBITDA range is based on anticipated GAAP net income in the range of $410 million to $461 million.\n• Adjusted free cash flow in the range of $480 million to $540 million, with a midpoint of $510 million. This range is based on anticipated net cash from operating activities in the range of $820 million to $940 million.\n• As of December 31, 2025, the Company had approximately $250 million of availability remaining under its existing share repurchase program. The Board of Directors has authorized a $350 million expansion of the existing program.\n• The Company today announced the signing of a purchase and sale agreement to acquire certain businesses of Depot Connect International (DCI) for approximately $130 million."},{"time":"07:35","ticker":"VVX","headline":"V2X announces its selection for a seat on the Advanced Technology Support Program 5, a $25 billion multiple-award Indefinite Delivery/Indefinite Quantity contract","body":"• ATSP5, administered by the Defense Microelectronics Activity under the Office of the Secretary of Defense, is one of the Department of Defense's most comprehensive engineering development and technology transition initiatives.\n• This contracting vehicle provides federal and state government agencies with streamlined access to V2X's capabilities in delivering mission-critical solutions. The scope of ATSP5 includes engineering development, from system studies and prototyping to testing, integration, and limited production. It also includes full lifecycle technology support for embedded systems, network-centric warfare systems, large-scale integrations, and standalone systems.\n• The program creates opportunities for modernization, overcoming obsolescence challenges, and extending the lifecycle of aging equipment while advancing cutting-edge technology such as AI-optimized systems and large-scale AI orchestration to address emerging threats."},{"time":"07:34","ticker":"SEDG","headline":"SolarEdge Technologies beats by $0.09, beats on revs; guides Q1 revs in-line","body":"• Reports Q4 (Dec) loss of $(0.14) per share, excluding non-recurring items, $0.09 better than the FactSet Consensus of ($0.23); revenues rose 70.9% year/year to $335.36 mln vs the $329.19 mln FactSet Consensus.\n• Co issues in-line guidance for Q1, sees Q1 revs of $290-320 mln vs. $295.27 mln FactSet Consensus.Non-GAAP gross margin expected to be within the range of 20% to 24%.\n• Non-GAAP gross margin expected to be within the range of 20% to 24%."},{"time":"07:33","ticker":"JNJ","headline":"Johnson &amp; Johnson announces that the U.S. FDA has granted Breakthrough Therapy Designation for subcutaneous amivantamab and hyaluronidase-lpuj as a monotherapy for the treatment of adults with head and neck squamous cell carcinoma that is recurrent or metastatic and human papillomavirus -unrelated after disease progression on or after platinum-based chemotherapy and a PD-1 or PD-L1 inhibitor","body":"New designation is based on data showing rapid and durable responses in a heavily pretreated patient population and expands the promise of RYBREVANT FASPRO beyond lung cancer."},{"time":"07:32","ticker":"JLL","headline":"Jones Lang LaSalle beats by $1.36, beats on revs","body":"• Reports Q4 (Dec) earnings of $8.71 per share, excluding non-recurring items, $1.36 better than the FactSet Consensus of $7.35; revenues rose 11.7% year/year to $7.61 bln vs the $7.44 bln FactSet Consensus.\n• Real Estate Management Services' 9% top-line increase was driven by Workplace Management and Project Management.\n• Capital Markets Services delivered broad-based 19% growth across geographies, led by strength in investment sales and debt advisory.\n• Leasing, within Leasing Advisory, outpaced market volumes and grew 17%, highlighted by office and industrial."},{"time":"07:31","ticker":"LAZ","headline":"Lazard announces that John Koski and Rob Lowe joined the firm in New York as Managing Directors in the Healthcare Group, advising on transactions across the healthcare services sector.","body":"• These appointments underscore Lazard's continued investment in its Healthcare Group and focus on providing thoughtful, high-quality strategic advice to executives, boards, and investors across the healthcare sector.\n• This announcement also reflects the ongoing momentum behind Lazard's long-term growth strategy, as exceptional bankers are increasingly drawn to the firm's entrepreneurial culture, renowned brand, and global platform."},{"time":"07:30","ticker":"SUMRX","headline":"European Markets Update: DAX +0.8%, FTSE +1.1%, CAC +0.6%","body":"• In economic data: U.K.'s January CPI -0.5% m/m, as expected (last 0.4%); 3.0% yr/yr, as expected (last 3.4%). January Core CPI -0.6% m/m (expected -0.7%; last 0.3%); 3.1% yr/yr (expected 3.0%; last 3.2%). January Input PPI 0.4% m/m, as expected (last -0.5%) and Output PPI 0.0% m/m (expected 0.2%; last -0.1%). January House Price Index 2.4% yr/yr (expected 1.8%; last 2.5%) France's January CPI -0.3% m/m, as expected (last 0.1%); 0.3% yr/yr, as expected (last 0.8%)\n• U.K.'s January CPI -0.5% m/m, as expected (last 0.4%); 3.0% yr/yr, as expected (last 3.4%). January Core CPI -0.6% m/m (expected -0.7%; last 0.3%); 3.1% yr/yr (expected 3.0%; last 3.2%). January Input PPI 0.4% m/m, as expected (last -0.5%) and Output PPI 0.0% m/m (expected 0.2%; last -0.1%). January House Price Index 2.4% yr/yr (expected 1.8%; last 2.5%)\n• France's January CPI -0.3% m/m, as expected (last 0.1%); 0.3% yr/yr, as expected (last 0.8%)\n• STOXX Europe 600: +0.9%\n• Germany's DAX: +0.8%\n• U.K.'s FTSE 100: +1.1%\n• France's CAC 40: +0.6%\n• Italy's FTSE MIB: +1.2%\n• Spain's IBEX 35: +1.3%\n• EUR/USD: -0.1% to 1.1839\n• GBP/USD: +0.1% to 1.3578\n• USD/CHF: +0.1% to 0.7708"},{"time":"07:29","ticker":"SCANX","headline":"Gapping up/Gapping down","body":"• TCMD +22.4% (also acquires LymphaTech), GLBE +20.8%, RSI +18.1%, MCW +16.1%, GRMN +11.5%, USNA +11.3%, GSHD +10.9% (increases share repurchase authorization by $180 mln), WTTR +8.1%, ADI +8.1%, ATRC +7.7%, CDNS +7.5%, GPN +7.4%, CE +7.3%, SSRM +7.1%, COCO +6.8%, PBI +6.4%, AMRZ +5.6% (approves $1 bln share repurchase program and special dividend of $0.44/share), RBA +5.5%, CSTM +5.2%, PUMP +4.9%, CZR +4.5%, HL +4.2%, FDP +4.2%, OGI +3.9%, CNK +3.7%, NNE +2.9%, MCO +2.8%, IAG +2.4%, PODD +2.4%, HQY +2%, TFII +2%, ESI +1.8%, ANDE +1.5%, CRL +1.5%, CMRE +1.4%, DVN +1.3%, GNK +1.2%\n• UPWK +8.9% (board of directors approved a new $300 mln share repurchase program)\n• ADI +7.7% (increases dividend)\n• SSRM +7.1% (issued a notice of redemption for its $230,000,000 original aggregate principal amount of its 2.50% Convertible Senior Notes due 2039)\n• RIOT +5.3% (Starboard value delivers letter to Riot Platforms)\n• SMX +4.7% (stock offering by selling shareholders)\n• NYT +3.6% (Berkshire Hathaway (Warren Buffett) discloses updated portfolio positions in 13F filing: New NYT position)\n• OVV +3.1% (announces agreement to sell its Anadarko assets for $3 bln)\n• KALV +2.6% (announces that the newly published International Guideline on the Diagnosis and Management of Pediatric Patients With Hereditary Angioedema recommends EKTERLY as a first-line therapy for the acute treatment of hereditary angioedema attacks in adolescents aged 12 years and older)\n• STLD +2.3% (co and SGH Ltd confirm final share proposal to acquire BlueScope Steel)\n• WDC +2.3% (Sandisk prices secondary offering by Western Digital Corporation (WDC) of 5,821,135 shares of its common stock at $545.00 per share)\n• NVDA +2.2% (strategic partnership with Meta (META) spanning on-premises, cloud and AI infrastructure)\n• TLX +1.9% (submits European marketing authorization application for TLX101-Px)\n• DRS +1.6% (awarded contracts for the Missle Defense Agency SHIELD IDIQ)\n• AMZN +1.6% (Berkshire Hathaway (Warren Buffett) discloses updated portfolio positions in 13F filing: lowered AMZN)\n• AA +1.6% (reaches agreement with Australian government on WA mining approvals)\n• LSCC +1.5% (launches joint cyber resiience reference kit)\n• VAL +1.4% (issues fleet status report)\n• HAL +1.3% (receives multiyear contract from KS Orka Renewables)\n• VYX +1.1% (increases share repurchase authorization to $300 mln)\n• SFNC +1.1% (authorizes new $175 mln share repurchase program)\n• ISSC +1.1% (files for $100 mln common stock offering)\n• SMWB -23.3%, FVRR -17.7%, ACLS -12.6%, LZB -10.2%, MKSI -6.1%, QUAD -6.1%, PANW -6%, CAMT -5.1%, SBSW -4.8%, OSW -4.6%, ICL -4.5%, BRSP -4.3%, DINO -3.2%, HUN -2.8%, BLCO -2.7%, TRTX -2.3%, NAMS -1.2%\n• NAK -29.1% (provides update on summary judgement case)\n• APLD -7% (NVIDIA (NVDA) discloses updated portfolio positions in 13F filing: exited APLD)\n• CMPS -5.4% (stock offering)\n• GTY -3.9% (prices offering of 4.0 mln shares of common stock for gross proceeds of $131 mlng)\n• POR -3.1% (prices offering of 9,467,455 shares of its common stock at $50.70 per share)\n• WPC -2.9% (prices offering of 6.0 mln shares of common stock for gross proceeds of $432 mln)\n• SNDK -2.8% (prices secondary offering by Western Digital Corporation (WDC) of 5,821,135 shares of its common stock at $545.00 per share)\n• ITRG -2.3% (announces strategic land acquisition)\n• COHU -1.9% (files mixed shelf offering)"},{"time":"07:21","ticker":"VRSK","headline":"Verisk Analytics beats by $0.22, reports revs in-line; guides FY26 EPS in-line, revs below consensus; plans $1.5 bln accelerated share repurchase program","body":"• Reports Q4 (Dec) earnings of $1.82 per share, excluding non-recurring items, $0.22 better than the FactSet Consensus of $1.60; revenues rose 5.8% year/year to $779 mln vs the $773.59 mln FactSet Consensus.\n• Co issues guidance for FY26, sees EPS of $7.45-7.75, excluding non-recurring items, vs. $7.71 FactSet Consensus; sees FY26 revs of $3.19-3.24 bln vs. $3.26 bln FactSet Consensus.\n• On February 13, 2026, our Board of Directors approved a cash dividend of 50 cents per share of common stock issued and outstanding, an increase of 11%, payable on March 31, 2026, to holders of record as of March 13, 2026. Our Board of Directors also approved an increase to the share repurchase authorization to $2.5 billion in total, inclusive of the remaining authorization amount, which is expected to be implemented through a $1.5 billion accelerated share repurchase program in the near term."},{"time":"07:18","ticker":"MRNA","headline":"Moderna announces the FDA will initiate the review of its investigational seasonal influenza vaccine submission","body":"• Co announced that, in response to a prior Refusal-to-File letter, the Company engaged with the FDA in a Type A meeting and proposed a revised regulatory approach for its investigational seasonal influenza vaccine candidate, mRNA-1010. To advance the review, Moderna proposed a regulatory pathway based on age, seeking full approval for adults 50 to 64 years of age and accelerated approval for adults 65 and older, along with a post-marketing requirement to conduct an additional study in older adults.\n• Following submission of the amended application, the FDA has accepted the biologics license application for review and assigned a Prescription Drug User Fee Act goal date of August 5, 2026. Pending review and FDA approval, mRNA-1010 would be available for U.S. adults 50 years of age and older, including adults 65 and older, for the 2026/2027 flu season.\n• \"We appreciate the FDA's engagement in a constructive Type A meeting and its agreement to advance our application for review,\" said Stphane Bancel, Chief Executive Officer of Moderna. \"Pending FDA approval, we look forward to making our flu vaccine available later this year so that America's seniors have access to a new option to protect themselves against flu.\""},{"time":"07:17","ticker":"CRL","headline":"Charles River announces two executive appointments","body":"• Glenn G. Coleman has been named the Company's next Chief Financial Officer and Kerry Dailey has been named to the newly-created position of Chief Legal Officer.\n• Glenn Coleman will join the Company as Corporate Executive Vice President and Chief Financial Officer on April 6th. At Charles River, Mr. Coleman will lead the Company's global Finance organization and will be responsible for overseeing the Accounting, Tax, Treasury, Investor Relations, Internal Audit, Risk Management, Global Facilities and Real Estate, and Global Procurement functions, as well as working closely with operational finance teams across the global businesses.\n• Glenn Coleman will join Charles River with over 30 years of strong financial and operational management experience, including more than a decade of senior leadership roles in the healthcare sector. Most recently since 2024, Mr. Coleman has been serving as Chief Financial Officer and Chief Administrative Officer of a $1-billion healthcare services business.\n• Kerry Dailey will join the Company as Corporate Senior Vice President and Chief Legal Officer on March 30th. At Charles River, Ms. Dailey will lead the Global Legal function and help set the strategic direction for legal and governance matters in support of the Company's mission and strategic vision. She will oversee and integrate Charles River's Legal, Compliance, Corporate Communications, Government Relations, Security, and Global ESG functions, serving as a key advisor to the Board of Directors and Executive Leadership team.\n• Ms. Dailey brings 25 years of sophisticated legal experience to Charles River, with deep expertise advising multinational, life science companies across complex regulatory environments. She joins Charles River from Alcon, Inc., where she spent more than a decade in roles of increasing responsibility, most recently serving as Vice President, Legal and Assistant Corporate Secretary."},{"time":"07:15","ticker":"MCW","headline":"Mister Car Wash to be taken private by Leonard Green &amp; Partners for $7.00/share","body":"• The Co. has entered into a definitive merger agreement pursuant to which investment funds managed by Leonard Green & Partners, L.P. will purchase all of the outstanding shares of the Company's common stock that are not already owned by LGP's affiliates for $7.00 per share in cash, which implies a total enterprise value of the Company of $3.1 billion. LGP has been a long-term strategic partner to the Company since its initial investment in 2014 and is currently the beneficial owner of approximately 67% of the Company's outstanding shares of common stock.\n• All-cash transaction delivers significant and certain value to Mister Car Wash stockholders at a premium of 29% to the volume-weighted average price of Mister Car Wash's shares during the 90 days prior to and including February 17, 2026.\n• Transaction unanimously approved and recommended by a Special Committee of the Mister Car Wash Board of Directors, composed entirely of independent directors.\n• Upon completion of the transaction, Mister Car Wash's common stock will no longer be listed on Nasdaq, and Mister Car Wash will become a privately held company owned by investment funds managed by LGP.\n• The transaction is expected to close in the first half of 2026, subject to obtaining regulatory approvals and the satisfaction or waiver of other customary closing conditions."},{"time":"07:15","ticker":"MO","headline":"Altria reaffirms FY26 EPS guidance","body":"• Co reaffirms guidance for FY26 (Dec), sees EPS of $5.56-5.72, excluding non-recurring items, vs. $5.60 FactSet Consensus."},{"time":"07:13","ticker":"PODD","headline":"Insulet beats by $0.09, beats on revs; guides FY26 EPS in-line","body":"• Reports Q4 (Dec) earnings of $1.55 per share, excluding non-recurring items, $0.09 better than the FactSet Consensus of $1.46; revenues rose 31.2% year/year (+29.0% CC) to $783.8 mln vs the $769.06 mln FactSet Consensus.\n• Co guides to Q1 revenue growth of +25-27% CC, which is not comparable to consensus.\n• Co issues in-line guidance, sees FY26 adjusted EPS growing at least 25%, which we compute as greater than $6.21 vs. $6.23 FactSet Consensus. Co guides to FY26 revenue growth of +20-22% CC, which is not comparable to consensus."},{"time":"07:13","ticker":"COR","headline":"Cencora reaffirms FY26 EPS and revenue guidance (see 7:07)","body":"• Co reaffirms guidance for FY26 (Sep), sees EPS of $17.45-17.75 vs. $17.62 FactSet Consensus; sees FY26 (Sep) revs of +7-9% yr/yr to ~$343.8-350.2 bln vs. $346.13 bln FactSet Consensus."},{"time":"07:12","ticker":"TLRY","headline":"Tilray and the Carlsberg Group (CABGY) enter into an exclusive multi-year U.S. brewing and commercial partnership","body":"• Under the terms of the agreement, Tilray has been granted a multi-year license to produce, market, sell and distribute Carlsberg, Carlsberg Elephant,1664, and Kronenbourg 1664 Blanc branded beers across all channels in the United States, beginning January 1, 2027. The agreement has an initial five-year term, with an automatic renewal for an additional five years subject to performance criteria.\n• Tilray will leverage its brewing facilities, sales and marketing team, and commercial expertise in the U.S. to locally manufacture and increase Carlsberg's market share of premium and mainstream imported beers within the U.S., which is recognized as the world's second-largest beer market. The partnership further strengthens Tilray's position as a scaled, diversified beverage platform."},{"time":"07:12","ticker":"LCII","headline":"LCI Industries beats by $0.19, beats on revs; Guides FY26 EPS and revenue inline","body":"• Reports Q4 EPS of $0.89, $0.19 better than the $0.70 FactSet Consensus estimate; Revenue increased 16% yr/yr to $933 mln vs. the $913 mln consensus estimate.\n• Adjusted EBITDA increased 53% to $70 million, or 7.5% of net sales.\n• Towable RV content per unit up 11% to $5,670.\n• Co issues inline guidance, sees FY26 EPS of $8.25-$9.25 vs. the $8.41 FactSet Consensus estimate, revenue of $4.2-$4.3 bln vs. the $4.29 bln consensus estimate. January 2026 net sales of approximately $343 million, up 4% from prior year."},{"time":"07:12","ticker":"PM","headline":"Philip Morris International reaffirms FY26 EPS guidance ahead of 2026 CAGNY Conference","body":"• Co reaffirms guidance for FY26 (Dec), sees EPS of $8.38-8.53, excluding non-recurring items, vs. $8.42 FactSet Consensus.\n• The presentation will cover:How a transformed PMI is leading the industry in an evolving operating environment;The success and future opportunities for the company's smoke-free brands led by consumer insights; andPMI's delivery of superior returns to shareholders, including 2026 -- 2028 growth targets.\n• How a transformed PMI is leading the industry in an evolving operating environment;\n• The success and future opportunities for the company's smoke-free brands led by consumer insights; and\n• PMI's delivery of superior returns to shareholders, including 2026 -- 2028 growth targets."},{"time":"07:10","ticker":"UTZ","headline":"Utz Brands highlights long term strategy and differentiated growth at 2026 CAGNY Conference","body":"Utz Brands, Inc. (NYSE: UTZ) (\"Utz\" or the \"Company\"), a leading U.S. manufacturer of branded Salty Snacks and a small-cap value Staples equity, will discuss its strategies and long-term growth targets today at the 2026 Consumer Analyst Group of New York (CAGNY) Conference. Chief Executive Officer, Howard Friedman, and EVP and Chief Financial Officer, BK Kelley, will outline how the Company plans to deliver sustainable growth and acceleration of free cash flow as the Company exits a capital-intensive transformation stage.Click here for full release."},{"time":"07:10","ticker":"NAMS","headline":"NewAmsterdam Pharma reports full year 2025 financial results and provides corporate update","body":"-- Approval decisions from EMA, UK and Switzerland regulators for obicetrapib and obicetrapib/ezetimibe fixed dose combination expected in 2H26 --Click here for full release."},{"time":"07:10","ticker":"NMG","headline":"Nouveau Monde Graphite awards key construction contracts for the Phase-2 Matawinie Mine ahead of FID","body":"• The Co. is preparing for the construction of its Phase-2 Matawinie Mine -- a major project of national interest as identified by the Government of Canada -- via the procurement of key construction capacity, services, equipment and materials. Major contracts awarded over the past few months, with provisions for full execution upon the Company having reached a positive final investment decision, represent over 50% of the project's CAPEX and are within estimates of NMG's updated feasibility study for the Phase-2 Matawinie Mine in accordance with National Instrument 43-101.\n• Civil work to be carried out by Manawan-Fournier, an Atikamekw joint-venture; Metso to supply concentrator equipment; Beauce-Atlas to complete steel structures; and Pomerleau to handle the management of the construction.\n• Over 50% of CAPEX secured by key contracts, within projections, supporting project debt finance activities.\n• Procurement activities underpin preparation for FID, derisk project execution and secure contractor pricing to deliver the Matawinie Mine on time and on budget.\n• Matawinie Mine shovel-ready with close to 80% advancement in detailed engineering, preparatory work completed on site, all key permits secured, and instrumental agreements with First Nation and local community.\n• NMG's Phase-2 Matawinie Mine earmarked as Major Project of National Interest to bolster economic growth, accelerate the development of an integrated value chain in Canada, and support G7 countries and allies in sourcing critical minerals."},{"time":"07:09","ticker":"DCBO","headline":"Docebo Inc. provides update on substantial issuer bid","body":"Docebo Inc. (NASDAQ: DCBO; TSX: DCBO) (\"Docebo\" or the \"Company\"), a leading learning platform provider with a foundation in artificial intelligence (AI) and innovation, today provided an update on its previously announced substantial issuer bid (the \"Offer\") under which the Company will offer to repurchase for cancellation up toUS$60,000,000 of its outstanding common shares (\"Common Shares\") at a price of US$20.40 per Common Share.Click here for full release."},{"time":"07:09","ticker":"CRL","headline":"Charles River beats by $0.05, reports revs in-line; guides FY26 EPS in-line, revs in-line","body":"• Reports Q4 (Dec) earnings of $2.39 per share, excluding non-recurring items, $0.05 better than the FactSet Consensus of $2.34; revenues fell 0.8% year/year to $994.2 mln vs the $986.7 mln FactSet Consensus.\n• Co issues in-line guidance for FY26, sees EPS of $10.70-11.20 vs. $10.89 FactSet Consensus; sees FY26 revs of flat to +1.5% yr/yr to ~$4.02-4.08 bln, excluding non-recurring items, vs. $4.07 bln FactSet Consensus."},{"time":"07:08","ticker":"RIOT","headline":"Riot Platforms: Starboard Value delivers letter to Riot Platforms","body":"• Believes Riot is well positioned to execute high-quality AI/HPC Deals for Its 1.7 GW of fully available power.\n• Believes Riot's Corsicana and Rockdale Sites are two of the premier sites for AI/HPC hosting and should command attractive deal economics.\n• Urges Riot to seize this opportunity with urgency."},{"time":"07:08","ticker":"ADI","headline":"Analog Devices beats by $0.15, beats on revs; guides Q2 EPS above consensus, revs above consensus","body":"• Reports Q1 (Jan) earnings of $2.46 per share, excluding non-recurring items, $0.15 better than the FactSet Consensus of $2.31; revenues rose 30.4% year/year to $3.16 bln vs the $3.12 bln FactSet Consensus.\n• Co issues upside guidance for Q2, sees EPS of $2.73-3.03, excluding non-recurring items, vs. $2.46 FactSet Consensus; sees Q2 revs of $3.4-3.6 bln vs. $3.24 bln FactSet Consensus.At the midpoint of this revenue outlook, we expect reported operating margin of approximately 36.4%, +/-150 bps, and adjusted operating margin of approximately 47.5%, +/-100 bps.\n• At the midpoint of this revenue outlook, we expect reported operating margin of approximately 36.4%, +/-150 bps, and adjusted operating margin of approximately 47.5%, +/-100 bps.\n• The ADI Board of Directors has declared a quarterly cash dividend of $1.10 per outstanding share of common stock. The dividend will be paid on March 17, 2026 to all shareholders of record at the close of business on March 3, 2026."},{"time":"07:08","ticker":"MCW","headline":"Mister Car Wash beats by $0.01, reports revs in-line; company to be taken private","body":"• Reports Q4 (Dec) earnings of $0.11 per share, $0.01 better than the FactSet Consensus of $0.10; revenues rose 4.0% year/year to $261.24 mln vs the $262.05 mln FactSet Consensus.\n• Co agreed to be acquired by Leonard Green & Partners for $7.00/share, implying a value of $3.1 bln."},{"time":"07:08","ticker":"SSRM","headline":"SSR Mining has issued a notice of redemption for its $230,000,000 original aggregate principal amount of its 2.50% Convertible Senior Notes due 2039","body":"There is currently $227,495,000 aggregate principal of Notes outstanding."},{"time":"07:07","ticker":"GRMN","headline":"Garmin beats by $0.39, beats on revs; guides FY26 EPS above consensus, revs above two analyst estimate; proposes 17% dividend increase; announces new $500 mln share repurchase program","body":"• Reports Q4 (Dec) earnings of $2.79 per share, excluding non-recurring items, $0.39 better than the FactSet Consensus of $2.40; revenues rose 16.6% year/year to $2.12 bln vs the $2.04 bln two analyst estimate.\n• Co issues upside guidance for FY26, sees EPS of $9.35, excluding non-recurring items, vs. $8.70 FactSet Consensus; sees FY26 revs of $7.90 bln vs. $7.69 bln two analyst estimate.\n• The Board of Directors intends to recommend to the shareholders for approval at the annual meeting that the co raise its quarterly dividend by 17% to $1.05/sh.\n• Co authorizes a $500 mln share repurchase program. This new share repurchase program replaces the $300 mln share repurchase program authorized on February 16, 2024, pursuant to which the co repurchased $244 mln of its shares."},{"time":"07:07","ticker":"COCO","headline":"The Vita Coco Company misses by $0.04, beats on revs; guides FY26 revs in-line","body":"• Reports Q4 (Dec) earnings of $0.09 per share, $0.04 worse than the FactSet Consensus of $0.13; revenues rose 0.4% year/year to $127.79 mln vs the $121.4 mln FactSet Consensus.\n• Co issues in-line guidance for FY26, sees FY26 revs of $680-700 mln vs. $685.39 mln FactSet Consensus.Gross margin expected to be approximately 38% with benefit from lower cost of goods due to a reduction in tariffs and higher pricing partially offset by adverse product mix and increased branded promotion and incentives.Adjusted EBITDA expected to be in the range of $122 million to $128 million.\n• Gross margin expected to be approximately 38% with benefit from lower cost of goods due to a reduction in tariffs and higher pricing partially offset by adverse product mix and increased branded promotion and incentives.\n• Adjusted EBITDA expected to be in the range of $122 million to $128 million.\n• \"Looking forward, our guidance is based on continued brand growth in our major markets, and improved private label trends based on expected new and regained business in 2026. Our cost outlook is stable which we expect will enable us to grow adjusted EBITDA in 2026 ahead of our net sales growth rate.\""},{"time":"07:07","ticker":"COR","headline":"Cencora and Covetrus have entered into a definitive agreement under which Covetrus and MWI Animal Health will merge, creating a combined company offering a comprehensive animal health platform","body":"• Combination of companion animal distribution, production animal distribution and technology platforms will make animal healthcare more accessible and affordable.\n• Transaction unites complementary businesses to deliver innovative, efficient solutions and expertise across the entire animal health ecosystem.\n• Deal values MWI at an enterprise value of $3.5 billion. Cencora to receive cash proceeds of $1.25 billion and $800 million of preferred equity while retaining a non-controlling common equity stake of 34.3% in the combined company."},{"time":"07:07","ticker":"PUMP","headline":"ProPetro beats by $0.13, beats on revs","body":"• Reports Q4 (Dec) earnings of $0.01 per share, $0.13 better than the FactSet Consensus of ($0.12); revenues fell 9.6% year/year to $289.7 mln vs the $281.24 mln FactSet Consensus.\n• GuidanceThe Company anticipates full-year 2026 capital expenditures to be between $390 million and $435 million. Of this amount, the Completions business is expected to account for approximately $140 million to $160 million, including approximately $40 million to $50 million related to lease buyouts for a portion of the Company's FORCE electric fleet portfolio.\n• The Company anticipates full-year 2026 capital expenditures to be between $390 million and $435 million. Of this amount, the Completions business is expected to account for approximately $140 million to $160 million, including approximately $40 million to $50 million related to lease buyouts for a portion of the Company's FORCE electric fleet portfolio."},{"time":"07:06","ticker":"PII","headline":"Polaris unveils 2027 snowmobile lineup built for confidence, capability, and rider-first performance","body":"MINNEAPOLIS, Feb. 18, 2026 /PRNewswire/ -- Today, Polaris Inc. (NYSE: PII), the global leader in powersports, announced its 2027 snowmobile lineup, delivering a new level of performance and innovation across mountain, trail, and utility riding. From race-proven mountain machines to premium trail performers and rugged Nordic-tested utility sleds, the 2027 lineup reflects Polaris' commitment to building top-performing sleds for every rider.Click here for full release."},{"time":"07:05","ticker":"GPN","headline":"Global Payments announces the appointment of Vivek Sankaran as a new independent director to the company's Board of Directors, effective February 19, 2026","body":"Mr. Sankaran's appointment follows the company's constructive engagement with Elliott Investment Management L.P. as announced on September 29, 2025."},{"time":"07:05","ticker":"MCO","headline":"Moody's beats by $0.21, beats on revs; guides FY26 EPS in-line","body":"• Reports Q4 (Dec) earnings of $3.64 per share, excluding non-recurring items, $0.21 better than the FactSet Consensus of $3.43; revenues rose 13.0% year/year to $1.89 bln vs the $1.87 bln FactSet Consensus.\n• Co issues in-line guidance for FY26, sees EPS of $16.40 to $17.00, excluding non-recurring items, vs. $16.51 FactSet Consensus.FY26 revenue growth expected in the high single digits.\n• FY26 revenue growth expected in the high single digits."},{"time":"07:04","ticker":"UPWK","headline":"Upwork announces that its board of directors approved a new $300 mln share repurchase program","body":""},{"time":"07:04","ticker":"GPN","headline":"Global Payments beats by $0.02, reports revs in-line; guides FY26 EPS above consensus; $2.5 bln share buyback authorization and entering into $550 mln accelerated share repurchase plan","body":"• Reports Q4 (Dec) earnings of $3.18 per share, excluding non-recurring items, $0.02 better than the FactSet Consensus of $3.16; revenues rose 1.4% year/year to $2.32 bln vs the $2.3 bln FactSet Consensus.\n• Co issues upside guidance for FY26, sees EPS of $13.80-14.00, excluding non-recurring items, vs. $13.53 FactSet Consensus.Constant currency adjusted net revenue growth of approximately 5% excluding dispositions.Adjusted operating margin expansion of approximately 150 basis points.\n• Constant currency adjusted net revenue growth of approximately 5% excluding dispositions.\n• Adjusted operating margin expansion of approximately 150 basis points.\n• The Board of Directors authorized share repurchases of $2.5 billion. The company is entering into a $550 million accelerated share repurchase plan.\n• Global Payments' Board of Directors approved a dividend of $0.25 per share payable on March 30, 2026 to shareholders of record as of March 9, 2026."},{"time":"07:03","ticker":"OPLN","headline":"OPENLANE misses by $0.02, beats on revs; guides FY26 EPS below consensus","body":"• Reports Q4 (Dec) earnings of $0.25 per share, excluding non-recurring items, $0.02 worse than the FactSet Consensus of $0.27; revenues rose 8.6% year/year to $494.3 mln vs the $472.05 mln FactSet Consensus.Gross Merchandise Value (GMV) of approximately $7.1 billion, representing 8% YoY growth; Marketplace dealer volume growth of 9% YoY.\n• Gross Merchandise Value (GMV) of approximately $7.1 billion, representing 8% YoY growth; Marketplace dealer volume growth of 9% YoY.\n• Co issues downside guidance for FY26, sees EPS of $1.24-1.38, excluding non-recurring items, vs. $1.40 FactSet Consensus.Adjusted EBITDA $350 - $370 mln.\n• Adjusted EBITDA $350 - $370 mln."},{"time":"07:03","ticker":"KALV","headline":"KalVista Pharmaceuticals announces that the newly published International Guideline on the Diagnosis and Management of Pediatric Patients With Hereditary Angioedema recommends EKTERLY as a first-line therapy for the acute treatment of hereditary angioedema attacks in adolescents aged 12 years and older","body":"Guideline recommends ensuring on-demand treatment is available anytime, anywhere and prioritizes early intervention and rapid self-administration, reinforcing the unique value of EKTERLY."},{"time":"07:03","ticker":"EU","headline":"enCore Energy provides update on expected distribution of verdera common shares to its shareholders","body":"DALLAS, Feb. 18, 2026 /PRNewswire/ - enCore Energy Corp. (NASDAQ: EU) (TSXV: EU) (the \"Company\" or \"enCore\"), America's Clean Energy Company, announced that the Company expects to distribute common shares of Verdera Energy Corp. (\"Verdera\") to its shareholders after the effectiveness of Verdera's resale registration statement and will announce a record date prior to any such distribution.Click here for full release."},{"time":"07:01","ticker":"SUMRX","headline":"Asian Markets Close: Nikkei +1.0%, Hang Seng CLOSED, Shanghai CLOSED","body":"• In economic data: Japan's January trade surplus JPY460 bln (expected deficit of JPY180 bln; last deficit of JPY60 bln). January Imports -2.5% yr/yr (expected 3.0%; last 5.2%) and Exports 16.8% yr/yr (expected 12.0%; last 5.1%) Australia's January MI Leading Index -0.1% m/m (last 0.1%). Q4 Wage Price Index 0.8% qtr/qtr, as expected (last 0.8%); 3.4% yr/yr (last 3.3%) New Zealand's Q4 Input PPI -0.5% qtr/qtr (expected 0.4%; last 0.2%); 0.1% qtr/qtr (expected 0.6%; last 0.6%)\n• Japan's January trade surplus JPY460 bln (expected deficit of JPY180 bln; last deficit of JPY60 bln). January Imports -2.5% yr/yr (expected 3.0%; last 5.2%) and Exports 16.8% yr/yr (expected 12.0%; last 5.1%)\n• Australia's January MI Leading Index -0.1% m/m (last 0.1%). Q4 Wage Price Index 0.8% qtr/qtr, as expected (last 0.8%); 3.4% yr/yr (last 3.3%)\n• New Zealand's Q4 Input PPI -0.5% qtr/qtr (expected 0.4%; last 0.2%); 0.1% qtr/qtr (expected 0.6%; last 0.6%)\n• Japan's Nikkei: +1.0%\n• Hong Kong's Hang Seng: CLOSED\n• China's Shanghai Composite: CLOSED\n• India's Sensex: +0.3%\n• South Korea's Kospi: CLOSED\n• Australia's ASX All Ordinaries: +0.6%\n• USD/JPY: +0.3% to 153.73\n• USD/CNH: +0.1% to 6.8845\n• USD/INR: +0.1% to 90.66"},{"time":"07:01","ticker":"BLCO","headline":"Bausch + Lomb misses by $0.04, beats on revs; guides FY26 revs in-line","body":"• Reports Q4 (Dec) earnings of $0.32 per share, excluding non-recurring items, $0.04 worse than the FactSet Consensus of $0.36; revenues rose 9.8% year/year to $1.41 bln vs the $1.38 bln FactSet Consensus.\n• Adjusted EBITDA excluding Acquired IPR&D was $330 million for the fourth quarter of 2025, as compared to $259 million for the fourth quarter of 2024, an increase of $71 million, primarily due to the contribution of the revenue drivers noted above and operating leverage.\n• Co issues in-line guidance for FY26, sees FY26 revs of $5.375-$5.475 bln vs. $5.39 bln FactSet Consensus. Sees adjusted EBITDA of $1.00-$1.05 bln."},{"time":"06:49","ticker":"SAH","headline":"Sonic Automotive beats by $0.02, misses on revs","body":"• Reports Q4 (Dec) earnings of $1.52 per share, excluding non-recurring items, $0.02 better than the FactSet Consensus of $1.50; revenues fell 0.6% year/year to $3.87 bln vs the $3.94 bln FactSet Consensus.Same store revenue was down 5% and same store gross profit was down 2%.\n• Same store revenue was down 5% and same store gross profit was down 2%."},{"time":"06:49","ticker":"NAK","headline":"Northern Dynasty Minerals provides update on summary judgement case","body":"• Northern Dynasty Minerals (NAK) and its 100%-owned, U.S.-based subsidiary Pebble Limited Partnership announce that the Department of Justice has filed its brief in Alaska Federal Court on February 17, 2026.\n• \"We find it surprising that despite the Executive Orders and the many statements made by the administration related to Alaskan development, pro-energy, pro-critical metals, pro-defense and military support, removing roadblocks to permitting, on the need for copper, etc., this EPA would choose to defend the unlawful Obama-Biden veto,\" said Ron Thiessen, Northern Dynasty President and CEO. \"This precedent will be used by future Democratic administrations to reverse all of the progress this administration has made with its pro-energy, pro-mining, pro-development agenda.\"\n• \\\"We are reviewing their filing with our legal team and will have detailed comments once that review is completed in the next few days.\" Mr. Thiessen continued."},{"time":"06:49","ticker":"OSW","headline":"OneSpaWorld misses by $0.02, reports revs in-line; guides Q1 revs above consensus; reaffirms FY26 revs guidance","body":"• Reports Q4 (Dec) earnings of $0.24 per share, excluding non-recurring items, $0.02 worse than the FactSet Consensus of $0.26; revenues rose 11.5% year/year to $242.1 mln vs the $242.64 mln FactSet Consensus.\n• Co issues upside guidance for Q1, sees Q1 revs of $241-$246 mln vs. $233.06 mln FactSet Consensus. Sees Adj EBITDA of $30-$32 mln.\n• Co reaffirms guidance for FY26, sees FY26 revs of $1.01-$1.03 bln vs. $1.02 bln FactSet Consensus. Sees Adj EBITDA of $128-$138 mln."},{"time":"06:48","ticker":"LLY","headline":"Eli Lilly announces \"positive\" topline results from the landmark TOGETHER-PsO open-label Phase 3b clinical trial evaluating the concomitant use of Taltz and Zepbound compared to Taltz alone in adults with moderate-to-severe plaque psoriasis and obesity or overweight with at least one additional weight-related comorbid condition","body":"• At 36 weeks in the TOGETHER-PsO study, concomitant Taltz and Zepbound met primary endpoint of superiority vs. Taltz monotherapy in achieving complete skin clearance (PASI 100) and =10% weight loss.\n• In a key secondary endpoint, patients taking Taltz and Zepbound were 40% more likely to achieve PASI 100 compared to those taking Taltz alone (40.6% of patients vs. 29.0%, p<0.05).\n• Taltz is the first and only psoriatic disease biologic with data from two trials supporting a potential comprehensive treatment approach alongside an incretin therapy for obesity."},{"time":"06:47","ticker":"MRK","headline":"Merck and Mayo Clinic announce a research and development agreement to apply artificial intelligence, advanced analytics and multimodal clinical data to support drug discovery and development","body":"The agreement integrates Mayo Clinic's Platform architecture as well as clinical and genomic datasets with Merck's ambition to harness AI-enabled virtual cell technologies to enhance disease understanding, improve target identification and drive early development decisions."},{"time":"06:46","ticker":"DINO","headline":"HF Sinclair announces the formation of Green Trail Fuels, a new joint venture with UPOP Holdings , in which HF Sinclair will hold a 50% non-operating economic interest","body":"• As part of the joint venture, HF Sinclair will supply fuel from its proximate regional refineries, strengthening the company's branded marketing footprint in the Rockies and Southwest regions.\n• Green Trail Fuels is expected to: Accelerate growth of Sinclair-branded locations through incremental branded retail sites.Create operational and logistics synergies with HF Sinclair's existing midstream and refining assets.Provide a scalable platform for future growth opportunities that augment its existing wholesale network and are aligned with HF Sinclair's disciplined growth strategy.Provide exposure to additional margin streams through the partnership.\n• Accelerate growth of Sinclair-branded locations through incremental branded retail sites.\n• Create operational and logistics synergies with HF Sinclair's existing midstream and refining assets.\n• Provide a scalable platform for future growth opportunities that augment its existing wholesale network and are aligned with HF Sinclair's disciplined growth strategy.\n• Provide exposure to additional margin streams through the partnership."},{"time":"06:39","ticker":"FIGR","headline":"Figure Technology Solutions announces the pricing and upsizing of a secondary public offering of 4,375,000 shares of its Series A Blockchain Common Stock, representing an increase of 145,000 shares from the initial offering size, at a public offering price of $32.00/share","body":""},{"time":"06:35","ticker":"DINO","headline":"HF Sinclair beats by $0.75, beats on revs; CEO to take voluntary leave","body":"• Reports Q4 (Dec) earnings of $1.20 per share, excluding non-recurring items, $0.75 better than the FactSet Consensus of $0.45; revenues fell 0.6% year/year to $6.46 bln vs the $6.04 bln FactSet Consensus.\n• Board Chair Franklin Myers to assume CEO role on a temporary basis during voluntary leave of CEO Tim Go."},{"time":"06:35","ticker":"CNK","headline":"Cinemark misses by $0.10, reports revs in-line","body":"• Reports Q4 (Dec) earnings of $0.16 per share, $0.10 worse than the FactSet Consensus of $0.26; revenues fell 4.7% year/year to $776.3 mln vs the $774.43 mln FactSet Consensus.\n• On February 17, 2026, Cinemark Holdings, Inc.'s board of directors declared a quarterly cash dividend of $0.09 per share of common stock. The quarterly dividend will be payable on March 17, 2026 to shareholders of record as of March 3, 2026."},{"time":"06:35","ticker":"TNL","headline":"Travel + Leisure Co beats by $0.02, beats on revs, Approves new $750 mln share repurchase authorization","body":"• Reports Q4 (Dec) earnings of $1.83 per share, excluding non-recurring items, $0.02 better than the FactSet Consensus of $1.81; revenues rose 5.7% year/year to $1.03 bln vs the $1 bln FactSet Consensus.\n• The company's Board of Directors approved a new $750 million share repurchase authorization.\n• 1Q26 Outlook: Adjusted EBITDA to range from $210 million to $220 million. Gross VOI sales of $520 million to $540 million. VPG of $3,200 to $3,250.\n• FY26 Outlook: Adjusted EBITDA to range from $1,030 million to $1,055 million; Gross VOI sales of $2.5 billion to $2.6 billion; VPG of $3,175 to $3,275."},{"time":"06:32","ticker":"EPRT","headline":"Essential Properties Realty Trust announces the pricing of an upsized underwritten public offering of 10,869,565 shares of its common stock, all of which are being offered in connection with the forward sale agreements, at a public offering price of $32.20/share","body":""},{"time":"06:31","ticker":"SCANX","headline":"Early premarket gappers","body":"• Gapping up: TCMD +23.1%, GLBE +21.4%, RSI +20.1%, PBI +8.6%, GSHD +8.6%, WTTR +8.1%, SSRM +7.9%, FDP +6.9%, CE +6.7%, CSTM +6.6%, USNA +6.5%, SMX +6.4%, AMRZ +5.7%, RBA +5.5%, CDNS +5.2%, ANDE +4.6%, HL +4.3%, NYT +3.3%, ATRC +3.2%, OVV +3.1%, STLD +3.1%, NNE +3%, WDC +2.5%, AGI +2.4%, CZR +2.4%, OGI +2.4%, HQY +2%, TFII +2%, IAG +2%, TLX +1.9%, ESI +1.8%, ADI +1.6%, NVDA +1.6%, DRS +1.6%, AMZN +1.6%, AA +1.4%, HAL +1.2%, VYX +1.1%, LSCC +1%, SFNC +1%\n• TCMD +23.1%, GLBE +21.4%, RSI +20.1%, PBI +8.6%, GSHD +8.6%, WTTR +8.1%, SSRM +7.9%, FDP +6.9%, CE +6.7%, CSTM +6.6%, USNA +6.5%, SMX +6.4%, AMRZ +5.7%, RBA +5.5%, CDNS +5.2%, ANDE +4.6%, HL +4.3%, NYT +3.3%, ATRC +3.2%, OVV +3.1%, STLD +3.1%, NNE +3%, WDC +2.5%, AGI +2.4%, CZR +2.4%, OGI +2.4%, HQY +2%, TFII +2%, IAG +2%, TLX +1.9%, ESI +1.8%, ADI +1.6%, NVDA +1.6%, DRS +1.6%, AMZN +1.6%, AA +1.4%, HAL +1.2%, VYX +1.1%, LSCC +1%, SFNC +1%\n• Gapping down: SMWB -20.3%, ACLS -13.3%, FVRR -12.4%, APLD -8%, LZB -8%, QUAD -7.6%, CMPS -7.5%, MKSI -7.5%, PANW -6.7%, CAMT -4.5%, ICL -4%, ANET -3%, POR -3%, HUN -2.8%, WPC -2.6%, GNK -2.4%, SNDK -2.3%, ITRG -2.3%, OGE -2.3%, COHU -1.9%, RSG -1.9%, TRTX -1.9%, GTY -1.7%, TKR -1%\n• SMWB -20.3%, ACLS -13.3%, FVRR -12.4%, APLD -8%, LZB -8%, QUAD -7.6%, CMPS -7.5%, MKSI -7.5%, PANW -6.7%, CAMT -4.5%, ICL -4%, ANET -3%, POR -3%, HUN -2.8%, WPC -2.6%, GNK -2.4%, SNDK -2.3%, ITRG -2.3%, OGE -2.3%, COHU -1.9%, RSG -1.9%, TRTX -1.9%, GTY -1.7%, TKR -1%"},{"time":"06:31","ticker":"DINO","headline":"HF Sinclair announced that, on February 17, 2026, the Board of Directors of HF Sinclair received a request from Mr. Tim Go, the Company's Chief Executive Officer and President, and a member of the Board, to take a voluntary leave of absence from his duties","body":"The Board has accepted the request and, in a special meeting, elected the current Chairperson of the Board, Mr. Franklin Myers, as Chief Executive Officer and President of the Company on a temporary basis. The Board has directed the Nominating, Governance and Social Responsibility Committee of the Board to commence a process to determine what future actions, whether interim or otherwise, should be taken in relation to the position of Chief Executive Officer and President."},{"time":"06:14","ticker":"CAMT","headline":"Camtek misses by $0.01, reports revs in-line","body":"• Reports Q4 (Dec) earnings of $0.81 per share, excluding non-recurring items, $0.01 worse than the FactSet Consensus of $0.82; revenues rose 9.2% year/year to $128.12 mln vs the $127.24 mln FactSet Consensus."},{"time":"06:13","ticker":"BVN","headline":"Buenaventura announces fourth quarter 2025 results for production and volume sold per metal","body":"Compaa de Minas Buenaventura S.A.A. (\"Buenaventura\" or \"the Company\") (NYSE: BVN; Lima Stock Exchange: BUE.LM), Peru's largest publicly-traded precious metals mining company, today announced 4Q25 results for production and volume sold.Click here for full release."},{"time":"06:12","ticker":"IAG","headline":"IAMGOLD beats on top and bottom lines","body":"• Reports Q4 EPS of $0.70 vs $0.59 FactSet consensus; revs of $1.09 bln va $1.05 bln consensus\n• Attributable gold production for the fourth quarter was 242,400 ounces and 765,900 ounces for the year, achieving the mid-point of the Company's 2025 production guidance of 735,000 to 820,000 ounces, following record quarterly production at all of its operations, including at Ct Gold which achieved the top end of its guidance target.Ct produced a record 87,200 attributable ounces (124,600 ounces | 100%) in the fourth quarter, and 279,900 attributable ounces (399,800 ounces | 100%) for the full year, achieving the top end of the attributable 2025 production guidance range of 250,000 to 280,000 ounces (360,000 to 400,000 ounces | 100%).Westwood produced a record 37,900 ounces in the fourth quarter and 113,900 ounces for the full year, below the bottom end of the 2025 guidance range of 125,000 to 140,000 ounces.Essakane produced 117,300 attributable ounces (a record 138,100 ounces | 100%) in the fourth quarter and 372,100 attributable ounces (427,200 ounces | 100%) for the full year, exceeding the mid-point of the production guidance range on a 100% basis.\n• Ct produced a record 87,200 attributable ounces (124,600 ounces | 100%) in the fourth quarter, and 279,900 attributable ounces (399,800 ounces | 100%) for the full year, achieving the top end of the attributable 2025 production guidance range of 250,000 to 280,000 ounces (360,000 to 400,000 ounces | 100%).\n• Westwood produced a record 37,900 ounces in the fourth quarter and 113,900 ounces for the full year, below the bottom end of the 2025 guidance range of 125,000 to 140,000 ounces.\n• Essakane produced 117,300 attributable ounces (a record 138,100 ounces | 100%) in the fourth quarter and 372,100 attributable ounces (427,200 ounces | 100%) for the full year, exceeding the mid-point of the production guidance range on a 100% basis.\n• 2026 OutlookTotal attributable production for IAMGOLD in 2026 is expected to be in the range of 720,000 to 820,000 ounces, as operations at Ct Gold focus on sustainable operations at nameplate operating rates ahead of the technical report outlining the expansion plans which is expected to be announced in the fourth quarter 2026.Cash costs, excluding royalties, are expected to average $1,100 to $1,250 per ounce sold. With the current strong gold price environment, royalties account for an average of approximately $325 per ounce sold - based on a gold price assumption for 2026 of $4,000 per ounce. Cash costs1, including royalties, are expected to average $1,425 to $1,575 per ounce sold.\n• Total attributable production for IAMGOLD in 2026 is expected to be in the range of 720,000 to 820,000 ounces, as operations at Ct Gold focus on sustainable operations at nameplate operating rates ahead of the technical report outlining the expansion plans which is expected to be announced in the fourth quarter 2026.\n• Cash costs, excluding royalties, are expected to average $1,100 to $1,250 per ounce sold. With the current strong gold price environment, royalties account for an average of approximately $325 per ounce sold - based on a gold price assumption for 2026 of $4,000 per ounce. Cash costs1, including royalties, are expected to average $1,425 to $1,575 per ounce sold."},{"time":"06:11","ticker":"PSNY","headline":"Polestar Automotive Holding UK PLC announces the largest model offensive in its history, with four new cars planned in the next three years","body":"• The Company also announced that with a disciplined approach, in 2026 it expects low double-digit volume growth and a continued retail network expansion of 30%.\n• Polestar 5 to start deliveries in summer, followed by a new variant of Polestar 4 in Q4 of 2026.\n• Completely new successor of the iconic Polestar 2 in 2027 and compact SUV Polestar 7 in 2028.\n• Michael Lohscheller, Polestar CEO: \"Polestar continues to challenge the automotive industry, now by entering fast-growing and high value segments in record speed.\""},{"time":"06:10","ticker":"KBR","headline":"KBR announces a strategic 10-year general maintenance services contract, with an optional two-year extension, covering Petro Rabigh Polymer I and Polymer II plants at Rabigh in the Kingdom of Saudi Ar","body":"• Under the agreement, KBR, through its local joint venture subsidiary KBR Al Yusr, will deliver a comprehensive, digitally-enabled maintenance program encompassing preventive, predictive, corrective, and cycled shutdowns maintenance services. The scope will be supported by KBR's AI/ML-driven digital accelerators and reliability frameworks, designed to enhance asset reliability, improve availability, strengthen safety performance, and drive sustainable OPEX optimization.\n• This collaboration represents a significant milestone in Petro Rabigh's ongoing business transformation, marking the company's first large-scale outsourcing of maintenance services. The program is intended to support a structured change-management journey while maintaining a strong focus on safety, risk mitigation, and long-term operational excellence. Together, the companies aim to achieve top-quartile plant performance while embedding continuous improvement across maintenance and reliability practices."},{"time":"06:06","ticker":"HYMC","headline":"Hycroft Mining delivers 55% growth in mineral resources","body":"• Co is pleased to announce that it has filed a third-party, independent Technical Report updating its Mineral Resource estimate with an effective date as of January 21, 2026. Diane R. Garrett, President and Chief Executive Officer, commented: \"Today's updated MRE reflects approximately 55% growth in both gold and silver Measured and Indicated Mineral Resources, and increases in Inferred Mineral Resources of 50% for gold and 38% for silver representing an impressive resource growth in what is already among the world's largest precious metals deposits.\"\n• Ms. Garrett continued, \"Importantly, following only approximately 14 months of drilling since the discovery of two new high-grade silver systems, a high-grade mineral resource with underground potential has been established demonstrating the continuity of both the Brimstone and Vortex high-grade systems which remain open along strike and at depth.\"\n• The growth in overall mineral resources and the establishment of the high-grade mineral resource with underground potential reflect a combination of improved metallurgical performance, results from 70 drill holes, geologic modeling based on new interpretations, and commodity price assumptions. The MRE is based on a flowsheet utilizing milling and pressure oxidation (\"POX\") for sulfide and certain transition mineralization and heap leaching process for oxide and other transition mineralization.\n• 16.4 million gold ounces / 562.6 million silver ounces (M+I).\n• Initial High-Grade Silver Resource: 90.2 million silver ounces (M+I).\n• Metallurgy Demonstrates Robust Recoveries (83% gold, 78% silver)."},{"time":"06:05","ticker":"GLBE","headline":"Global-E Online misses by $0.01, beats on revs; guides Q1 revs above consensus; guides FY26 revs above consensus","body":"• Reports Q4 (Dec) earnings of $0.30 per share, excluding non-recurring items, $0.01 worse than the FactSet Consensus of $0.31; revenues rose 28.0% year/year to $336.66 mln vs the $327.99 mln FactSet Consensus.\n• Co issues upside guidance for Q1, sees Q1 revs of $247 mln to $254 mln vs. $231.65 mln FactSet Consensus.\n• Co issues upside guidance for FY26, sees FY26 revs of $1.211 bln to $1.271 bln vs. $1.18 bln FactSet Consensus."},{"time":"06:04","ticker":"OGI","headline":"Organigram Global to acquire all the issued and outstanding shares of Sanity Group GmbH not currently owned by Organigram","body":"• Upon closing of the Acquisition, Organigram will pay shareholders of Sanity upfront consideration of 113.4 million consisting of 80.0 million cash and share consideration of 33.4 million in Organigram shares.\n• In addition, the Vendors will be entitled to receive consideration of up to 113.8 million, with the first 20 million in cash and up to 93.8 million in Organigram shares based on Sanity's financial performance for the 12-month period following the closing. The Upfront Consideration shares are expected to be priced at C$3.00 per Organigram share, representing a 71% premium to the C$1.75 closing price on the Toronto Stock Exchange on February 17, 2026. The Earnout Consideration shares shall be priced at the TSX 20-day VWAP on the trading day prior to settlement, subject to a C$3.00 floor and C$4.00 cap.\n• \"The proposed acquisition of Sanity Group marks a pivotal step in Organigram's global expansion strategy as a leader in the rapidly expanding cannabis industry,\" said James Yamanaka, CEO of Organigram. \"This transformational acquisition will bring together two market leaders, extend our commercial footprint into Europe, and strengthen our competitive edge in the world's largest federally legal cannabis markets.\"\n• Acquisition Highlights:Financially accretive acquisition that is expected to bring scale and positively impact both revenue and profitability. Sanity generated positive EBITDA in 2025.Cements Organigram's position as a leader in the growing global cannabis market. Organigram is currently #1 in the Canadian adult use recreational market3, and on closing will become a top company in the rapidly growing German medical cannabis market, the second largest federally legal cannabis market in the world after Canada.Provides Organigram with a vertically integrated European 'hub' and footprint. Will add local leadership, a strong network of strategic partners throughout the value chain across Europe as well as commercial, operational, medical and regulatory expertise.Sanity Group operates Europe's first two legal cannabis specialty stores as part of scientific pilot projects in Switzerland. Pilot project experience also enhances credibility for future pilot projects, including in Germany.Provides Organigram the opportunity to bring its industry leading brands and IP to new markets globally. The combination of both teams, with the support of the Product Development Collaboration generated IP, is expected to deliver a suite of next generation cannabis innovations, backed by science, to European medical markets.\n• Financially accretive acquisition that is expected to bring scale and positively impact both revenue and profitability. Sanity generated positive EBITDA in 2025.\n• Cements Organigram's position as a leader in the growing global cannabis market. Organigram is currently #1 in the Canadian adult use recreational market3, and on closing will become a top company in the rapidly growing German medical cannabis market, the second largest federally legal cannabis market in the world after Canada.\n• Provides Organigram with a vertically integrated European 'hub' and footprint. Will add local leadership, a strong network of strategic partners throughout the value chain across Europe as well as commercial, operational, medical and regulatory expertise.\n• Sanity Group operates Europe's first two legal cannabis specialty stores as part of scientific pilot projects in Switzerland. Pilot project experience also enhances credibility for future pilot projects, including in Germany.\n• Provides Organigram the opportunity to bring its industry leading brands and IP to new markets globally. The combination of both teams, with the support of the Product Development Collaboration generated IP, is expected to deliver a suite of next generation cannabis innovations, backed by science, to European medical markets.\n• Pursuant to the Purchase Agreement, Organigram will indirectly acquire of all the issued and outstanding shares of Sanity Group not currently owned by Organigram. Total Upfront Consideration is 113.4 million (C$183.7 million), consisting of 80 million (C$129.6 million) in cash[1] and 33.4 million (C$54.1 million) in Organigram shares. In addition, the Vendors will be entitled to receive the Earnout Consideration. The Upfront Consideration shares will be priced at C$3.00 per Organigram share, a 71% premium to the C$1.75 closing price on the TSX on February 17, 2026 and the Earnout Consideration shares shall be priced at the TSX 20-day VWAP on the trading day prior to settlement subject to a C$3.00 floor and C$4.00 cap."},{"time":"06:00","ticker":"SUMRX","headline":"Overnight Summary -- Risk appetite returns with S&amp;P breaking higher as Europe and Japan advance","body":"• U.S. futures are ripping higher into the midweek session, with the S&P trading well above fair value as investors pivot from a muted tape to a data-heavy stretch packed with earnings and fresh inflation signals. Risk appetite strengthens globally as Europe rallies, Japan advances, and precious metals catch a bid amid shifting rate expectations. The S&P is up about 38 points, trading around 6898. Buyers engaged quickly in the after-hours, with the low set at 6848.75, confirming 6850 as the breakout/support area. The market marched steadily higher and is currently flirting with 6900, with 6904 representing the high.\n• Asian markets advanced in thin holiday trading on Wednesday as easing geopolitical tensions and supportive economic signals lifted sentiment across the region. Japan led gains, with the Nikkei 225 rising 1.02% to 57,143.84 after data showed a smaller-than-expected January trade deficit, surging exports, and improved business confidence, while news of a $36 billion tranche of Japan's pledged U.S. investment added to optimism. Trading volumes were light with mainland China, Hong Kong, and South Korea closed for the Lunar New Year, leaving broader regional participation muted. Meanwhile, the Reserve Bank of New Zealand reinforced its accommodative stance after holding rates steady. Additionally, a firmer U.S. dollar ahead of key data and Fed minutes shaped currency and commodity moves across the region.\n• European equities trade higher as easing geopolitical tensions and reports of a potential early departure by ECB President Christine Lagarde buoy sentiment. The FTSE 100 gains support despite softer U.K. inflation data, with CPI easing to 3.0% in January, reinforcing expectations for a possible Bank of England rate cut as soon as March. The DAX and CAC 40 also push higher as French inflation cools to 0.4% year-over-year and investors rotate through earnings-driven moves. BAE Systems and Glencore advance in London, while Straumann rallies on strong guidance, offsetting weakness in Carrefour after a profit decline.\n• S&P Futures vs Fair Value: +40.0\n• 10 yr Note: 4.074%\n• USD/JPY: 153.73 +0.45\n• EUR/USD: 1.1838 -0.0018\n• Europe: FTSE: +0.9% DAX: +0.8% CAC: +0.5%\n• Asia: Hang Seng: CLOSED Shanghai: CLOSED Nikkei: +1.0%\n• Gold (4941.90 +36.00) Silver (75.985 +2.445) Crude (62.65 +0.32)"},{"time":"05:52","ticker":"","headline":"S&P futures vs fair value: +40.00. Nasdaq futures vs fair value: +153.00.","body":""},{"time":"05:52","ticker":"","headline":"European Markets","body":"FTSE...10660.43...+104.30...+1.00%. DAX...25196.63...+198.20...+0.80%."},{"time":"05:52","ticker":"","headline":"Asian Markets","body":"Nikkei...57143.84...+577.40...+1.00%. Hang Seng...Holiday........."},{"time":"05:33","ticker":"WIRES","headline":"On The Wires","body":"• Aitech and Teledyne (TDY) e2v Semiconductors are proud to highlight their continued collaboration in advancing space-grade computing. Through their ongoing partnership, Teledyne e2v's high-reliability semiconductors are being integrated into Aitech's SP1, a radiation-tolerant 3U SpaceVPX single-board computer. Designed for deployment in LEO, GEO, lunar, and deep space missions, the SP1 is a robust computing platform tailored for spacecraft and payload systems requiring high-performance edge processing, onboard analysis, and mission adaptability. At its core, the SP1 leverages Teledyne e2v's QLS1046-Space system-on-chip, offering advanced processing in a compact, space-qualified form factor. Its multi-core architecture and high-bandwidth memory enable AI-based algorithms for onboard analysis and autonomous decision-making.\n• Willis, a WTW business, (WTW), announced the launch of its Reputational Risk Quantification Model for celebrity endorsement. Powered by rich datasets from Polecat, the model quantifies the reputational risk associated with celebrity endorsers and brand ambassadors.\n• Endava (DAVA) announced a significant expansion of its partnership with Cognition to help enterprises safely scale agentic software delivery and accelerate business outcomes. The move extends Endava's ability to deliver enterprise-grade, AI-native engineering for clients by broadening access to Cognition's Windsurf and Devin platforms, as a core enabler of the company's Dava.Flow delivery framework. The partnership is designed to improve the client experience of AI-assisted delivery; helping organisations move beyond isolated experimentation to consistent, assured execution across complex programs.\n• DHT Holdings, Inc. (DHT) announced it has entered into a one-year time charter agreement at $90,000 per day for the VLCC DHT Opal, built in 2012. The contract is expected to commence in February 2026 and has been concluded with a global energy company.\n• MakeMyTrip (MMYT) announced that it will collaborate with OpenAI to deepen AI-led travel discovery and capture high-intent travel queries. As part of this collaboration, MakeMyTrip uses OpenAI's APIs to power new AI features in its app, enabling travellers to seamlessly move from conversational inspiration to booking within the MakeMyTrip's Myra interface. This integration positions MakeMyTrip at the centre of AI-driven travel planning journeys. The collaboration strengthens MakeMyTrip's ability to respond dynamically to evolving travel intent, delivering structured, transaction-ready options across flights, hotels and ancillary services. It marks a shift from passive search visibility to active participation in AI-led discovery, translating conversational intent into bookable outcomes."},{"time":"05:01","ticker":"SDZNY","headline":"Sandoz secures expanded FDA approval for Enzeevu in retinal diseases","body":"• Sandoz received FDA approval to expand Enzeevu (aflibercept-abzv) labeling to include RVO, DR and DME, in addition to previously approved wet AMD.\n• The decision broadens Enzeevu's addressable U.S. retinal market, positioning it as a biosimilar alternative across multiple high-prevalence ophthalmology indications.\n• Enzeevu is expected to launch in the U.S. in Q4 2026, or earlier under certain conditions, supporting Sandoz's biosimilars growth strategy."},{"time":"04:59","ticker":"IAG","headline":"IAMGOLD updates reserves and resources; M&amp;I ounces rise 16%","body":"• IAMGOLD reported Proven and Probable reserves of 9.9 mln oz (7.5 mln oz attributable), down 7% yr/yr due to depletion at Ct Gold and Essakane, partly offset by gains at Westwood.\n• Measured and Indicated resources increased 16% to 31.0 mln oz (24.6 mln oz attributable), driven by conversions at Ct (Gosselin) and Nelligan and the addition of Philibert and Chevrier.\n• Inferred resources declined 2% to 12.5 mln oz (11.3 mln oz attributable), while updated reserve gold price assumptions were set at $2,000/oz for Westwood and Essakane and $1,700/oz for Ct Gold."},{"time":"04:54","ticker":"ESLT","headline":"Elbit Systems wins $277 mln turret and munitions orders","body":"• Elbit Systems secured contracts totaling approximately $277 mln from an international customer to supply 30mm turrets and related munitions.\n• The contracts will be performed over three years, adding to the Company's multi-year defense revenue visibility.\n• The award covers UT30MK2 turret systems, configurable for manned or unmanned operation and designed for armored personnel carriers."},{"time":"04:36","ticker":"SNDK","headline":"Sandisk prices secondary offering by Western Digital Corporation (WDC) of 5,821,135 shares of its common stock at $545.00 per share","body":"• Sandisk Corporation announced the pricing of a secondary public offering of 5,821,135 shares of its common stock currently owned by Western Digital Corporation, the Company's former parent (WDC). The SNDK Shares will be offered at a public offering price of $545.00 per share. Sandisk is not selling any shares of common stock and will not receive any proceeds from the sale of the SNDK Shares in the Offering or from the debt-for-equity exchange."},{"time":"04:33","ticker":"WIRES","headline":"On The Wires","body":"• Empire State Realty Trust, Inc. (ESRT) announced that it signed long-term renewal leases with TJ Maxx and JP Morgan Chase Bank for retail spaces for 46,437 and 21,683 square feet, respectively. TJ Maxx signed a renewal lease for its 46,437 square foot space at 250 W. 57th Street in Q4 2025. Richard Skulnik of RIPCO represented TJ Maxx in the lease negotiations. JP Morgan Chase Bank signed a renewal lease for its 21,683 square foot space at One Grand Central Place in Q1 2026. Michael O'Neill of Cushman & Wakefield represented JP Morgan Chase Bank in the lease negotiations.\n• Sompo Group, a Japanese insurance and reinsurance company, and Guidewire (GWRE) announced a long-term agreement supporting Sompo's global adoption of Guidewire Cloud Platform applications and tools. The partnership will unify decision-making across Sompo's local and country-specific entities, enabling them to migrate existing Guidewire applications from on-premises environments and implement new solutions directly on Guidewire Cloud Platform. Under the new agreement, Sompo will leverage Guidewire to optimize operations, and increase the power and reach of decision making across its lines of business.\n• Westlake Corporation (WLK) announced that Westlake Epoxy will expand its long-standing distribution relationship with Brenntag to South and West India. The agreement builds on a successful collaboration across Europe, North and South America, and Southeast Asia, extending Westlake Epoxy's reach into one of the world's fastest-growing coatings, adhesives and construction markets. Under the expanded collaboration, Brenntag will distribute Westlake Epoxy's established portfolio of epoxy solutions for coatings, adhesives and construction applications, including the EPON, EPIKOTE, EPIKURE and EPI-REZ product lines. Customers are expected to benefit from reliable local supply, technical service and application-focused formulation support tailored to regional requirements.\n• Ericsson (ERIC) and Mastercard (MA) announce a collaboration to reshape how money moves across the world. By integrating the Ericsson Fintech Platform with Mastercard Move - Mastercard's portfolio of money movement solutions - the collaboration will empower telecom service providers, banks, and fintechs to expand digital wallet capabilities, launch new payment services, and reach unbanked or underbanked communities. Ericsson's pre-integrated application programming interfaces, cloud-native deployment and compliance-ready infrastructure simplifies fintech connectivity to Mastercard Move."},{"time":"04:32","ticker":"AA","headline":"Alcoa reaches agreement with Australian government on WA mining approvals","body":"• Alcoa agreed with the Australian Federal Government to undertake a Strategic Assessment of its Western Australia mining areas through 2045 under the EPBC Act, modernizing its federal approvals framework.Operations at Huntly and Willowdale mines will continue under a National Interest Exemption, with clearing capped at 800 hectares per year and rehabilitation targeted to reach 1,000 hectares annually by 2027.The Company will pay $36 mln (A$55 mln) under enforceable undertakings tied to historical clearing and expects to record a $19 mln pre-tax charge ($13 mln after tax, or $0.05 per share) in 4Q25.Cash outlays related to the $36 mln provision are expected in 2026; Myara North and Holyoake approvals remain on track with mining anticipated no earlier than 2029.\n• Operations at Huntly and Willowdale mines will continue under a National Interest Exemption, with clearing capped at 800 hectares per year and rehabilitation targeted to reach 1,000 hectares annually by 2027.\n• The Company will pay $36 mln (A$55 mln) under enforceable undertakings tied to historical clearing and expects to record a $19 mln pre-tax charge ($13 mln after tax, or $0.05 per share) in 4Q25.\n• Cash outlays related to the $36 mln provision are expected in 2026; Myara North and Holyoake approvals remain on track with mining anticipated no earlier than 2029."},{"time":"04:30","ticker":"GTY","headline":"Getty Realty Corp. prices offering of 4.0 mln shares of common stock for gross proceeds of $131 mln","body":""},{"time":"04:29","ticker":"POR","headline":"Portland Gen Elec prices offering of 9,467,455 shares of its common stock at $50.70 per share","body":""},{"time":"04:26","ticker":"WPC","headline":"W.P. Carey prices offering of 6.0 mln shares of common stock for gross proceeds of $432 mln","body":""},{"time":"04:25","ticker":"CAT","headline":"Caterpillar completes acquisition of RPMGlobal","body":"• Caterpillar acquired RPMGlobal Holdings, an Australia-based mining software provider, expanding its data-driven mining technology portfolio.RPMGlobal adds mine planning and operational software capabilities across the mining value chain, complementing Caterpillar's equipment and site technology offerings.The Company said the combination is intended to enhance mine site performance and strengthen its integrated mining solutions strategy.RPMGlobal will continue operating under its existing brand; financial terms were not disclosed in the announcement.\n• RPMGlobal adds mine planning and operational software capabilities across the mining value chain, complementing Caterpillar's equipment and site technology offerings.\n• The Company said the combination is intended to enhance mine site performance and strengthen its integrated mining solutions strategy.\n• RPMGlobal will continue operating under its existing brand; financial terms were not disclosed in the announcement."},{"time":"04:17","ticker":"HRL","headline":"Hormel Foods sees Q1 EPS above expectations; reaffirms FY26 EPS guidance","body":"• At the 2026 CAGNY conference, Ettinger will reaffirm the Company's fiscal 2026 organic net sales1 and adjusted diluted earnings per share1 guidance and review key initiatives for success in fiscal 2026. John Ghingo, president, will discuss the Company's unique position in the food industry, and leadership's expectations for achieving its previously announced long-term growth algorithm of 2-3% organic net sales1 growth and 5-7% operating profit growth.\n• Co issues mixed guidance for Q1 (Jan), sees EPS of $0.34, excluding non-recurring items, vs. $0.32 FactSet Consensus; sees Q1 (Jan) revs of ~3 bln vs. $3.07 bln FactSet Consensus.\n• Co reaffirms guidance for FY26 (Oct), sees EPS of $1.43-1.51, excluding non-recurring items, vs. $1.46 FactSet Consensus."},{"time":"04:13","ticker":"HRL","headline":"Hormel Foods to divest whole-bird turkey operations","body":"• Hormel Foods entered into a definitive agreement to sell its whole-bird turkey business to Life-Science Innovations, with closing expected by the end of fiscal Q2 2026.The sale includes the Melrose, Minnesota production facility, Swanville feed mill, transportation assets and related grower supply contracts; the JENNIE-O brand and value-added products are not included.Hormel Foods said the transaction aligns with its strategy to reduce exposure to commodity-driven operations and focus on higher-margin, value-added protein offerings.The Company expects the divestiture to have a minimal impact on adjusted fiscal 2026 results; financial terms were not disclosed.\n• The sale includes the Melrose, Minnesota production facility, Swanville feed mill, transportation assets and related grower supply contracts; the JENNIE-O brand and value-added products are not included.\n• Hormel Foods said the transaction aligns with its strategy to reduce exposure to commodity-driven operations and focus on higher-margin, value-added protein offerings.\n• The Company expects the divestiture to have a minimal impact on adjusted fiscal 2026 results; financial terms were not disclosed."},{"time":"04:10","ticker":"NVS","headline":"Novartis AG's remibrutinib meets Phase III endpoint in chronic inducible urticaria","body":"• Novartis reported its Phase III RemIND trial met the primary endpoint, with oral remibrutinib achieving significantly higher complete response rates versus placebo at Week 12 across three chronic inducible urticaria subtypes.The Company said remibrutinib was well tolerated with a favorable safety profile and no liver safety concerns observed in the study.Novartis has submitted a supplemental NDA to the FDA for symptomatic dermographism and plans additional global regulatory filings in the coming months.If approved, remibrutinib could become the first targeted therapy for chronic inducible urticaria, expanding beyond its existing FDA approval in chronic spontaneous urticaria.\n• The Company said remibrutinib was well tolerated with a favorable safety profile and no liver safety concerns observed in the study.\n• Novartis has submitted a supplemental NDA to the FDA for symptomatic dermographism and plans additional global regulatory filings in the coming months.\n• If approved, remibrutinib could become the first targeted therapy for chronic inducible urticaria, expanding beyond its existing FDA approval in chronic spontaneous urticaria."}],"fetchedAt":1771443195522},"savedAt":1771443195523}