{"data":{"updated":"2/17/2026, 8:35:27 AM","entries":[{"time":"07:51","ticker":"BONDX","headline":"Overnight Treasury Market Summary","body":"• U.S. Treasuries are on track to begin the holiday-shortened week with some early strength in longer tenors while the short end is on course for a flatter start. Treasury futures began climbing in early evening action, continuing their advance into the night. The market reached highs around the start of the European session, followed by some backtracking. Overnight action lacked the participation of several large markets due to Lunar New Year celebrations. Markets in China, Hong Kong, Singapore, and South Korea will remain closed tomorrow with Hong Kong scheduled to reopen on Friday, while China's markets will remain closed until next week. Underwhelming December employment figures from the U.K. boosted expectations for a March rate cut from the Bank of England while rate cuts are also being discussed in the U.S. after Fed Governor Bowman spoke in favor of three cuts in 2026 due to a weakening labor market. Precious metals endured a volatile night while crude oil is on the rise. The U.S. Dollar Index is up 0.3% at 97.24.\n• Yield Check: 2-yr: -1 bp to 3.40% 3-yr: -2 bps to 3.43% 5-yr: -3 bps to 3.58% 10-yr: -3 bps to 4.03% 30-yr: -4 bps to 4.66%\n• 2-yr: -1 bp to 3.40%\n• 3-yr: -2 bps to 3.43%\n• 5-yr: -3 bps to 3.58%\n• 10-yr: -3 bps to 4.03%\n• 30-yr: -4 bps to 4.66%\n• News: Japan's Q4 GDP report, which was released on Sunday evening, disappointed, showing growth of just 0.1% quarter-over-quarter (expected 0.4%) while the year-over-year reading was up 0.2% (expected 1.6%). The report pressured rate hike expectations for March, but the market remains confident that a hike will be announced in April. Sweden's finance minister said that his country has no plans to adopt the euro in the coming years. Japan's December Tertiary Industry Activity Index rose to 8.40 from -2.50. New Zealand's January FPI was up 2.5% m/m (last -0.3%). Eurozone's February ZEW Economic Sentiment fell to 39.4 from 40.8 (expected 45.7). Germany's February ZEW Economic Sentiment rose to 58.3 from 56.9 (expected 65.8) and ZEW Current Conditions rose to -65.9 from -72.7 (expected -65.7). January CPI was up 0.1% m/m, as expected (last 0.0%), rising 2.1% yr/yr, as expected (last 1.8%). U.K.'s December Average Earnings Index + Bonus rose 4.2% yr/yr (expected 4.6%; last 4.6%). December three-month employment increased by 52,000 (last 82,000) and December Unemployment Rate rose to 5.2% from 5.1%, as expected. January Claimant Count increased by 28,600 (expected 22,800; last 2,700). Q3 Labour Productivity was up 1.1% (expected -0.6%; last -0.5%). Italy's December trade surplus reached EUR6.037 bln (expected surplus of EUR4.75 bln; last surplus of EUR5.056 bln).\n• Japan's Q4 GDP report, which was released on Sunday evening, disappointed, showing growth of just 0.1% quarter-over-quarter (expected 0.4%) while the year-over-year reading was up 0.2% (expected 1.6%). The report pressured rate hike expectations for March, but the market remains confident that a hike will be announced in April.\n• Sweden's finance minister said that his country has no plans to adopt the euro in the coming years.\n• Japan's December Tertiary Industry Activity Index rose to 8.40 from -2.50.\n• New Zealand's January FPI was up 2.5% m/m (last -0.3%).\n• Eurozone's February ZEW Economic Sentiment fell to 39.4 from 40.8 (expected 45.7).\n• Germany's February ZEW Economic Sentiment rose to 58.3 from 56.9 (expected 65.8) and ZEW Current Conditions rose to -65.9 from -72.7 (expected -65.7). January CPI was up 0.1% m/m, as expected (last 0.0%), rising 2.1% yr/yr, as expected (last 1.8%).\n• U.K.'s December Average Earnings Index + Bonus rose 4.2% yr/yr (expected 4.6%; last 4.6%). December three-month employment increased by 52,000 (last 82,000) and December Unemployment Rate rose to 5.2% from 5.1%, as expected. January Claimant Count increased by 28,600 (expected 22,800; last 2,700). Q3 Labour Productivity was up 1.1% (expected -0.6%; last -0.5%).\n• Italy's December trade surplus reached EUR6.037 bln (expected surplus of EUR4.75 bln; last surplus of EUR5.056 bln).\n• Commodities: WTI Crude: +1.3% to $63.73/bbl Gold: -1.8% to $4958.00/ozt Copper: -2.1% to $5.680/lb\n• WTI Crude: +1.3% to $63.73/bbl\n• Gold: -1.8% to $4958.00/ozt\n• Copper: -2.1% to $5.680/lb\n• Currencies: EUR/USD: -0.2% to 1.1829 GBP/USD: -0.6% to 1.3549 USD/CNH: +0.1% to 6.8869 USD/JPY: -0.2% to 153.10\n• EUR/USD: -0.2% to 1.1829\n• GBP/USD: -0.6% to 1.3549\n• USD/CNH: +0.1% to 6.8869\n• USD/JPY: -0.2% to 153.10\n• Data out Today: 8:30 ET: February Empire State Manufacturing survey (Briefing.com consensus 7.1; prior 7.7) 10:00 ET: February NAHB Housing Market Index (Briefing.com consensus 38; prior 37)\n• 8:30 ET: February Empire State Manufacturing survey (Briefing.com consensus 7.1; prior 7.7)\n• 10:00 ET: February NAHB Housing Market Index (Briefing.com consensus 38; prior 37)"},{"time":"07:51","ticker":"INFY","headline":"Infosys unveils AI first value framework: Uniquely positioned to capture new AI services opportunity of over $300 billion","body":"BENGALURU, India, Feb. 17, 2026 /PRNewswire/ -- Infosys (NSE: INFY) (BSE: INFY) (NYSE: INFY), a global leader in next generation digital services and consulting, today unveiled its AI first value framework to help global enterprises unlock AI value at scale, harnessing the power of its industry-leading generative and agentic AI suite, Infosys Topaz. This move opens a new frontier in IT services and will enable the company to tap into an incremental AI first services opportunity of USD 300-400 billion by 2030, according to a recent Nasscom - McKinsey Report.Click here for full release."},{"time":"07:49","ticker":"","headline":"European Markets","body":"FTSE...10511.63...+37.90...+0.40%. DAX...24832.34...+31.40...+0.10%."},{"time":"07:49","ticker":"","headline":"Asian Markets","body":"Nikkei...56566.49...-239.90...-0.40%. Hang Seng...Holiday........."},{"time":"07:48","ticker":"","headline":"S&P futures vs fair value: -28.00. Nasdaq futures vs fair value: -198.00.","body":""},{"time":"07:46","ticker":"DSNKY","headline":"Daiichi Sankyo: BostonGene announces a strategic collaboration with Daiichi Sankyo","body":"• The collaboration will integrate AI-driven translational intelligence into the core of an antibody drug conjugate (ADC) development program of Daiichi Sankyo to move beyond standard exploratory biomarker analysis and deliver decision-ready insights that directly inform patient selection strategies, development prioritization and translational positioning.\n• By generating digital twin representations from hundreds of thousands of multiomic and histopathologic patient profiles, BostonGene identifies the precise biological signatures and efficacy-associated mechanisms that distinguish responders from non-responders. This deep molecular mapping will enable the collaboration to define unique molecular subgroups by benchmarking the investigational medicine relative to approved treatments and existing standards of care. Additionally, these analyses will help enable clear asset differentiation by identifying unique therapeutic profiles and biological advantages. The platform also provides actionable insights into resistance pathways and the tumor microenvironment necessary to optimize future trial design and clinical positioning."},{"time":"07:41","ticker":"WIRES","headline":"On The Wires","body":"• Descartes Systems Group (DSGX) announces that Tennessee-based third-party logistics provider Vesta Freight is using Descartes transportation management suite to transform its nationwide freight operations and drive 18x growth in monthly shipment volume. By automating and synchronizing transportation management processes to streamline the movement of freight, Vesta elevated its customer and carrier experience, accelerated revenue cycles and reduced fraud exposure.\n• Janux Therapeutics (JANX) announces that the first participant has been dosed in a Phase 1 clinical study of JANX011, a CD19-targeted bispecific engineered using the company's proprietary Adaptive Immune Response Modulator platform. JANX011 is being developed for autoimmune diseases and is designed to enable deep and durable immune reset through targeted depletion of CD19-expressing B cells in blood and tissue.\n• Classiq, Comcast (CMCSA) and AMD (AMD) announce the completion of a groundbreaking trial aimed at improving Internet delivery by leveraging quantum algorithms to supercharge network routing resilience.\n• Gilat Satellite Networks Ltd. (GILT) announces that its defense division, Gilat Defense, has been awarded a contract valued $9 million by Israel's Ministry of Defense for the delivery and integration of satellite communication systems and services.\n• AllianceBernstein Holding L.P. (AB) and AllianceBernstein L.P. has selected global financial technology company SimCorp as its core investment technology partner."},{"time":"07:39","ticker":"HKD","headline":"AMTD Digital Inc., AMTD Group Inc., AMTD IDEA Group (AMTD) and The Generation Essentials Group (TGE) jointly announce that TGE's latest movie, \"Scare Out\", has delivered an outstanding performance at the pre-sale stage, surpassing US$14.5 mln in box office as of one day before its official debut today","body":"This is one of the two movies in China's Lunar New Year lineup to cross the RMB100 million milestone for pre-sales and firmly cements its position among the top three box-office forecasts for the holiday season."},{"time":"07:36","ticker":"HELP","headline":"Helus Pharma publishes Helus pharma's randomized, placebo-controlled phase 2a trial of SPL026 in major depressive disorder","body":"• Randomized, placebo-controlled Phase 2a study of SPL026 met its primary endpoint demonstrating a clinically significant reduction in depressive symptoms as measured by MADRS score (mean difference: -7.35) versus placebo at two weeks\n• Antidepressant treatment effects observed within one week and sustained for up to three months\n• Findings reinforce the therapeutic potential of short-acting serotonergic agonists and inform Helus Pharma's HLP004 development program, with Phase 2 topline data in generalized anxiety disorder (\"GAD\") expected in Q1 2026"},{"time":"07:36","ticker":"CYTK","headline":"Cytokinetics announces that the European Commission has approved MYQORZO (aficamten), 5 mg, 10 mg, 15 mg and 20 mg tablets for the treatment of symptomatic (New York Heart Association, NYHA, class II-III) obstructive hypertrophic cardiomyopathy in adult patients","body":"• European commission approval based on results of SEQUOIA-HCM.\n• First european launch expected in Germany in Q2 2026."},{"time":"07:36","ticker":"VMAR","headline":"Vision Marine Technologies together with its recently acquired retail network, Nautical Ventures, has established a new floor plan financing program with Yamaha Motor Finance Corporation, U.S.A. across its wholly owned marine dealership network, Nautical Ventures Group Inc.","body":"• This program represents a significant operational milestone following Vision Marine's acquisition of Nautical Ventures in June 2025 and marks an important first step in rebuilding the financing infrastructure necessary to support the Company's continued execution on integrating financing, inventory management, and OEM relationships across its expanded retail platform.\n• The Yamaha Financial Services floor plan will enable Nautical Ventures to expand the availability of Yamaha-powered boats and products across its Florida dealership footprint, while enhancing the purchasing experience for customers through additional flexibility and financing options at the point of sale."},{"time":"07:35","ticker":"BWAY","headline":"Brainsway announces change in ADS-to-ordinary share ratio","body":"• Co announced that its Board of Directors approved a plan to change to the ratio of its American Depositary Shares listed on the Nasdaq Capital Market (\"NASDAQ\") relative to its ordinary shares traded on the Tel Aviv Stock Exchange. The Company's Board of Directors believes that aligning the ADS ratio with the ordinary share will simplify the Company's capital structure and provide investors with a clearer basis for assessing the Company's valuation.\n• The Company will adjust its current 2-to-1 ordinary share-to-ADS ratio to a new 1-to-1 structure, effective March 3, 2026. As a result of this change, each existing ADS holder will receive one additional ADS for each ADS held. This ratio change will have the same effect as a 2-for-1 forward split of the ADSs. The Company's ADSs will continue to trade on the NASDAQ under the symbol \"BWAY,\" and its ordinary shares, which will not be affected by the ratio change, will continue to trade on the Tel Aviv Stock Exchange."},{"time":"07:35","ticker":"ASPI","headline":"ASP Isotopes announces its plans for Quantum Leap Energy, a wholly-owned subsidiary of ASPI dedicated to advancing innovative technologies and processes across critical segments of the fission and fusion nuclear fuel cycle, to establish QLE's new global corporate headquarters in Austin, Texas, strengthening its presence in Texas and strategically positioning the Company to better serve its United States customer base","body":"• In addition to the planned global corporate headquarters, QLE intends to build a significant operational presence in Texas, with QLE's management focused on working with Fermi America to implement the joint venture outlined in the Joint Venture Memorandum of Understanding signed by QLE, ASPI and Fermi America last year.\n• The collaboration contemplated by the MOU includes a joint venture between QLE and Fermi America focused on the development of a high-assay-low enriched uranium enrichment research and commercial production facility, alongside ASPI's planned commercial facility for the production of stable isotopes and advanced nuclear materials, both to be affiliated with Fermi America's hypergrid campus in Amarillo, Texas."},{"time":"07:34","ticker":"ELE","headline":"Elemental Royalty Corporation Board of Directors has approved an inaugural dividend policy","body":"In accordance with the Policy, Elemental expects to declare an annual cash dividend to its shareholders of US$0.12 per Elemental common share, to be paid in quarterly instalments of US$0.03 per share, with the record date for the inaugural dividend to be paid at the end of the first calendar quarter of 2026, and at the end of each calendar quarter following for subsequent dividends."},{"time":"07:33","ticker":"BWMN","headline":"Bowman Consulting Group announces retirement plan for Founder and CEO Gary Bowman; Board initiates search process, Mr. Bowman expected to remain CEO until successor appointed","body":"In connection with Mr. Bowman's announcement, the board approved amendments to the employment agreements of Bruce Labovitz, chief financial officer, and Dan Swayze, chief operating officer, to ensure continuity of leadership and a successful transition process."},{"time":"07:32","ticker":"WSO","headline":"Watsco misses by $0.20, misses on revs; Boosts annual dividend 10% to $13.20/share","body":"• Reports Q4 (Dec) earnings of $1.68 per share, $0.20 worse than the FactSet Consensus of $1.88; revenues fell 9.9% year/year to $1.58 bln vs the $1.62 bln FactSet Consensus.\n• Gross profit margin expanded 40 basis-points to 27.1%.\n• Boosts annual dividend 10% to $13.20/share."},{"time":"07:31","ticker":"TGTX","headline":"TG Therapeutics announces the publication of long term/five-year data from the ongoing open-label extension of the Phase 3 ULTIMATE I and II studies evaluating BRIUMVI (ublituximab-xiiy) in adults with relapsing forms of multiple sclerosis","body":"• During year 5 of treatment with BRIUMVI the annualized relapse rate was 0.020, equivalent to one relapse occurring every 50 years of patient treatment.\n• Overall safety profile of BRIUMVI remained consistent over 5 years of continuous treatment, with no new safety signals emerging with prolonged treatment."},{"time":"07:30","ticker":"SUMRX","headline":"European Markets Update: DAX +0.2%, FTSE +0.4%, CAC +0.1%","body":"• In economic data: Eurozone's February ZEW Economic Sentiment 39.4 (expected 45.7; last 40.8) Germany's February ZEW Economic Sentiment 58.3 (expected 65.8; last 56.9) and ZEW Current Conditions -65.9 (expected -65.7; last -72.7). January CPI 0.1% m/m, as expected (last 0.0%); 2.1% yr/yr, as expected (last 1.8%) U.K.'s December Average Earnings Index + Bonus 4.2% yr/yr (expected 4.6%; last 4.6%). December three-month employment change 52,000 (last 82,000) and December Unemployment Rate 5.2%, as expected (last 5.1%). January Claimant Count change 28,600 (expected 22,800; last 2,700). Q3 Labour Productivity 1.1% (expected -0.6%; last -0.5%) Italy's December trade surplus EUR6.037 bln (expected surplus of EUR4.75 bln; last surplus of EUR5.056 bln)\n• Eurozone's February ZEW Economic Sentiment 39.4 (expected 45.7; last 40.8)\n• Germany's February ZEW Economic Sentiment 58.3 (expected 65.8; last 56.9) and ZEW Current Conditions -65.9 (expected -65.7; last -72.7). January CPI 0.1% m/m, as expected (last 0.0%); 2.1% yr/yr, as expected (last 1.8%)\n• U.K.'s December Average Earnings Index + Bonus 4.2% yr/yr (expected 4.6%; last 4.6%). December three-month employment change 52,000 (last 82,000) and December Unemployment Rate 5.2%, as expected (last 5.1%). January Claimant Count change 28,600 (expected 22,800; last 2,700). Q3 Labour Productivity 1.1% (expected -0.6%; last -0.5%)\n• Italy's December trade surplus EUR6.037 bln (expected surplus of EUR4.75 bln; last surplus of EUR5.056 bln)\n• STOXX Europe 600: +0.2%\n• Germany's DAX: +0.2%\n• U.K.'s FTSE 100: +0.4%\n• France's CAC 40: +0.1%\n• Italy's FTSE MIB: +0.7%\n• Spain's IBEX 35: +0.6%\n• EUR/USD: -0.1% to 1.1835\n• GBP/USD: -0.4% to 1.3568\n• USD/CHF: +0.1% to 0.7701"},{"time":"07:26","ticker":"SCANX","headline":"Gapping up/Gapping down","body":"• DTE +28.5%, ENLT +8%, ETOR +6.7%, FLR +6.6%, KNF +3.7%, WAY +3.5%, CEVA +3.4%, NESR +2.7%, LH +2.6%, SON +2.4%, KRYS +2%, RNW +1.9%, SSTK +1%\n• ZIM +35.2% (to be acquired by Hapag-Lloyd for $35 per share in $4.2 bln cash deal)\n• CMPS +23.1% (announces successful achievement of the primary endpoint in the ongoing Phase 3 COMP006 trial)\n• RYI +12.8% (Ryerson and Olympic Steel announce successful closing of merger)\n• KW +9.7% (to be acquired in an all-cash transaction by Fairfax Financial Holdings (FRFHF) and KW Management Group for $10.90/share)\n• NPO +5.2% (increases quarterly cash dividend 3.2% to $0.32/share from $0.31/share)\n• BNC +4.4% (issues statement refuting YZi Labs' latest claims; Confirms BNC is fully compliant with Nasdaq rules for holding the annual meeting)\n• LAD +3.2% (implements shift to align its IT and technology teams more closely)\n• NWG +3.2% (launches 750 mln 2026 share buyback program)\n• NKTR +3.2% (announces research collaboration with UCSF and Dr. Stephen Hauser for NKTR-0165, a Tumor Necrosis Factor Receptor 2 antibody, in multiple sclerosis)\n• GSK +2.5% (receives EU approval for Exdensur in severe asthma and CRSwNP; launches 0.45 bln fourth tranche under 2 bln buyback program)\n• ESLT +1.9% (secures $435 mln in multi-year international defense awards)\n• LUV +2.1% (upgraded to Buy from Neutral at UBS)\n• DLTR +1.8% (upgraded to Buy from Neutral at Rothschild & Co Redburn)\n• ALB +1.2% (upgraded to Buy from Neutral at BofA Securities)\n• ACN +0.9% (upgraded to Overweight from Equal Weight at Wells Fargo)\n• UPST +0.7% (upgraded to Neutral from Sell at Compass Point)\n• WHG -8.3%, GPC -7.2%, VMC -6.9%, SUN -6.7%, AHH -5.5%, SXC -5%, CNH -4.9%, MDT -4.6%, VMI -4.5%, ALLE -4.2%, GIS -3.4% (guidance), HRI -3.1%, LDOS -1.9%, POR -1.8%, LPX -1.4%, IVA -1.3%, SGI -1.3%, USAC -1.3%\n• OCUL -30.6% (topline results from the SOL-1 Phase 3 superiority trial of AXPAXLI, its investigational product candidate, for the treatment of wet age-related macular degeneration)\n• VMC -7.5% (increases quarterly cash dividend to $0.52/share from $0.49/share)\n• WPM -2.3% (production guidance)\n• STEX -1.7% (files prospectus supplement relating to 2,443,750 shares; supplement relates to the resale from time to time by the Selling Stockholder)\n• BBWI -2.4% (downgraded to Neutral from Buy at Citigroup)\n• DG -0.6% (downgraded to Sell from Neutral at Rothschild & Co Redburn)"},{"time":"07:22","ticker":"LU","headline":"Lufax announces changes of directors and senior management","body":"• Mr. Yong Suk Cho will step down as Chief Executive Officer and resign from his position as executive Director of the Board upon the expiration of his contract on March 31, 2026, due to family and personal considerations. The Board has appointed Mr. Xiang Ji, currently the Co-Chief Executive Officer of the Company, as Chief Executive Officer and as an executive Director of the Board, effective April 1, 2026. Mr. Cho will support Mr. Ji in ensuring a smooth transition and handover.\n• Mr. Yonglin Xie =and Ms. Xin Fu will resign from their positions as non-executive Directors of the Board effective February 17, 2026. The Board has appointed Ms. Fangfang Cai and Mr. Peifeng Li as new non-executive Directors, effective February 18, 2026. Mr. Cho, Mr. Xie and Ms. Fu have each confirmed they have no disagreement with the Board and there is no matter that needs to be brought to the attention of the Shareholders.\n• The Company extends its sincere appreciation to Mr. Cho, Mr. Xie and Mr. Fu for their significant contributions during their respective tenures. The Board would like to express its warmest welcome to Ms. Cai, Mr. Li and Mr. Ji on their respective appointment."},{"time":"07:19","ticker":"SAIC","headline":"Science Applications appoints James Reagan to Chief Executive Officer, effective immediately","body":"Mr. Reagan is a seasoned executive, with nearly 40 years of experience, including two decades of senior leadership experience in the defense and government services industry and a significant background in business transformation. During his tenure as Executive Vice President & Chief Financial Officer of Leidos Holdings, a Fortune 500 technology company serving government and commercial customers, he was instrumental in accelerating the company's growth."},{"time":"07:17","ticker":"NFLX","headline":"Netflix: WBD files definitive proxy statement and schedules special meeting for March 20, 2026, to approve the WBD-Netflix Transaction","body":"HOLLYWOOD, Calif., Feb. 17, 2026 /PRNewswire/ -- Netflix, Inc. today issued the following statement regarding its fully financed definitive agreement with Warner Bros. Discovery, Inc. (WBD) to acquire Warner Bros., including its film and television studios, HBO Max and HBO: Click here for full release."},{"time":"07:16","ticker":"THAR","headline":"Tharimmune announces corporate rebrand to Canton Strategic Holdings; New NASDAQ ticker symbol \"CNTN\" to begin trading February 18, 2026","body":"• Effective Wednesday, February 18, 2026, the Company will change its name to Canton Strategic Holdings, Inc. In connection with the name change, the common stock of the Company will begin trading on NASDAQ under the ticker symbol \"CNTN\" prior to market open on February 18, 2026.\n• Company Positioned to support institutional adoption of first privacy-enabled public blockchain processing $9 trillion in monthly transaction volume."},{"time":"07:14","ticker":"OCUL","headline":"Ocular Therapeutix announces positive topline results from the SOL-1 Phase 3 superiority trial of AXPAXLI, its investigational product candidate, for the treatment of wet age-related macular degeneration","body":"• First ever successful demonstration of superiority in an FDA-aligned wet AMD trial comparing a novel investigative agent to an approved anti-VEGF treatment.\n• Superiority primary endpoint met with 74.1% of subjects in the AXPAXLI arm maintaining vision at Week 36, a 17.5% risk difference (p=0.0006), compared to aflibercept (2 mg) arm.\n• 65.9% of subjects treated with AXPAXLI maintained vision at Week 52, a 21.1% risk difference (p<0.0001), compared to aflibercept (2 mg) arm.\n• Rescue-free rates in the AXPAXLI arm were 80.6%, 74.7%, and 68.8% at Weeks 24, 36, and 52.\n• 55.9% of subjects treated with AXPAXLI maintained CSFT within 30 m from baseline at Week 36, a 17.1% risk difference (nominal p=0.0013) compared to aflibercept (2 mg) subjects.\n• 77.1% of AXPAXLI subjects randomized in SOL-1 would have been rescue-free at Week 24 using SOL-R rescue criteria which align closely with clinical practice.\n• AXPAXLI was generally well-tolerated in SOL-1 with no treatment-related ocular SAEs.\n• Subjects have been re-dosed at Week 52.\n• Ocular plans to submit New Drug Application based on SOL-1 data, subject to planned formal discussions with U.S. FDA.\n• Conference call and webcast today, February 17, 2026, at 8:00 AM ET, to discuss topline data.\n• Detailed data to be presented at 49th Macula Society Annual Meeting."},{"time":"07:14","ticker":"TRDA","headline":"Entrada Therapeutics announces that an independent Data Monitoring Committee, per study protocol, has reviewed all available safety and PK data from the eight patients who completed dosing in Cohort 1 of the double-blinded, placebo-controlled, multiple ascending dose portion of ELEVATE-44-201","body":"• Patients in Cohort 1 have progressed to the open label, Phase 2 portion of ELEVATE-44-201.\n• Company on track to report ELEVATE-44-201 Cohort 1 data in Q2 2026, with Cohort 2 data by end of year."},{"time":"07:13","ticker":"MRNA","headline":"Moderna receives European Commission marketing authorization for COVID-19 vaccine mNEXSPIKE","body":"• Co announced that the European Commission (EC) has granted marketing authorization for mNEXSPIKE, a new COVID vaccine, for active immunization to prevent COVID-19 caused by SARS-CoV-2 in individuals aged 12 years and older.\n• This marketing authorization follows the positive opinion adopted by the European Medicines Agency's (EMA) Committee for Medicinal Products for Human Use (CHMP) and marks Moderna's third product authorized in the European Union, alongside Spikevax and mRESVIA, further strengthening the Company's respiratory vaccine portfolio in Europe. The marketing authorization is valid in all 27 European Union Member States, as well as Iceland, Liechtenstein and Norway. Moderna expects to make mNEXSPIKE available in Europe pending regulatory timelines and local market access pathways."},{"time":"07:12","ticker":"DTE","headline":"DTE Energy reports 2025 accomplishments, earnings and investments","body":"DETROIT, Feb. 17, 2026 /PRNewswire/ -- DTE Energy (NYSE: DTE) announced today that it made record capital investments in 2025 of more than $4.3 billion to improve the reliability of its utility infrastructure and generate cleaner energy for its customers. DTE Electric invested over $3.6 billion toward boosting reliability and building cleaner energy generation, while DTE Gas invested $661 million to upgrade its natural gas system. Beyond these investments, DTE secured a landmark agreement to power Oracle's new data center development, which is expected to produce significant affordability benefits for its electric customers and drive economic progress in Michigan.Click here for full release."},{"time":"07:11","ticker":"NEO","headline":"NeoGenomics beats by $0.02, reports revs in-line; guides FY26 revs in-line","body":"• Reports Q4 (Dec) earnings of $0.06 per share, excluding non-recurring items, $0.02 better than the FactSet Consensus of $0.04; revenues rose 10.6% year/year to $190.17 mln vs the $188.6 mln FactSet Consensus.\n• Co issues in-line guidance for FY26, sees FY26 revs of $793-801 mln vs. $796.35 mln FactSet Consensus. Co guides to FY26 adjusted BITDA of $55-57 mln."},{"time":"07:10","ticker":"ITRN","headline":"Ituran Location and Control announces that its smart-mobility platform, IturanMob is partnering with Griiip, a leader in motorsport data analysis","body":"Under this agreement, IturanMob becomes Griiip's official IoT technology provider, enabling real-time data collection and processing of vehicle performance across all motorsport categories."},{"time":"07:09","ticker":"AXSM","headline":"Axsome Therapeutics has entered into a settlement agreement with Alkem Laboratories Ltd. resolving patent litigation related to Axsome's product SUNOSI","body":"The litigation, which is pending in the United States District Court for the District of New Jersey, resulted from submission by Alkem of an Abbreviated New Drug Application to the U.S. Food and Drug Administration seeking approval to market a generic version of SUNOSI in the United States. Under the terms of the settlement agreement, Axsome will grant Alkem a license to sell its generic version of SUNOSI beginning on or after September 1, 2040, if pediatric exclusivity is granted for SUNOSI, or on or after March 1, 2040, if no pediatric exclusivity is granted, subject to FDA approval and conditions and exceptions customary for agreements of this type."},{"time":"07:09","ticker":"TWST","headline":"Twist Bioscience has entered into a licensing agreement with Invenra Inc.","body":"• Under the terms of the agreement, Twist will become the co-exclusive provider, together with Invenra, of Invenra's B-Body bispecific antibody platform, extending Twist's antibody discovery services.\n• B-Body platform complements Twist's antibody discovery offering enabling rapid, efficient and precise expression and discovery of complex bispecific antibody therapeutics.\n• Platform to power high-throughput characterization of bispecific antibodies to fuel AI-enabled and traditional drug discovery."},{"time":"07:09","ticker":"WBD","headline":"Warner Bros. Discovery sets special meeting date of March 20, 2026, and unanimously recommends shareholders vote FOR Netflix (NFLX) merger; Warner Bros. Discovery to Initiate Discussions with Paramount Skydance (PSKY) for their best and final offer","body":"• Netflix (NFLX) Grants Seven-Day Waiver Permitting WBD to engage with PSKY regarding deficiencies and open items in amended offer.PSKY (PSKY) representative separately informed WBD it would agree to pay $31 per share pending engagement and that the offer was not PSKY's \"best and final\" proposal."},{"time":"07:08","ticker":"ROK","headline":"Rockwell Automation announces that Perth County Ingredients has achieved dramatic reductions in maintenance workload, downtime and operational costs after implementing the Fiix computerized maintenance management system","body":"• Facing aging infrastructure, constant reactive maintenance and costly after-hours service calls, PCI needed a solution to move beyond \"firefighting mode\" and toward a proactive, data--driven maintenance strategy. The company turned to Rockwell Automation's Fiix CMMS and Fiix Asset Risk Predictor-transforming its entire maintenance operation in just months.\n• Initially, PCI was operating in a fully reactive state where 100% of maintenance was \"run to failure,\" and critical equipment like boilers and chillers demanded constant attention. After-hours emergency calls were frequent, unpredictable, and costly. To break the cycle, PCI implemented Fiix CMMS across its operations, equipping its maintenance team with tablets and mobile access to work orders, SOPs and the building automation system. This enabled technicians to instantly pull up asset histories, scan QR codes for documentation and troubleshoot issues faster than ever, especially with Wi-Fi upgrades throughout the facility that ensured seamless access."},{"time":"07:08","ticker":"VMI","headline":"Valmont misses by $0.04, reports revs in-line; guides FY26 EPS in-line, revs in-line","body":"• Reports Q4 (Dec) earnings of $4.92 per share, excluding non-recurring items, $0.04 worse than the FactSet Consensus of $4.96; revenues rose 0.1% year/year to $1.04 bln vs the $1.04 bln FactSet Consensus.\n• Co issues in-line guidance for FY26, sees EPS of $20.50-23.50 vs. $21.33 FactSet Consensus; sees FY26 revs of $4.20-4.40 bln vs. $4.28 bln FactSet Consensus. Co guides to FY26 cap-ex of $170-200 mln."},{"time":"07:08","ticker":"KRYS","headline":"Krystal Biotech beats by $0.13, beats on revs","body":"• Reports Q4 (Dec) earnings of $1.70 per share, excluding non-recurring items, $0.13 better than the FactSet Consensus of $1.57; revenues rose 17.6% year/year to $107.11 mln vs the $105.61 mln FactSet Consensus.\n• The company recorded $107.1 million and $389.1 million in VYJUVEK net product revenue for the fourth quarter and full year of 2025, respectively. Gross margin for the fourth quarter and full year of 2025 was 94%.\n• FY26 Guidance: Sees Research and Development and Selling, General and Administrative expense of $175-$195 mln."},{"time":"07:08","ticker":"VMC","headline":"Vulcan Materials misses by $0.41, misses on revs","body":"• Reports Q4 (Dec) earnings of $1.70 per share, excluding non-recurring items, $0.41 worse than the FactSet Consensus of $2.11; revenues rose 3.2% year/year to $1.91 bln vs the $1.96 bln FactSet Consensus.\n• \"As we look to 2026, I'm encouraged about the demand backdrop in our markets. We expect continued strength in public construction activity and improving private nonresidential opportunities, a combination that should benefit an already healthy pricing environment. Growing demand, coupled with our Vulcan Way of Selling and Vulcan Way of Operating disciplines, will drive another year of earnings growth and further improvement in our aggregates unit profitability. We expect to deliver between $2.4 and $2.6 billion of Adjusted EBITDA.\""},{"time":"07:07","ticker":"HZO","headline":"MarineMax: Levin Capital Strategies is calling on the Company's Board of Directors to initiate an immediate review of strategic alternatives following its prior failures to capitalize on credible acquisition offers","body":"• Levin Capital believes the Board is obligated to rigorously explore all available paths to maximizing shareholder value, including by engaging with The Donerail Group following its recent submission of an all-cash offer.\n• According to public disclosures, the $35 per share all-cash offer from Donerail is fully financed and represents a viable path forward, subject to customary due diligence. Levin Capital has consistently advocated for a value-maximization process at MarineMax, pre-dating the current interest. The Firm believes further delay on the part of the Board will force shareholders to hold directors accountable at future annual meetings.\n• In order to try to help MarineMax understand shareholders' views and the opportunities at hand, Levin Capital has communicated its feedback directly to the Company's leadership. The Firm is willing to continue to provide feedback and suggestions to support a timely, well-run review of strategic alternatives."},{"time":"07:06","ticker":"NKTR","headline":"Nektar Therapeutics announces research collaboration with UCSF and Dr. Stephen Hauser for NKTR-0165, a Tumor Necrosis Factor Receptor 2 antibody, in multiple sclerosis","body":"Dr. Hauser is a neuroimmunologist whose research work has played a pivotal role in transforming the treatment landscape for patients with multiple sclerosis."},{"time":"07:05","ticker":"TRIP","headline":"TripAdvisor: Starboard delivers letter to Tripadvisor","body":"NEW YORK--(BUSINESS WIRE)-- Starboard Value LP (together with its affiliates, \"Starboard\"), a significant stockholder of Tripadvisor, Inc. (\"Tripadvisor\" or the \"Company\") (NASDAQ: TRIP), today announced that it has delivered a letter to Greg Maffei, Tripadvisor's Chairman of the Board of Directors, Matt Goldberg, the Company's Chief Executive Officer, and the Board of Directors, with a copy to Mike Noonan, the Company's Chief Financial Officer. Click here for full release."},{"time":"07:05","ticker":"CEVA","headline":"Ceva highlights breakthrough year for AI Licensing and physical AI adoption in 2025","body":"ROCKVILLE, Md., Feb. 17, 2026 /PRNewswire/ -- Ceva, Inc. (NASDAQ: CEVA), the leading licensor of silicon and software IP for the smart edge, today announced that 2025 marked a breakthrough year for its artificial intelligence (\"AI\") licensing business, with 10 NeuPro neural processing unit (\"NPU\") agreements signed and with AI contributing more than 20% of annual licensing revenue in 2025.Click here for full release."},{"time":"07:05","ticker":"SXC","headline":"SunCoke Energy reports Q4 (Dec) results, beats on revs","body":"• Reports Q4 (Dec) loss of $1.00 per share, may not be comparable to the single analyst estimate of $0.09; revenues fell 1.2% year/year to $480.2 mln vs the $432.9 mln single analyst estimate.\n• 2026 Outlook: Domestic coke total sales are expected to be approximately 3.4 million tons. Consolidated Net Income is expected to be between $25 million and $43 million Consolidated Adjusted EBITDA is expected to be between $230 million and $250 million Capital expenditures are projected to be between $90 million and $100 million."},{"time":"07:05","ticker":"DTE","headline":"DTE Energy beats by $0.12; reaffirms FY26 EPS guidance","body":"• Reports Q4 (Dec) earnings of $1.65 per share, $0.12 better than the FactSet Consensus of $1.53.\n• Co reaffirms guidance for FY26, sees EPS of $7.59-7.73 vs. $7.73 FactSet Consensus.\n• Secured landmark agreement to power Oracle's (ORCL) new data center: DTE negotiated its first hyperscale data center contracts to provide 1.4 gigawatts of load to power Oracle's new data center in Saline Township, MI, paving the way to deliver significant affordability benefits to its customers. The contracts, approved by the Michigan Public Service Commission, protect DTE customers by ensuring revenues from Oracle cover the costs associated with powering the data center, so DTE's existing customers will not subsidize data center rates. By bringing a large customer like Oracle onto its electric system, DTE can spread fixed costs more broadly and provide substantial affordability benefits for existing customers. Additionally, the agreement protects customers from any risk of stranded assets. This historic project is the largest economic development initiative in Michigan's history and will generate thousands of local jobs."},{"time":"07:04","ticker":"CEVA","headline":"Ceva reports EPS in-line, revs in-line","body":"• Reports Q4 (Dec) earnings of $0.18 per share, excluding non-recurring items, in-line with the FactSet Consensus of $0.18; revenues rose 7.1% year/year to $31.29 mln vs the $31.03 mln FactSet Consensus."},{"time":"07:04","ticker":"ETOR","headline":"eToro Group Ltd beats by $0.10; authorizes $100 mln increase to share repurchase program","body":"• Reports Q4 (Dec) earnings of $0.69 per share, $0.10 better than the FactSet Consensus of $0.59.\n• Assets Under Administration (AUA) grew by 11% year over year to $18.5 billion, compared to $16.6 billion in the fourth quarter of 2024.\n• Co announces that its Board of Directors has approved a $100 million increase to its existing share repurchase program."},{"time":"07:01","ticker":"GPC","headline":"Genuine Parts misses by $0.26, reports revs in-line; guides FY26 EPS below consensus, revs in-line; increases dividend; announces spinoff","body":"• Reports Q4 (Dec) earnings of $1.55 per share, excluding non-recurring items, $0.26 worse than the FactSet Consensus of $1.81; revenues rose 4.1% year/year to $6.01 bln vs the $6.07 bln FactSet Consensus.\n• Co issues guidance for FY26, sees EPS of $7.50 to $8.00, excluding non-recurring items, vs. $8.44 FactSet Consensus; sees FY26 revs of +3 to +5.5% yr/yr or $25.029 bln to $25.637 bln vs. $25.29 bln FactSet Consensus.\n• Board approved 3.2% dividend increase for the year.\n• Co will separate automotive and industrial businesses into two public companies with completion expected in Q1 2027."},{"time":"07:01","ticker":"BMY","headline":"Bristol-Myers announces that the U.S. Food and Drug Administration has accepted a New Drug Application for iberdomide combined with standard treatment in patients with relapsed or refractory multiple myeloma","body":"• Iberdomide is part of an investigational, new class of medicines called cereblon E3 ligase modulator (CELMoD) agents.\n• Iberdomide has the potential to be the first approved CELMoD agent.\n• The U.S. FDA has granted Breakthrough Therapy Designation and Priority Review for this indication and assigned a target action date of August 17, 2026."},{"time":"07:00","ticker":"SUMRX","headline":"Asian Markets Close: Nikkei -0.4%, Hang Seng CLOSED, Shanghai CLOSED","body":"• In economic data: Japan's December Tertiary Industry Activity Index 8.40 (last -2.50) New Zealand's January FPI 2.5% m/m (last -0.3%)\n• Japan's December Tertiary Industry Activity Index 8.40 (last -2.50)\n• New Zealand's January FPI 2.5% m/m (last -0.3%)\n• Japan's Nikkei: -0.4%\n• Hong Kong's Hang Seng: CLOSED\n• China's Shanghai Composite: CLOSED\n• India's Sensex: +0.2%\n• South Korea's Kospi: CLOSED\n• Australia's ASX All Ordinaries: +0.2%\n• USD/JPY: -0.2% to 153.09\n• USD/CNH: +0.1% to 6.8860\n• USD/INR: -0.1% to 90.68"},{"time":"06:58","ticker":"GPC","headline":"Genuine Parts announces its intention to separate the company into two independent, publicly traded companies, one comprising its Automotive Parts Group and the other comprising its Industrial Parts Group","body":"• The transaction, which is targeted for completion in the first quarter of 2027, is expected to qualify as a tax-free transaction for U.S. federal tax purposes to Genuine Parts Company shareholders.\n• Separation to unlock significant shareholder value and enhance strategic clarity, operational focus and financial performance for both companies.\n• Tax-free separation expected to be completed in the first quarter of 2027.\n• Company to announce further details regarding ongoing operational and strategic initiatives at Investor Days for Global Automotive and Global Industrial in the second half of 2026.\n• Company to host conference call today at 8:30 a.m. ET to discuss fourth quarter and full-year 2025 earnings results and the separation announcement."},{"time":"06:58","ticker":"LH","headline":"Labcorp Holdings Inc. beats by $0.13, misses on revs; guides FY26 EPS above consensus","body":"• Reports Q4 (Dec) earnings of $4.07 per share, $0.13 better than the FactSet Consensus of $3.94; revenues rose 5.6% year/year to $3.52 bln vs the $3.56 bln FactSet Consensus.\n• Co issues upside guidance for FY26, sees EPS of $17.55-18.25, excluding non-recurring items, vs. $17.51 FactSet Consensus.Co sees segment revs of: Labcorp Enterprise: +4.7-6.0 %Diagnostics Laboratories: +5.0-6.0 %Biopharma Laboratory Services: +3.0-5.0%\n• Co sees segment revs of: Labcorp Enterprise: +4.7-6.0 %Diagnostics Laboratories: +5.0-6.0 %Biopharma Laboratory Services: +3.0-5.0%\n• Labcorp Enterprise: +4.7-6.0 %\n• Diagnostics Laboratories: +5.0-6.0 %\n• Biopharma Laboratory Services: +3.0-5.0%"},{"time":"06:57","ticker":"USAC","headline":"USA Compression Partners reports fourth-quarter 2025 results and provides 2026 outlook; achieves record results","body":"USA Compression Partners, LP (NYSE: USAC) (\"USA Compression\" or the \"Partnership\") announced today its financial and operating results for fourth-quarter 2025.Click here for full release."},{"time":"06:55","ticker":"FLR","headline":"Fluor misses by $0.01, misses on revs","body":"• Reports Q4 (Dec) earnings of $0.33 per share, excluding non-recurring items, $0.01 worse than the FactSet Consensus of $0.34; revenues fell 2.0% year/year to $4.17 bln vs the $4.31 bln FactSet Consensus.Ending Backlog of $25.5 billion; 81% reimbursable\n• Ending Backlog of $25.5 billion; 81% reimbursable\n• We are establishing adjusted EBITDA guidance for 2026 of $525 million to $585 million.\n• $1.4 billion of share repurchases are planned for 2026 versus $754 million in 2025."},{"time":"06:54","ticker":"FLR","headline":"Fluor has completed another significant milestone involving the sale of 71 million shares of NuScale Power Corporation (SMR), generating gross sales proceeds of $1.35 billio","body":"• Fluor has begun efforts to monetize its remaining 40 million shares, which it expects to complete in the second quarter of 2026. Including the sales in 2025, the company has captured nearly $2 billion in total proceeds to date.\n• As part of Fluor's ongoing commitment to enhance value for its shareholders, since the beginning of the fourth quarter of 2025 and through February 13, 2026, the Company repurchased nearly 17 million shares of its common stock, deploying over $700 million. In February, the Board of Directors approved an increase in the number of shares authorized for repurchase under Fluor's share repurchase program by an additional 30 million shares. Following the increase there are approximately 32.4 million shares currently available for repurchase under the program.\n• The company will provide additional commentary on these activities and the anticipated use of investment proceeds during its fourth-quarter earnings call on February 17."},{"time":"06:54","ticker":"SKE","headline":"Skeena Gold &amp; Silver releases construction video update for Eskay Creek","body":"VANCOUVER, British Columbia, Feb. 17, 2026 (GLOBE NEWSWIRE) -- Skeena Resources Limited (TSX: SKE, NYSE: SKE) (\"Skeena Gold & Silver\", \"Skeena\" or the \"Company\") is pleased to share a construction video update for its 100%-owned Eskay Creek Gold-Silver Project (\"Eskay\" or the \"Project\"). This six-minute video features members of Skeena's leadership team, including Executive Chairman Walter Coles, President & CEO Randy Reichert, VP of Operations Kyle Foster, and VP of Project Engineering & Construction Andrew Osterloh.Click here for full release."},{"time":"06:51","ticker":"WAY","headline":"Waystar Holding Corp. misses by $0.03, beats on revs; guides FY26 EPS in-line, revs in-line","body":"• Reports Q4 (Dec) earnings of $0.36 per share, excluding non-recurring items, $0.03 worse than the FactSet Consensus of $0.39; revenues rose 24.3% year/year to $303.5 mln vs the $294.79 mln FactSet Consensus.\n• Co issues in-line guidance for FY26, sees EPS of $1.59-$1.68, excluding non-recurring items, vs. $1.64 FactSet Consensus; sees FY26 revs of $1.274-$1.294 bln vs. $1.29 bln FactSet Consensus."},{"time":"06:50","ticker":"MDT","headline":"Medtronic beats by $0.02, misses on revs; reaffirms FY26 EPS guidance","body":"• Reports Q3 (Jan) earnings of $1.36 per share, excluding non-recurring items, $0.02 better than the FactSet Consensus of $1.34; revenues rose 5.8% year/year to $8.78 bln vs the $8.91 bln FactSet Consensus.\n• Co reaffirms guidance for FY26, sees EPS of $5.62 to $5.66, excluding non-recurring items, vs. $5.65 FactSet Consensus.FY26 organic revenue growth still expected around 5.5%.\n• FY26 organic revenue growth still expected around 5.5%."},{"time":"06:48","ticker":"PFE","headline":"Pfizer announces \"positive\" topline progression-free (PFS) survival results from Cohort 3, a separate randomized cohort of the pivotal BREAKWATER trial, evaluating BRAFTOVI in combination with cetuximab and FOLFIRI in patients with previously untreated metastatic colorectal cancer with a BRAF V600E mutation","body":"• The BRAFTOVI regimen demonstrated a statistically significant and clinically meaningful improvement in PFS, a key secondary endpoint, as assessed by blinded independent central review compared to treatment with FOLFIRI with or without bevacizumab. Overall survival, a descriptive secondary endpoint, also showed clinically meaningful prolonged improvement with the BRAFTOVI regimen.\n• BREAKWATER trial Cohort 3 analysis demonstrated statistically significant and clinically meaningful improvement in progression-free survival in BRAF V600E-mutant metastatic colorectal cancer.\n• Results reinforce potential of BRAFTOVI as a cornerstone targeted treatment, if this regimen is approved."},{"time":"06:46","ticker":"BRO","headline":"Brown &amp; Brown acquires the assets of The Protectorate Group Insurance Agency, Inc., doing business as American Adventure Insurance","body":"American Adventure specializes in providing insurance solutions at the dealership for all types of vehicles, including motor homes, travel trailers, campers, boats, personal watercrafts, motorcycles and more. American Adventure also provides F&I products to automotive dealers and commercial insurance solutions. American Adventure is led by Paul Bender, who has over 30 years of experience partnering with dealers to provide on-the-spot insurance products for their customers. The American Adventure team will join Brown & Brown Dealer Services and continue to operate nationwide. Paul and the team will report to Mike Neal, president of BBDS."},{"time":"06:45","ticker":"MDT","headline":"Medtronic announces that the first U.S. commercial surgical case using its recently FDA-cleared Hugo robotic-assisted surgery system has been successfully performed by Jihad Kaouk, MD, professor and chair of the Glickman Urologic Institute and the Zegarac-Pollock Endowed Chair in Robotic Surgery at Cleveland Clinic","body":"• Newly FDA-cleared system helps expand patient access to minimally invasive surgery.\n• Cleveland Clinic joins nationally recognized academic medical centers including Atrium Health Wake Forest Baptist High Point Medical Center as first hospitals in the U.S. to install Hugo RAS system."},{"time":"06:42","ticker":"CMPS","headline":"COMPASS Pathways announces successful achievement of the primary endpoint in the ongoing Phase 3 COMP006 trial","body":"• Co announces the successful achievement of the primary endpoint in the ongoing Phase 3 COMP006 trial, the second of two Phase 3 trials, which is evaluating two fixed doses of COMP360, a synthetic, proprietary formulation of psilocybin, for treatment-resistant depression.\n• The primary endpoint was the difference in change from baseline in the Montgomery-sberg Depression Rating Scale (MADRS) scores between the 25 mg and 1 mg groups at Week 6. Two fixed doses -- administered 3 weeks apart -- of COMP360 25 mg versus 1 mg demonstrated a highly statistically significant reduction in symptom severity with a p-value of <0.001 and a clinically meaningful difference of -3.8 points in change at the primary endpoint.\n• Across COMP005 and COMP006 to date, COMP360 is demonstrating a generally well-tolerated and safe profile, with treatment-emergent adverse events (TEAEs) being mild or moderate in severity, and the vast majority resolving within 24 hours. The data confirms a statistically significant rapid onset from the day following administration and maintained at all measured timepoints through Week 6 in both clinical trials in the 25 mg arm. COMP005 suggests that participants who demonstrated a clinically meaningful reduction in MADRS maintained durable treatment effect at least through Week 26, after just one or two doses. Retreatment with a second dose was well-tolerated, with a consistent safety profile.\n• CMPS has submitted a request for a meeting with the U.S. Food and Drug Administration (FDA) to discuss a rolling submission and review."},{"time":"06:40","ticker":"GIS","headline":"General Mills lowers FY26 guidance ahead of Consumer Analyst Group of New York Conference","body":"• Co provides updated FY26 financial outlook ahead of today's Consumer Analyst Group of New York (CAGNY) Conference.Organic net sales are now expected to be down 1.5 to 2 percent, compared to the previous range of down 1 percent to up 1 percent.Adjusted operating profit and adjusted diluted EPS are now expected to be down 16 to 20 percent in constant currency, compared to the previous range of down 10 to 15 percent in constant currency.Free cash flow conversion is still expected to be at least 95 percent of adjusted after-tax earnings.\n• Organic net sales are now expected to be down 1.5 to 2 percent, compared to the previous range of down 1 percent to up 1 percent.\n• Adjusted operating profit and adjusted diluted EPS are now expected to be down 16 to 20 percent in constant currency, compared to the previous range of down 10 to 15 percent in constant currency.\n• Free cash flow conversion is still expected to be at least 95 percent of adjusted after-tax earnings.\n• Co states, \"While the company is making meaningful progress in strengthening its remarkability to position the business for long-term sustainable growth, this progress has come amid a more challenging backdrop. Weak consumer sentiment, heightened uncertainty, and significant volatility have weighed on category growth and impacted consumer purchase patterns, resulting in a slower pace and higher cost of volume recovery than initially expected...\""},{"time":"06:40","ticker":"SGI","headline":"Somnigroup International reports EPS in-line, misses on revs; guides FY26 EPS in-line; increases dividend by 13%","body":"• Reports Q4 (Dec) earnings of $0.72 per share, excluding non-recurring items, in-line with the FactSet Consensus of $0.72; revenues rose 54.7% year/year to $1.87 bln vs the $1.93 bln FactSet Consensus.\n• Co issues in-line guidance for FY26, sees EPS of $3.00-3.40, excluding non-recurring items, vs. $3.33 FactSet Consensus.\n• Long-term perspective: We are internally targeting sales to grow at a compound annual rate of mid single digits. This indicates that we expect Somnigroup adjusted EPS(1) to increase from $2.70 in 2025 to approximately $5.15 by 2028, a compound annual growth rate of 24%.\n• We are internally targeting sales to grow at a compound annual rate of mid single digits. This indicates that we expect Somnigroup adjusted EPS(1) to increase from $2.70 in 2025 to approximately $5.15 by 2028, a compound annual growth rate of 24%.\n• Today, the Company announced that its Board of Directors increased the quarterly cash dividend by 13% to $0.17 per share. This is the sixth increase to the dividend since 2021. The dividend is payable on March 19, 2026 to shareholders of record at the close of business on March 5, 2026."},{"time":"06:39","ticker":"GLDG","headline":"GoldMining updates mineral resource estimate with inclusion of antimony at its Crucero Gold Project, Peru","body":"VANCOUVER, BC, Feb. 17, 2026 /PRNewswire/ - GoldMining Inc. (TSX: GOLD) (NYSE American: GLDG) (\"GoldMining\" or the \"Company\") is pleased to report an updated Mineral Resource Estimate (the \"MRE\") on its 100% owned Crucero Project (\"Crucero\" or the \"Project\") in Carabaya Province, Peru. The updated MRE has been prepared under National Instrument 43-101 -- Standards of Disclosure for Mineral Projects (\"NI 43-101\").Click here for full release."},{"time":"06:39","ticker":"SGI","headline":"Somnigroup International increases quarterly cash dividend to $0.17/share from $0.15/share","body":""},{"time":"06:36","ticker":"KW","headline":"Kennedy Wilson to be acquired in an all-cash transaction by Fairfax Financial Holdings (FRFHF) and KW Management Group for $10.90/share","body":"• Co and Fairfax Financial Holdings Limited jointly announce that the company has entered into a definitive agreement providing for Kennedy Wilson to be acquired, in an all cash-transaction, by an entity affiliated with a consortium led by William McMorrow, Chairman and Chief Executive Officer of the Company, and certain other senior executives of the Company (collectively, the \"KW Management Group\"), together with Fairfax.\n• Under the terms of the Merger Agreement, the Consortium will acquire all outstanding common shares of Kennedy Wilson other than certain shares owned by the members of the Consortium and their respective affiliates for $10.90 per share in cash.\n• The per share purchase price represents a 46% premium to Kennedy Wilson's unaffected share price as of November 4, 2025, the last trading day prior to a publicly disclosed proposal received by the Company after market close on November 4, 2025 from the Consortium to acquire Kennedy Wilson.\n• Each member of the Consortium has entered into a voting and support agreement whereby each has agreed to vote in favor of the Transaction in accordance with the terms and conditions thereof. Concurrent with entering into the Merger Agreement, Fairfax has entered into a commitment letter pursuant to which Fairfax has committed to provide the Consortium with funding up to an aggregate amount of $1.65 billion, which is the amount necessary to fund the cash purchase price in respect of the Transaction, the redemption of those preferred shares of the Company not owned by the Consortium, and certain other amounts required to be paid under the terms of the Merger Agreement."},{"time":"06:36","ticker":"SCANX","headline":"Early premarket gappers","body":"• Gapping up: ZIM +35.1%, RYI +8.6%, ENLT +7.1%, NPO +5.2%, BNC +4.4%, NESR +4%, NWG +3.6%, LAD +3.2%, GSK +2.6%, SON +2.4%, ESLT +2%, AHH +1.6%, NEE +1.1%, BLDR +1.1%, RNW +0.9%, OTIS +0.7%, OTTR +0.7%\n• ZIM +35.1%, RYI +8.6%, ENLT +7.1%, NPO +5.2%, BNC +4.4%, NESR +4%, NWG +3.6%, LAD +3.2%, GSK +2.6%, SON +2.4%, ESLT +2%, AHH +1.6%, NEE +1.1%, BLDR +1.1%, RNW +0.9%, OTIS +0.7%, OTTR +0.7%\n• Gapping down: WHG -7.5%, CMPS -7.2%, ALLE -3.6%, LDOS -3.5%, IHG -3.2%, WPM -2.7%, LPX -1.7%, HIVE -1.4%, IVA -1.3%, STEX -1.2%\n• WHG -7.5%, CMPS -7.2%, ALLE -3.6%, LDOS -3.5%, IHG -3.2%, WPM -2.7%, LPX -1.7%, HIVE -1.4%, IVA -1.3%, STEX -1.2%"},{"time":"06:36","ticker":"CNH","headline":"CNH Industrial beats by $0.08, beats on revs; guides FY26 EPS below consensus","body":"• Reports Q4 (Dec) earnings of $0.19 per share, excluding non-recurring items, $0.08 better than the FactSet Consensus of $0.11; revenues rose 5.8% year/year to $5.16 bln vs the $4.94 bln FactSet Consensus.Co is preparing for lower demand levels in 2026 ahead of an expected agriculture industry recovery in 2027.\n• Co is preparing for lower demand levels in 2026 ahead of an expected agriculture industry recovery in 2027.\n• Co issues downside guidance for FY26, sees EPS of $0.35 to $0.45, excluding non-recurring items, vs. $0.51 FactSet Consensus.Agriculture segment net sales expected between down 5% yr/yr and flat yr/yr.Construction segment net sales expected to be flat yr/yr.\n• Agriculture segment net sales expected between down 5% yr/yr and flat yr/yr.\n• Construction segment net sales expected to be flat yr/yr."},{"time":"06:34","ticker":"FTAI","headline":"FTAI Aviation Ltd. has closed the acquisition of seven off-lease Airbus (EADSY) aircraft from Air France to assist the airline in the continued modernization of its narrowbody fleet","body":"• The transaction includes one A318-100 aircraft, four A319-100 aircraft, and two A321-200 aircraft.\n• This strategic transaction demonstrates FTAI's differentiated ability to create asset value through its innovative engine repair capabilities and highlights the Company's commitment to delivering flexible, comprehensive fleet management solutions for global airline partners."},{"time":"06:34","ticker":"HRI","headline":"Herc Holdings beats by $0.20, misses on revs","body":"• Reports Q4 (Dec) earnings of $2.07 per share, excluding non-recurring items, $0.20 better than the FactSet Consensus of $1.87; revenues rose 27.1% year/year to $1.21 bln vs the $1.26 bln FactSet Consensus.\n• 2026 outlook:Equipment rental revenue: $4.275 billion to $4.4 billion. Adjusted EBITDA: $2.0 billion to $2.1 billion.\n• Equipment rental revenue: $4.275 billion to $4.4 billion.\n• Adjusted EBITDA: $2.0 billion to $2.1 billion."},{"time":"06:32","ticker":"WWR","headline":"Westwater Resources: Department of Commerce issues final determination in Chinese graphite anti-dumping investigation","body":"• Co announced today that the U.S. Department of Commerce issued its final determination in the anti-dumping and countervailing duty investigations of graphite-based anode materials imported from the People's Republic of China.\n• The DOC's preliminary determinations in 2025 imposed countervailing and anti-dumping duties of 11.58% and 93.5%, respectively. In its final determination released on February 11, 2026, the DOC increased the countervailing duty rate to 66.68% and maintained the anti-dumping duty rate at 93.5%.\n• The Company estimates total penalties on Chinese natural graphite anode material U.S. imports now total approximately 220%:IEEPA tariff: 10%Section 301 tariffs: 25%Section 232 tariffs: 25%DOC countervailing duties: 66.68% (previously 11.58%)DOC anti-dumping duties: 93.5%TOTAL tariffs/duties: ~220.18%\n• IEEPA tariff: 10%\n• Section 301 tariffs: 25%\n• Section 232 tariffs: 25%\n• DOC countervailing duties: 66.68% (previously 11.58%)\n• DOC anti-dumping duties: 93.5%\n• TOTAL tariffs/duties: ~220.18%"},{"time":"06:31","ticker":"IDCC","headline":"InterDigital has signed a new patent license agreement with Sony (SONY)","body":"This agreement covers all of Sony's end user devices under InterDigital's global patent portfolio, including InterDigital's standard essential cellular, WiFi, and video patents."},{"time":"06:24","ticker":"JPM","headline":"JPMorgan Chase reports January card metrics","body":"• Reports January U.S. net credit losses of 1.69% vs 1.59% last month (+10 bps sequential change) with 30+ day delinquencies of 0.88% vs 0.84% last month (+4 bps change)."},{"time":"06:24","ticker":"IBRX","headline":"ImmunityBio announces that the Company held productive regulatory discussions with the Saudi Food and Drug Authority in Riyadh, convened under the Saudi-USA Biotech Alliance hosted by the Ministry of Investment of Saudi Arabia","body":"• ImmunityBio held productive regulatory discussions with the Saudi Food and Drug Authority in Riyadh convened under the Saudi-USA Biotech Alliance, hosted by the Ministry of Investment of Saudi Arabia.\n• SFDA encouraged the company to submit a regulatory package for ImmunityBio's recombinant BCG to expand BCG access for Saudi Arabia to overcome the BCG shortage.\n• ImmunityBio and SFDA initiated discussion for expansion of ANKTIVA (nogapendekin alfa inbakicept) plus checkpoint inhibitor combination for additional tumor types beyond NSCLC, building on the accelerated approval granted in January 2026 for metastatic non-small cell lung cancer in the CPI relapsed population.\n• The QUILT-3.055 basket trial has demonstrated that ANKTIVA rescues checkpoint inhibitor activity across multiple tumor types, including NSCLC, urothelial, head and neck, melanoma, renal, gastric, and cervical cancers, with a median overall survival of 14.1 months in CPI relapsed NSCLC patients.\n• SFDA has now approved ANKTIVA across two indications in Saudi Arabia: BCG unresponsive non muscle invasive bladder cancer and metastatic NSCLC in combination with checkpoint inhibitors.\n• Company expects to submit the rBCG regulatory package to the SFDA within the coming weeks."},{"time":"06:23","ticker":"TE","headline":"T1 Energy: Treasury guidance supports T1's tax credit eligibility","body":"• Co supports policy that favors the revival of advanced American manufacturing and energy dominance in accordance with the One Big Beautiful Bill Act. The initial guidance provided by the U.S. Department of Treasury last week on the implementation of the OBBBA foreign entity of concern provisions is consistent with T1's expectations and supports T1's analysis of its eligibility for Section 45X tax credits.\n• \"T1 is an American-owned and controlled company committed to investing in advanced American manufacturing, building a domestic and non-FEOC solar supply chain, and bringing solar technology and know-how back to America,\" commented Chairman and CEO Dan Barcelo. \"The Treasury guidance aligns with our mission and validates T1's strategy to satisfy FEOC material assistance requirements.\"\n• T1 began construction on a U.S. solar cell fab in Rockdale, Texas, in late 2025, and the Company currently owns and operates a state-of-the-art U.S. solar module factory in Wilmer, Texas. In addition, T1 has contracted to purchase American produced polysilicon from Hemlock Semiconductor, wafers from Corning (GLW), and steel frames from Nextpower (NXT)."},{"time":"06:22","ticker":"TSEM","headline":"Tower Semi announces availability of the world's first heterogeneously integrated Dense Wavelength Division Multiplexing laser sources for AI infrastructure using Scintil's SHIP technology","body":"• SHIP leverages Tower's high-volume silicon photonics platform and combines it with heterogeneous integration of monolithic laser sources, capable of meeting the most demanding DWDM technical requirements for AI.\n• DWDM lasers are an essential component of Co-Packaged Optics based next generation of AI infrastructure that aims to deliver ever-growing bandwidth density, ultra-low tail latency, and lower energy per bit, while improving GPU utilization and hyperscaler ROI needed in the agentic AI era."},{"time":"06:21","ticker":"SNY","headline":"Sanofi and Teva's (TEVA) duvakitug phase 2b maintenance data demonstrated clinically meaningful durable efficacy in ulcerative colitis and Crohn's disease","body":"• In the RELIEVE UCCD LTE phase 2b study, duvakitug showed robust, durable efficacy for an additional 44 weeks in UC and CD patients who had responded after 14 weeks of induction.\n• Duvakitug was well tolerated and safety was consistent with the induction study.\n• Findings reinforce the potential of duvakitug which is in ongoing phase 3 programs in UC and CD.\n• Teva will hold an investor call and live webcast today, Tuesday, February 17, 2026, at 8:00 a.m. ET to discuss these data."},{"time":"06:12","ticker":"COF","headline":"Capital One reports January card metrics","body":"• Reports January Domestic net charge-off rate of 5.04% vs 5.01% last month (+3 bps sequential change) with delinquency rate of 4.04% vs 3.99% last month (+5 bps change)."},{"time":"06:12","ticker":"BCE","headline":"BCE Inc's Bell Cyber and Radware (RDWR) expand AI-driven, cloud-delivered security services to address evolving cyber threats","body":"• Co announced the expansion of their partnership with an enhanced AI-driven, cloud-delivered security service designed to help organizations defend against increasingly automated and sophisticated cyberattacks.\n• The expanded service integrates Radware's AI-based application security with Bell Cyber's fully managed security operations, designed to enable earlier identification of anomalous behaviour, blocking malicious traffic, and adapting protection as attack patterns evolve. The service is delivered through Bell Cyber's managed security model, reducing the operational burden on customer security teams."},{"time":"06:11","ticker":"BLDR","headline":"Builders FirstSource misses by $0.13, misses on revs; guides FY26 revs in-line","body":"• Reports Q4 (Dec) earnings of $1.12 per share, excluding non-recurring items, $0.13 worse than the FactSet Consensus of $1.25; revenues fell 12.1% year/year to $3.36 bln vs the $3.45 bln FactSet Consensus.\n• Co issues in-line guidance for FY26, sees FY26 revs of $14.8 bln to $15.8 bln vs. $15.12 bln FactSet Consensus."},{"time":"06:08","ticker":"LPX","headline":"Louisiana-Pacific beats by $0.04, misses on revs","body":"• Reports Q4 (Dec) earnings of $0.03 per share, excluding non-recurring items, $0.04 better than the FactSet Consensus of ($0.01); revenues fell 16.7% year/year to $567 mln vs the $588.02 mln FactSet Consensus.\n• Q1 siding net sales expected between $350 mln and $355 mln.\n• FY26 siding net sales expected around $1.7 bln."},{"time":"06:06","ticker":"ALLE","headline":"Allegion misses by $0.05, reports revs in-line; guides FY26 EPS in-line, revs in-line","body":"• Reports Q4 (Dec) earnings of $1.94 per share, excluding non-recurring items, $0.05 worse than the FactSet Consensus of $1.99; revenues rose 9.3% year/year to $1.03 bln vs the $1.04 bln FactSet Consensus.\n• Co issues in-line guidance for FY26, sees EPS of $8.70-8.90, excluding non-recurring items, vs. $8.82 FactSet Consensus; sees FY26 revs of ~4.27-4.35 bln vs. $4.31 bln FactSet Consensus.The company expects full-year available cash flow to be 85% to 95% of adjusted net income.\n• The company expects full-year available cash flow to be 85% to 95% of adjusted net income."},{"time":"06:04","ticker":"KNF","headline":"Knife River Corp. beats by $0.16, beats on revs; guides FY26 revs above consensus","body":"• Reports Q4 (Dec) earnings of $0.56 per share, $0.16 better than the FactSet Consensus of $0.40; revenues rose 14.9% year/year to $755.1 mln vs the $726 mln FactSet Consensus.\n• Co issues upside guidance for FY26, sees FY26 revs of $3.30-3.50 bln vs. $3.28 bln FactSet Consensus.Co sees FY26 Adjusted EBITDA of $520.0-560.0 mln\n• Co sees FY26 Adjusted EBITDA of $520.0-560.0 mln"},{"time":"06:03","ticker":"LDOS","headline":"Leidos beats by $0.15, misses on revs; guides FY26 EPS in-line, revs in-line","body":"• Reports Q4 (Dec) earnings of $2.76 per share, excluding non-recurring items, $0.15 better than the FactSet Consensus of $2.61; revenues fell 3.6% year/year to $4.21 bln vs the $4.3 bln FactSet Consensus.Net Bookings: $5.6 billion for fourth quarter (book-to-bill ratio of 1.3); $17.5 billion for the year (book-to-bill ratio of 1.0).\n• Net Bookings: $5.6 billion for fourth quarter (book-to-bill ratio of 1.3); $17.5 billion for the year (book-to-bill ratio of 1.0).\n• Co issues in-line guidance for FY26, sees EPS of $12.05-12.45, excluding non-recurring items, vs. $12.29 FactSet Consensus; sees FY26 revs of $17.5-17.9 bln vs. $17.89 bln FactSet Consensus.Adj. EBITDA margin mid-13%.\n• Adj. EBITDA margin mid-13%."},{"time":"06:02","ticker":"DJCO","headline":"Daily Journal Corporation announces first quarter fiscal 2026 financial results","body":"LOS ANGELES, Feb. 17, 2026 (GLOBE NEWSWIRE) -- Daily Journal Corporation (Nasdaq: DJCO), a publishing and technology company, today announced financial results for the three months ended December 31, 2025. Total consolidated revenue for the quarter was $19.5 million, representing a 10% increase from the $17.7 million reported in the prior-year quarter, driven primarily by growth at Journal Technologies.Click here for full release."},{"time":"06:00","ticker":"SUMRX","headline":"Overnight Summary -- Defensive tone builds with S&amp;P under pressure, Nikkei extends losses, Europe steadies","body":"• The tone is turning defensive early, with S&P futures under pressure, metals hit hard, and global equities lacking conviction as investors recalibrate around softer rates and uneven overseas trade. S&P futures are down about 18 points, trading around 6833. The range was wide, with a high of 6885.50 and a low of 6810.00, but it also included the holiday trading day, with the US market closed on Monday.\n• Asian markets closed mixed on Tuesday, with trading volumes light as mainland China, Hong Kong, Singapore, Taiwan, and South Korea remained shut for Lunar New Year holidays. Japan underperformed, with the Nikkei 225 falling 0.42% to 56,566.49, extending its losing streak to a fourth session as soft GDP data and expectations for a potential Bank of Japan rate hike in April weighed on sentiment; BOJ Governor Kazuo Ueda also discussed economic conditions with Prime Minister Takaichi. Investors monitored geopolitical developments, including renewed U.S.-mediated talks among Iran, Russia, and Ukraine, while awaiting key US data on GDP, PCE inflation, and the Fed minutes.\n• European markets trade flat to modestly higher on Tuesday, with the FTSE 100, DAX, and CAC 40 holding near unchanged levels as investors balance geopolitics against upcoming US economic data. In the U.K., the FTSE is shaped by weak labor market data, with the jobless rate rising to 5.2% and wage growth slowing, reinforcing expectations for a potential Bank of England rate cut as soon as March; GSK gains on a 2 bln buyback, while Antofagasta declines despite record earnings. Germany's DAX is supported by confirmation that January inflation rebounded to 2.1%, matching EU-harmonized data, while defense names ease amid softer geopolitical tensions. Across the region, stock-specific moves drive dispersion, with BHP advancing on solid earnings and Basilea Pharmaceutica sliding on weaker full-year results.\n• S&P Futures vs Fair Value: -18.0\n• 10 yr Note: 4.031%\n• USD/JPY: 153.06 -0.46\n• EUR/USD: 1.1848 -0.0004\n• Europe: FTSE: +0.4% DAX: +0.1% CAC: 0.0%\n• Asia: Hang Seng: CLOSED Shanghai: CLOSED Nikkei: -0.4%\n• Gold (4945.80 -100.50) Silver (74.430 -3.534) Crude (63.40 +0.51)"},{"time":"05:32","ticker":"POR","headline":"Portland Gen Elec to acquire PacifiCorp Washington assets for $1.9 bln","body":"• PacifiCorp agreed to sell its Washington wind, natural gas generation and distribution assets to Portland General Electric for $1.9 bln, subject to customary adjustments.\n• The assets include the Chehalis thermal plant, Marengo and Goodnoe Hills wind facilities, and distribution infrastructure serving Yakima, Walla Walla and surrounding areas.\n• The transaction is intended to strengthen PacifiCorp's financial position, improve liquidity and simplify operations amid regulatory divergence across its six-state footprint.\n• Portland General Electric expands its regulated asset base in Washington through the acquisition, which is subject to customary regulatory approvals."},{"time":"05:29","ticker":"INFY","headline":"Infosys and Anthropic announce collaboration to unlock AI value across  complex, regulated industries","body":"• Co announced a strategic collaboration with Anthropic, an AI safety and research company, to develop and deliver advanced enterprise AI solutions to companies across telecommunications, financial services, manufacturing, and software development. The collaboration will begin in telecommunications with a dedicated Anthropic Center of Excellence to build and deploy AI agents tailored to industry-specific operations.\n• The collaboration will further expand across industries, including financial services, manufacturing, and software development. At its core, the collaboration integrates Anthropic's Claude models, including Claude Code, with Infosys Topaz AI offerings to help enterprises automate complex workflows, accelerate software delivery, and adopt AI with the governance and transparency that regulated industries require."},{"time":"05:25","ticker":"GSK","headline":"GlaxoSmithKline: Exdensur (depemokimab) approved by the European Commission for severe asthma with type 2 inflammation and chronic rhinosinusitis with nasal polyps","body":"• Co announced the European Commission has approved Exdensur (depemokimab) in two indications:as add-on maintenance treatment for severe asthma with type 2 inflammation characterised by blood eosinophil count in adults and adolescents 12 years and older who are inadequately controlled despite high dose inhaled corticosteroids (ICS) plus another asthma controller;as an add-on therapy with intranasal corticosteroids for the treatment of adult patients with severe CRSwNP for whom therapy with systemic corticosteroids and/or surgery do not provide adequate disease control.\n• as add-on maintenance treatment for severe asthma with type 2 inflammation characterised by blood eosinophil count in adults and adolescents 12 years and older who are inadequately controlled despite high dose inhaled corticosteroids (ICS) plus another asthma controller;\n• as an add-on therapy with intranasal corticosteroids for the treatment of adult patients with severe CRSwNP for whom therapy with systemic corticosteroids and/or surgery do not provide adequate disease control.\n• The approval is based on data from the SWIFT and ANCHOR phase III trials, which showed sustained efficacy with a twice-yearly dosing regimen for depemokimab. Each of the four trials met their primary or co-primary endpoints with statistically significant and clinically meaningful results, comparing the addition of depemokimab to standard of care versus standard of care alone.1"},{"time":"05:17","ticker":"WIRES","headline":"On The Wires","body":"• VEON Ltd. (VEON) announces that it has signed a Memorandum of Understanding with Hala, Dubai's leading local e-hailing taxi solution and a joint venture between Dubai's Roads and Transport Authority and Careem, to explore cooperation in expanding ride-hailing and mobility services across VEON's operating markets. The Memorandum of Understanding was signed last week at VEON's headquarters in Dubai. The MoU establishes a framework for evaluating joint market entry and expansion opportunities, building on VEON's existing experience in ride-hailing in Ukraine and Uzbekistan. VEON aims to leverage Hala's operational expertise alongside its own digital scale and local market presence across frontier markets. The companies will also explore potential areas of integration within VEON's broader digital ecosystem.\n• Ooma (OOMA) announced the launch of POTSTracker.com, an AI-powered monitoring and analysis platform designed to help organizations navigate the complex landscape of legacy voice service discontinuance. As telecommunications carriers across the United States accelerate the retirement of traditional copper-based Plain Old Telephone Service lines, POTSTracker.com gives enterprises and multi-site organizations the visibility and planning tools needed to support business continuity.\n• Eni (E) confirms a significant oil discovery in the Algaita-01 exploration well in Block 15/06, offshore Angola, approximately 18 km from Olombendo FPSO. Preliminary estimates indicate oil in place of around 500 million barrels. The Algaita-01 well, spudded on 10 January 2026, was drilled by the Saipem 12000 drill ship in a water depth of 667 metres. The well encountered oil-bearing sandstones in multiple Upper Miocene intervals, characterised by excellent petrophysical properties. A comprehensive data acquisition campaign, including fluid sampling, confirmed the quality of the reservoir and the fluid characteristics."},{"time":"05:17","ticker":"NWG","headline":"NatWest Group launches 750 mln 2026 share buyback program","body":"• NatWest Group plc announced the commencement of a 750 mln share buyback programme to repurchase ordinary shares with a nominal value of 1.0769 each.\n• Co stated the programme will begin 16 February 2026 and run through 15 January 2027, with potential extension to 12 February 2027 if required due to market disruptions.\n• The maximum number of shares authorized for repurchase under the programme is 650,000,000, within shareholder authority granted at the April 2025 AGM."},{"time":"05:10","ticker":"WIRES","headline":"On The Wires","body":"• GlobalFoundries (GFS) and Renesas Electronics Corporation announced an expanded strategic collaboration through a multi-billion-dollar manufacturing partnership that broadens Renesas' access to GF technologies including its differentiated technology platforms. This agreement reflects a shared commitment to secure, resilient supply chains and aligns with U.S. priorities to strengthen domestic semiconductor production for economic and national security.\n• Infosys (INFY) announced a strategic collaboration with Anthropic, an AI safety and research company, to develop and deliver advanced enterprise AI solutions to companies across telecommunications, financial services, manufacturing, and software development. The collaboration will begin in telecommunications with a dedicated Anthropic Center of Excellence to build and deploy AI agents tailored to industry-specific operations. The collaboration will further expand across industries, including financial services, manufacturing, and software development.\n• ACI Worldwide (ACIW) announced a major step forward in the UK's payments modernization journey as a leading UK retail bank chooses ACI Connetic - the industry's first unified, cloud-native platform - for deployment. Powered by Microsoft's cloud capabilities, this milestone demonstrates strong industry confidence in ACI's next-generation platform and its ability to empower financial institutions to modernize, innovate and unlock new growth.\n• Unilever (UL) and Google Cloud (GOOG) announced a five-year partnership to accelerate Unilever's business transformation through its use of Google Cloud's advanced AI, data, platform and next-generation marketing capabilities. The partnership will help drive growth and desirability for Unilever's global brand portfolio-including iconic brands like Dove, Vaseline and Hellmann's-using Google Cloud's technologies, such as its enterprise AI platform, Vertex AI, to build new capabilities in brand discovery, measurement and AI-augmented marketing. This will create a new model for how consumer packaged goods brands are discovered and shopped, as consumer journeys shift toward more conversational and agentic experiences.\n• Amentum (AMTM) has been selected to provide missile design engineering and program management expertise to advance the UK's ambition for hypersonic strike capabilities. The Industry Mission Partner contract was awarded by Team Hypersonics UK, part of the Ministry of Defence, to accelerate weapon development and sovereign capability while bolstering collaboration with Australia and the United States through the AUKUS agreement."},{"time":"05:07","ticker":"GSK","headline":"GlaxoSmithKline launches 0.45 bln fourth tranche under 2 bln buyback program","body":"• GSK plc announced the fourth tranche of its previously authorized 2 bln share buyback programme, with up to 0.45 bln to commence immediately.\n• Co stated the overall 2 bln programme was announced in February 2025 and is scheduled to run through the end of Q2 2026.\n• The first (0.7 bln), second (0.45 bln) and third (0.3 bln) tranches have been completed in accordance with their terms.\n• With the fourth tranche, total executed or authorized buybacks under the programme now reach 1.9 bln, reflecting continued capital return to shareholders."},{"time":"05:07","ticker":"AAPL","headline":"Apple introduces a new video podcast experience on Apple Podcasts","body":"• Co announced a transformative update coming to Apple Podcasts this spring that will bring advanced video podcast capabilities to the app. This enhanced video podcast experience uses Apple's industry-leading HTTP Live Streaming technology to set a new standard that empowers podcast creators with unprecedented control and monetization opportunities while delivering the highest-quality viewing experience for users.\n• Release (potential related stocks: GOOG, GOOGL, SPOT)"},{"time":"05:06","ticker":"GSK","headline":"GlaxoSmithKline receives EU approval for Exdensur in severe asthma and CRSwNP","body":"• GSK plc announced the European Commission approved Exdensur (depemokimab) as add-on maintenance therapy for severe asthma with type 2 inflammation in patients aged 12+ and for adults with severe chronic rhinosinusitis with nasal polyps (CRSwNP).Co said Exdensur is the first ultra-long-acting biologic in the EU for respiratory diseases, dosed twice yearly, based on Phase III SWIFT and ANCHOR trials meeting primary endpoints.In severe asthma, SWIFT-1 and SWIFT-2 showed 58% and 48% reductions in annualised exacerbation rates vs placebo over 52 weeks (p<0.001), with a pooled 72% reduction in exacerbations requiring hospitalization or ED visits.In CRSwNP, ANCHOR-1 and ANCHOR-2 demonstrated statistically significant reductions in nasal polyp score and nasal obstruction vs standard of care, supporting expansion into a second respiratory indication in the EU.\n• Co said Exdensur is the first ultra-long-acting biologic in the EU for respiratory diseases, dosed twice yearly, based on Phase III SWIFT and ANCHOR trials meeting primary endpoints.\n• In severe asthma, SWIFT-1 and SWIFT-2 showed 58% and 48% reductions in annualised exacerbation rates vs placebo over 52 weeks (p<0.001), with a pooled 72% reduction in exacerbations requiring hospitalization or ED visits.\n• In CRSwNP, ANCHOR-1 and ANCHOR-2 demonstrated statistically significant reductions in nasal polyp score and nasal obstruction vs standard of care, supporting expansion into a second respiratory indication in the EU."},{"time":"04:58","ticker":"WDS","headline":"Woodside Energy Group reports 1.88 bln boe 1P reserves at year-end 2025; 2P at 3.0 bln boe","body":"• Woodside Energy Group Ltd. reported year-end 2025 proved (1P) reserves of 1,882.1 MMboe and proved plus probable (2P) reserves of 2,999.5 MMboe, with 2C contingent resources of 5,795.7 MMboe.Co's 1P reserves declined from 1,975.7 MMboe and 2P reserves from 3,092.2 MMboe at year-end 2024, reflecting production and divestments.Excluding divestments and production, 1P reserves increased by 134.1 MMboe and 2P reserves by 141.0 MMboe, driven by reservoir updates in Australia, Senegal and the U.S. and project sanctions.Co reports a proved reserves life of 8.9 years and a proved plus probable reserves life of 14.2 years at 2025 production levels.\n• Co's 1P reserves declined from 1,975.7 MMboe and 2P reserves from 3,092.2 MMboe at year-end 2024, reflecting production and divestments.\n• Excluding divestments and production, 1P reserves increased by 134.1 MMboe and 2P reserves by 141.0 MMboe, driven by reservoir updates in Australia, Senegal and the U.S. and project sanctions.\n• Co reports a proved reserves life of 8.9 years and a proved plus probable reserves life of 14.2 years at 2025 production levels."},{"time":"04:56","ticker":"WIRES","headline":"On The Wires","body":"• Smithfield Foods, Inc. (SFD) announced it has initiated the approval process to build a new state-of-the-art packaged meats and fresh pork processing facility in Sioux Falls, South Dakota.\n• GlobalFoundries (GFS) and Renesas Electronics Corporation announced an expanded strategic collaboration through a multi-billion-dollar manufacturing partnership that broadens Renesas' access to GF technologies including its differentiated technology platforms. This agreement reflects a shared commitment to secure, resilient supply chains and aligns with U.S. priorities to strengthen domestic semiconductor production for economic and national security."},{"time":"04:51","ticker":"WPM","headline":"Wheaton Precious Metals tops 2025 output guidance; guides 860k-940k GEOs in 2026, targets 1.2 mln by 2030","body":"• Wheaton Precious Metals reported 2025 production of 691,670 gold equivalent ounces, exceeding the 600,000--670,000 GEO guidance range.\n• Co guides 2026 production of 860,000--940,000 GEOs and projects ~50% growth to 1.2 mln GEOs by 2030.\n• 2025 output included 416,286 oz gold and 22.4 mln oz silver, with upside driven by stronger performance at Salobo, Peasquito and Constancia, partially offset by slower ramp-ups at Goose and Mineral Park."},{"time":"04:50","ticker":"WPM","headline":"Wheaton Precious Metals to acquire additional 33.75% Antamina silver stream from BHP for $4.3 bln","body":"• Wheaton Precious Metals will acquire BHP's 33.75% silver stream on the Antamina mine for $4.3 bln in upfront cash, increasing its total attributable stream to 67.5% of payable silver.\n• The stream is effective April 1, 2026, with Wheaton purchasing 33.75% of payable silver until 100 Moz are delivered, then 22.5% for life of mine, at ongoing payments equal to 20% of spot silver.\n• The transaction is expected to add ~6.0 Moz of attributable silver annually over the first five years and increase 2026 production by 11.3% on a pro forma basis, while boosting Proven and Probable reserves by 66 Moz.\n• The $4.3 bln deposit will be funded with ~$1.9 bln cash on hand, a new $1.5 bln term loan and ~$0.9 bln draw on the existing revolving credit facility, with net debt at closing projected at ~$2.4 bln."},{"time":"04:47","ticker":"AHH","headline":"Armada Hoffler unveils bold new strategic direction to drive long-term shareholder value and launches as AH Realty Trust","body":"Executing a fundamental business restructuring to eliminate complexity, strengthen the balance sheet, and relentlessly focus on operating a streamlined real estate platform:Click here for full release."},{"time":"04:46","ticker":"AHH","headline":"Armada Hoffler reports fourth quarter 2025 results","body":"Normalized FFO of $0.29 Per Diluted Share for the Fourth Quarter and $1.08 per Diluted Share for the Full YearClick here for full release."},{"time":"04:42","ticker":"SON","headline":"Sonoco Products beats by $0.05, reports revs in-line; guides FY26 EPS in-line","body":"• Reports Q4 (Dec) earnings of $1.05 per share, $0.05 better than the FactSet Consensus of $1.00; revenues rose 29.7% year/year to $1.77 bln vs the $1.76 bln FactSet Consensus.\n• Co issues in-line guidance for FY26, sees EPS of $5.80-6.20 vs. $5.96 FactSet Consensus.Co sees FY26 revs of $7.25-7.75 bln vs $7.46 bln consensus\n• Co sees FY26 revs of $7.25-7.75 bln vs $7.46 bln consensus"},{"time":"04:38","ticker":"H","headline":"Hyatt Hotels announces chairman transition as Pritzker retires; CEO Hoplamazian assumes dual role","body":"• Hyatt Hotels announced that Thomas J. Pritzker retired as Executive Chairman effective immediately and will not seek re-election at the May annual meeting.Mark S. Hoplamazian, Hyatt's President and CEO, was appointed Chairman of the Board, combining the chairman and CEO roles.Pritzker has served on the Board since 2004 and held senior executive and chairman responsibilities dating back to 1980 at predecessor entities.The leadership transition is effective immediately and does not involve changes to Hyatt's stated strategy or operations.\n• Mark S. Hoplamazian, Hyatt's President and CEO, was appointed Chairman of the Board, combining the chairman and CEO roles.\n• Pritzker has served on the Board since 2004 and held senior executive and chairman responsibilities dating back to 1980 at predecessor entities.\n• The leadership transition is effective immediately and does not involve changes to Hyatt's stated strategy or operations."},{"time":"04:34","ticker":"WIRES","headline":"On The Wires","body":"• Voyager Technologies (VOYG) announced a strategic partnership with ATMOS Space Cargo, a leading provider of free-flying orbital cargo and return services, expanding access to space for scientific discovery and technology advancement. Under the signed memorandum of understanding, Voyager Europe will serve as ATMOS' integration and implementation partner, while ATMOS will provide free-flying orbital vehicles with controlled and precise return capability, enabling end-to-end microgravity missions from launch through on-orbit operations and return to Earth. Both companies will mutually refer customers and mission opportunities across their networks.\n• Westlake Royal Building Products, a Westlake company (WLK), is expanding its line of TruExterior Siding & Trim with the addition of a 5/8\" Lap Siding profile. The new profile combines the coveted appearance and shadow lines of traditional lap siding with the high-performance attributes of TruExterior's poly-ash material. It has a true 5/8\" butt and a sought-after aesthetic that mimics real cedar.\n• TRU Simulation + Training Inc., a Textron Inc. (TXT) company, and an affiliate of Textron Aviation, announced today its Full Flight Simulator for the Cessna Citation Ascend has achieved Federal Aviation Administration Level D qualification. This milestone significantly enhances advanced training options for midsize jet pilots, delivering a highly immersive and true-to-life training environment on the recently FAA certified Citation Ascend. European Union Aviation Safety Agency qualification is anticipated in 2026, further extending the simulator's global reach.\n• Westlake Royal Building Products, a Westlake company (WLK), announced the launch of TrendLine, a data-driven digital experience designed to decode the shifting design preferences of the modern homeowner. The 2026 trend forecast reveals a pivot toward intentional design choices, favoring warm neutrals, natural textures and products that prioritize emotional well-being and structural resilience.\n• Norwegian Cruise Line Holdings Ltd. (NCLH), a global cruise company operating Norwegian Cruise Line, Oceania Cruises, and Regent Seven Seas Cruises, announced that it has entered into an agreement with Fincantieri for the design and construction of three new cruise ships, further advancing the company's long-term fleet development strategy across its brands. The order includes one ship for each of the Company's three award-winning brands-Norwegian Cruise Line, Oceania Cruises, and Regent Seven Seas Cruises-with one vessel to be built as a sister ship to Oceania Sonata, one as a sister ship to Seven Seas Prestige, and one as a sister ship to the previously announced Norwegian Cruise Line newbuilds order. All three ships will be built at Fincantieri's shipyards in Italy and delivered between 2036 and 2037."},{"time":"04:32","ticker":"LHX","headline":"L3Harris wins ~$400 mln contract for THAAD propulsion systems","body":"• L3Harris Technologies secured a nearly $400 mln contract to produce additional solid rocket boost motors and Liquid Divert and Attitude Control Systems (LDACS) for the Missile Defense Agency's THAAD system.\n• L3Harris supplies propulsion components as a subcontractor supporting the prime contractor for THAAD, a key U.S. defense against short-, medium- and intermediate-range missiles."},{"time":"04:30","ticker":"GE","headline":"GE Aerospace: United Airl (UAL) orders 300 GEnx engines from GE Aerospace for 787 fleet expansion","body":"• United Airlines selected 300 GEnx engines from GE Aerospace to power new Boeing 787 Dreamliners, with the agreement also including spare engines.\n• GE Aerospace expects the order to bring United's 787 fleet to more than 200 GEnx-powered aircraft, making United the largest GEnx operator globally.\n• GE Aerospace's firm GEnx backlog increases to nearly 1,800 future deliveries plus spares following this order.\n• The GEnx engine has accumulated more than 70 mln flight hours and powers about two-thirds of 787 aircraft currently in operation."},{"time":"04:28","ticker":"ZIM","headline":"ZIM Integrated Shipping to be acquired by Hapag-Lloyd for $35 per share in $4.2 bln cash deal","body":"• ZIM Integrated Shipping Services Ltd. agreed to be acquired by Hapag-Lloyd for $35.00 per share in cash, valuing the equity at approximately $4.2 bln.\n• The offer represents a 58% premium to the prior closing price, a 90% premium to the 90-day VWAP, and a 126% premium to the unaffected price of $15.50 on Aug. 8, 2025.\n• FIMI Opportunity Funds will form a new Israeli liner company, \"New ZIM,\" with 16 vessels to serve key trade routes into Israel and assume Special State Share obligations, with commercial support from Hapag-Lloyd.\n• The transaction was unanimously approved by ZIM's board and is expected to close by late 2026, subject to shareholder, regulatory, and State of Israel approvals; upon closing, ZIM shares will be delisted."},{"time":"04:26","ticker":"CAG","headline":"Conagra reaffirms FY26 guidance ahead of CAGNY Presentation","body":"• Co reaffirms guidance for FY26 (May), sees EPS of $1.70-1.85 vs. $1.72 FactSet Consensus.Co also reaffirms Organic net sales change of (1)% to 1% compared to fiscal 2025 Adjusted operating margin between ~11.0% and ~11.5%\n• Co also reaffirms Organic net sales change of (1)% to 1% compared to fiscal 2025\n• Adjusted operating margin between ~11.0% and ~11.5%\n• Additionally, the company now expects free cash flow conversion to be approximately 100% for the full year, an increase from its previous expectation of approximately 90%."},{"time":"04:24","ticker":"AEP","headline":"American Electric: Transource Energy and FirstEnergy Transmission Joint Venture Receive Approval for Major Electric Transmission Project in Central Ohio","body":"COLUMBUS, Ohio, Feb. 16, 2026 /PRNewswire/ -- Regional grid operator PJM Interconnection has selected a major electric transmission project to meet a critical infrastructure need in central Ohio. Jointly developed by Transource Energy, LLC (a partnership between American Electric Power Company, Inc and Evergy, Inc.) and FirstEnergy Transmission, LLC the project will help support rising electricity demand and ongoing economic growth in the fast-growing Columbus region.Click here for full release."},{"time":"04:20","ticker":"WIRES","headline":"On The Wires","body":"• TTEC Holdings, Inc. (TTEC) announced the expansion and growing enterprise adoption of its AI-driven frontline performance ecosystem, anchored by TTEC RealSkill and TTEC Perform. Built to bridge the gap between AI investment and real business outcomes, the integrated ecosystem enables organizations to operationalize AI across the associate lifecycle-from onboarding and skill development to coaching and real-time performance execution.\n• The United States Olympic & Paralympic Committee announced the Team USA Athlete Recovery Program in partnership with Lilly (LLY), reinforcing a shared commitment across multiple years to fostering athlete health, recovery, and well-being beyond competition. As presenting partner, Lilly will support access to the Team USA Athlete Recovery Program following the Olympic and Paralympic Winter Games Milano Cortina 2026 and through the LA28 Olympic and Paralympic Games. This partnership underscores Lilly's long-term commitment to Team USA, building on their role as an Official Partner in Health Equity.\n• Cloudvirga, a Stewart (STC) -owned provider of digital point-of-sale platforms for lenders, today announced a certified integration with the Optimal Blue PPE that brings real-time pricing and eligibility data to its Loan Hub, enabling loan teams to produce consumer-ready pricing scenarios at both the lead stage and throughout an active loan file. Cloudvirga's Loan Hub gives origination teams a centralized workspace for managing pipelines, collaborating with borrowers and completing tasks. With this integration, the Loan Hub supports real-time pricing directly within the workflows loan teams use.\n• The Riyadh Air Metropolitano Stadium, home of Atltico de Madrid, is advancing its technological transformation with the implementation of a new intelligent, self-driving network infrastructure based on HPE (HPE) Networking solutions. The project, divided into two phases over the 2025/26 and 2026/27 seasons, completely modernizes the stadium's communications system and marks the beginning of a new era in the digitalization of sports infrastructures in Europe. The new network will replace the current infrastructure, which has been in operation for eight seasons, and will feature over 1,500 next-generation Wi-Fi 7 wireless access points managed through HPE Aruba Central.\n• Westlake Royal Building Products, a Westlake company (WLK), announced the launch of its newly redesigned website, delivering a unified digital experience that brings all of its product brands together under one comprehensive platform. The enhanced site also introduces Design Canvas, an intuitive home design tool that empowers homeowners, designers and building professionals to plan and visualize exterior projects with ease."},{"time":"04:12","ticker":"CMPS","headline":"Compass Pathways to announce new clinical data from two ongoing Phase 3 Trials","body":"Compass Pathways plc (Nasdaq: CMPS), a biotechnology company dedicated to accelerating patient access to evidence-based innovation, announced that tomorrow it will report new clinical data from two ongoing Phase 3 trials evaluating COMP360, a synthetic, proprietary formulation of psilocybin, for treatment-resistant depression (TRD). The company will be disclosing new clinical data from Part A and Part B from COMP005 and Part A from COMP006. The results are scheduled for release on February 17th at 6:30 am ET, followed by a webinar hosted by Compass management at 8:00 am ET.Click here for full release."},{"time":"04:11","ticker":"WIRES","headline":"On The Wires","body":"• Ericsson (ERIC), international defense company Leonardo, and the Italian Navy have conducted a maritime connectivity test using an Ericsson 5G Standalone system. The trial was successfully completed, enabling connectivity between naval units engaged in a day and night training scenario on the open sea. A completely self-contained end-to-end Ericsson 5G SA network - comprising Ericsson Ultra Compact Core and Ericsson Massive MIMO Radio Access Network products and solutions - was installed on board the Italian Navy's amphibious landing ship San Giorgio, which served as the lead unit during a recent experimentation campaign. Ericsson 5G SA customer premises equipment was installed on board a second unit of the Italian Navy - the Multi-Purpose Combat Ship Raimondo Montecuccoli.\n• Brown & Brown, Inc. (BRO) announced that Dorothea Henderson has been appointed chief information technology officer. She will lead the company's enterprise technology strategy and oversee initiatives to improve digital capabilities and enhance the technology experience for teammates and customers. In this role, Henderson will work with segment and functional leaders to enhance teammate tools and processes, drive a companywide data and artificial intelligence strategy, strengthen system reliability and security, support technology integration for acquisitions, accelerate digital capabilities and continue building a world-class technology team.\n• Bio-Techne Corporation (TECH) announced that the Ella benchtop immunoassay platform has received CE-IVD marking1 and is now available for sale in the European Union. This achievement brings Ella's hallmark ease of use, speed and reproducibility to clinical settings, helping laboratories streamline workflows and support timely decision-making. Ella is a compact, cartridge-based immunoassay system that delivers accurate biomarker results in under 90 minutes with minimal hands-on time. By simplifying the manual steps of traditional immunoassays, Ella reduces operator variability and provides high-quality, reproducible data suitable for both translational research and clinical applications.\n• Rockwell Automation (ROK) announced that it has achieved significant time savings, improved project accuracy and reduced operational costs for Falcare Industrial Equipment in Sao Caetano do Sup in Brazil.\n• Chevron Corporation (CVX), via its four Dutch subsidiaries, together with HELLENiQ ENERGY has today signed Lease Agreements with the Hellenic Republic which will enable exploration of four blocks offshore Greece. The blocks are located south of Crete (South Crete 1, South Crete 2) and within the Peloponnese (South of Peloponnese, and Block A2). The awarded consortium, in which Chevron holds a 70% operating interest and HELLENiQ ENERGY a 30% interest, was selected following an international call for tender launched by the Greek government in 2025."},{"time":"04:09","ticker":"LLY","headline":"Eli Lilly reports Phase 3 adjuvant win for Retevmo in early-stage RET+ NSCLC","body":"• Eli Lilly and Company said Phase 3 LIBRETTO-432 met its primary endpoint, with Retevmo (selpercatinib) significantly improving event-free survival vs placebo in stage II--IIIA RET fusion-positive NSCLC.The trial showed a statistically significant and clinically meaningful reduction in risk of recurrence or death; overall survival trended favorably but remains immature.Safety was consistent with prior selpercatinib studies; detailed data will be presented at a medical congress and discussed with regulators.Results expand Retevmo's potential use into early-stage disease and reinforce genomic testing in NSCLC, where RET fusions occur in ~1--2% of cases.\n• The trial showed a statistically significant and clinically meaningful reduction in risk of recurrence or death; overall survival trended favorably but remains immature.\n• Safety was consistent with prior selpercatinib studies; detailed data will be presented at a medical congress and discussed with regulators.\n• Results expand Retevmo's potential use into early-stage disease and reinforce genomic testing in NSCLC, where RET fusions occur in ~1--2% of cases."},{"time":"04:03","ticker":"WIRES","headline":"On The Wires","body":"• Rio Tinto (RIO) is deeply saddened to confirm the death of an employee of a contracting company following an incident at the SimFer mine site in Nzrkor, Guinea on Saturday 14 February. Work and activity at the SimFer mine site has been suspended and support, including counselling, is being provided to impacted team members.\n• Cognizant (CTSH) announced a new phase in its strategic partnership with Google (GOOG) Cloud, advancing from platform integration to enterprise-scale execution to help organizations operationalize agentic AI in real-world environments. Building on the recently announced collaboration to adopt Gemini Enterprise, Cognizant is combining enterprise-wide internal deployment, commercial execution and scaled delivery investments to turn the potential of agentic AI into measurable business outcomes. As part of this next phase in the partnership, Cognizant has invested in, and is deploying, Google Workspace alongside Gemini Enterprise internally, with the goal of enhancing productivity, employee experience and delivery velocity across the enterprise.\n• AMD (AMD) and Tata Consultancy Services have expanded their strategic collaboration. TCS, through its subsidiary HyperVault AI Data Center Limited, and AMD will codevelop a rack-scale AI infrastructure design based on the AMD \"Helios\" platform in support of India's national AI initiatives. Powered by AMD Instinct MI455X GPUs, next-generation AMD EPYC \"Venice\" CPUs, AMD Pensando Vulcano NICs and the open ROCm software ecosystem, \"Helios\" is purpose-built to deliver a rack-scale AI platform supporting sovereign AI factories.\n• Klarna (KLAR) is now available on Google Pay in the UK. Google Pay users in the U.K. can choose Klarna's interest-free payment options at checkout."}],"fetchedAt":1771335327044},"savedAt":1771335327045}