{"data":{"updated":"2/9/2026, 2:04:51 PM","entries":[{"time":"09:55","ticker":"XOMA","headline":"XOMA Royalty Corporation completed previously announced tender offer to acquire all outstanding shares of Generation Bio Co. (GBIO) common stock for $4.2913 in cash plus CVR; successfully completes acquisition of Generation Bio\n                (23.69 -1.17) Following the closing of the tender offer, a subsidiary of the Company, XRA 7 Corp., merged with and into Generation Bio, and all shares of Generation Bio common stock that had not been validly tendered and irrevocably accepted for purchase w","body":"ere converted into the right to receive the Offer Price without interest. As a result of the Merger, Generation Bio became a wholly owned subsidiary of XOMA Royalty. Following the closing of trading on The Nasdaq Stock Market LLC on February 6, all shares of Generation Bio common stock ceased trading on Nasdaq, and the Company and Generation Bio intend promptly to cause such shares to be delisted from Nasdaq and deregistered under the Securities Exchange Act of 1934, as amended."},{"time":"09:34","ticker":"CNP","headline":"CenterPoint and Resilient Structures announce strategic long-term supply agreement to strengthen Greater Houston grid \n                (40.00 -0.04) Resilient Structures announces a long-term supply agreement with CenterPoint Energy (CNP), an industry-leading Texas-based electric and natural gas utility serving more \nthan seven million metered customers in six \nstates. This strategic agreement strengthens the relationship between \nthe two companies as they support CenterPoint's Greater Houston R","body":"esiliency \nInitiative, a critical effort dedicated to hardening the region's energy \ninfrastructure against extreme weather.RS will significantly expand its  Humble, Texas, \noperations to fulfill the requirements of the supply agreement and meet the growing infrastructure \ndemands of the region. RS projects that the expansion of its local manufacturing \nand logistics capabilities will create more than 200 new jobs in the community, \nrepresenting a major economic commitment to the Houston area. This expansion is directly \naligned with CenterPoint's goal to develop \nthe most resilient coastal grid in the nation, delivering reliable power to 2.9  million customers in Greater Houston. The agreement delivers a dedicated, locally-sourced supply of high-performance infrastructure materials essential for grid hardening. By shortening the supply chain, CenterPoint and RS aim to accelerate the deployment of storm-hardened structures across CenterPoint's 12-county service territory."},{"time":"09:31","ticker":"VZLA","headline":"Vizsla Silver Corp. reports that it has been informed by a number of families that their relatives, our colleagues, who were taken from the Company's project site in Concordia, Mexico, have been found deceased\n                (4.25 -0.35) The Company is awaiting confirmation from the Mexican authorities and will provide further updates as appropriate.","body":""},{"time":"09:31","ticker":"WIRES","headline":"On The Wires Osisko Development Corp. (ODV)  announces that its wholly-owned \nsubsidiary, Barkerville Gold Mines Ltd., has entered into a definitive Project and Construction Management Services  Agreement with JDS Energy & Mining Inc. for the development of the Cariboo Gold Project, located in British Columbia.LightPath Technologies (LPTH) has secured a $9.6 million \npurchase order for cooled infrared cameras \nfrom an existing defense customer for use in defense and security applications, \nwith ","body":"deliveries expected throughout \ncalendar year 2026.Voyager Technologies (VOYG) was awarded a new Indefinite Delivery/Indefinite Quantity contract for NASA's Johnson Space Center, with a ceiling of $24.5 million for a four-year period, to provide full-service mission management services to the International Space Station."},{"time":"09:29","ticker":"WLFC","headline":"Willis Lease announces the establishment of an industry-first program developed in collaboration with CFM International, with the goal of extending the operational life of CFM56-5B and CFM56-7B engines","body":"\n                (200.18 )"},{"time":"09:28","ticker":"NAT","headline":"Nordic American Tanker has entered into a sales agreement for a 2003-built suezmax tanker\n                (4.26 ) The sales price of the ship is $25 million net \nto the Company and the ship has no debt.","body":""},{"time":"09:28","ticker":"FSNUY","headline":"Fresenius SE and Phlow partner to strengthen U.S. supply of essential medicine\n                (14.74 ) Co entered a first of its kind partnership with U.S.\nmanufacturer Phlow Corp. to establish a fully domestic, end to end supply chain\nfor Epinephrine Injection, USP - an FDA designated essential medicine\nfrequently at risk of shortage in the United States.Under the collaboration, Phlow will\nproduce the U.S.-based API, while Fresenius Kabi manufactures the finished\ndoses for hospitals and clinic","body":"s across the country. With this initiative,\nFresenius advances its local for local manufacturing strategy and supports\nnational efforts to strengthen pharmaceutical security. The partnership\nreinforces the ambitions of #FutureFresenius as it expands Fresenius' role as a\nleading global provider of lifesaving therapies, advancing resilient\nmanufacturing that improves patient care and health system stability.Pending regulatory approvals,\nepinephrine produced through this collaboration could be available to U.S.\nhospitals in 2027."},{"time":"09:25","ticker":"NRGV","headline":"Energy Vault and Peak Energy announce strategic development agreement to develop sodium ion storage solution for 'AI-First Data Center Operators'; includes 1.5 GWh supply agreement to accelerate global deployment and reduce costs\n                (4.21 ) WESTLAKE VILLAGE, Calif. & BROOMFIELD, Colo.--(BUSINESS WIRE)-- Energy \nVault Holdings, Inc. (NYSE: NRGV) (\"Energy \nVault\" or \"the Company\"), a leader in sustainable grid-scale energy storage and \nAI power infrastructure, and Peak Energy (\"Peak\")","body":", the first American manufacturer of sodium-ion energy \nstorage systems, today announced a comprehensive strategic partnership.Click here for full release."},{"time":"09:22","ticker":"IMPP","headline":"Imperial Petroleum Board authorized officers to repurchase, from time to time, up to $10 mln of common stock","body":"\n                (3.33 )"},{"time":"09:19","ticker":"HZO","headline":"MarineMax: The Donerail Group issues open letter to MarineMax shareholders \n                (29.98 ) The Donerail Group issued an open letter to the Company's \nshareholders further discussing its $35.00 \nall-cash offer to acquire the Company, its \nrecent engagement with the Company, and its intention to vote AGAINST the \nelection of CEO Brett McGill as a Director \nat the Company's upcoming 2026 Annual Meeting scheduled to be held on March 3, \n2026.The Donerail Group, one of the largest sharehold","body":"ers of MarineMax (HZO), \nbeneficially owning over 4% of MarineMax's outstanding shares."},{"time":"09:12","ticker":"WRAPX","headline":"S&amp;P futures vs fair value: -17.00. Nasdaq futures vs fair value: -94.00. The stock market is on track for a modestly lower opening after a notable rebound rally on Friday. Apollo Global Management (APO 135.00, +1.97, +1.5%) is nicely higher in the premarket after its earnings report this morning despite missing on revenues.  The Information reports that the company is close to a $3 billion chip funding deal connected to xAI.","body":""},{"time":"09:10","ticker":"ALX","headline":"Alexander's announces fourth quarter financial results\n                (255.07 ) PARAMUS, N.J., Feb.  09, 2026  (GLOBE NEWSWIRE) -- ALEXANDER'S, INC. (New York Stock Exchange: ALX) filed its Form 10-K for the year ended December 31, 2025 today and reported:Click here for full release.","body":""},{"time":"09:09","ticker":"WIRES","headline":"On The Wires Equator, an Altisource (ASPS) business unit and a leading SaaS platform for residential real estate management announced that Statebridge Company, a mortgage servicer specializing in non-agency, GSE portfolios and Business Purpose loans, has selected Equator as its platform to manage REO operations.Fastenal Company (FAST) is launching a significant evolution to its partnership with RFK Racing. The iconic Fastenal blue paint scheme will be replaced with the striking black and orange ","body":"colors of their Body Guard brand, aiming to increase awareness and engagement with this essential line of safety products."},{"time":"09:08","ticker":"AON","headline":"Aon and KNIAZHA VIENNA INSURANCE GROUP announce a new $25 mln reinsurance facility agreement with the U.S. International Development Finance Corporat\n                (342.04 ) Comprehensive $25 mln reinsurance facility will \nenable KNIAZHA VIG to deliver comprehensive, innovative war-risk insurance \nsolutions to SMEs and private individuals across Ukraine. Builds on Aon's efforts to support Ukraine's economy, insurance industry and preparation \nfor reconstruction -- now representing more than $4","body":"90M in public and private capital for war risk \ninsurance. Collaboration underscores KNIAZHA VIG's \ncommitment to supporting Ukraine's economic recovery by mitigating \nconflict-related risks and catalyzing private investment."},{"time":"09:06","ticker":"VLRS","headline":"Volaris Aviation reports January 2026 traffic results: load factor of 85%\n                (10.45 ) In January, Volaris' ASM capacity increased 4.3%, while RPMs for the month grew 2.1%. Mexican domestic RPMs declined 1.1%, while international RPMs increased 6.7%. Consolidated load factor decreased by 1.8 percentage points year-over-year to 84.8%. During the month, Volaris transported 2.7 million passengers.Enrique Beltranena, Volaris' President and CEO, said: \"We began the year with traffic trend","body":"s consistent with those observed during the fourth quarter across our network. Domestic passenger volumes were broadly stable year-over-year, while international capacity added since mid-2025 continued to mature, with performance reflecting sequential improvement in VFR demand. Looking ahead, we will remain disciplined in deploying and managing capacity to match demand and support profitability throughout 2026.\""},{"time":"09:06","ticker":"JACK","headline":"Jack In The Box: : Egan-Jones recommends withhold votes on Jack In The Box directors following -76% shareholder return\n                (21.14 -1.63)","body":""},{"time":"09:05","ticker":"CCCX","headline":"Churchill Capital Corp X: Infleqtion has executed its contract with the U.S. Department of Energy's Advanced Research Projects Agency-Energy, formally launching development under its $6.2 million Enhancing Neutral-atom Computers for Optimizing Delivery of Energy project\n                (11.66 ) This program, which includes key collaborations with Argonne National \nLaboratory, the National Laboratory of the Rockies, EPRI, and ComEd, is \nthe first quantum project for the department focusing on adv","body":"ancing \nthe application of quantum-enhanced \ncomputational methods to revolutionize energy grid optimization. This \nannouncement follows Infleqtion's plans to go public through a merger with Churchill Capital Corp X (CCCX)."},{"time":"09:04","ticker":"CRML","headline":"Critical Metals Corp. Nasdaq-CRML announces multiple extensions to known resources &amp; multiple new ultra high-grade mineralization results of 27.0% heavy ree's for the 2025 drilling campaign for area b, fjord &amp; others with immediate near-term growth potential &amp; 2026 drilling target selection\n                (11.02 ) NEW YORK, Feb.  09, 2026  (GLOBE NEWSWIRE) -- Critical Metals Corp. (Nasdaq: CRML) (\"Critical Metals Corp\" or the \"Company\"), a leading critical minerals mining company, t","body":"oday announced that it has received the final assay results from the 2025 drilling program at Area B and the Fjord Deposit at the Tanbreez Rare Earths Project in Greenland.Click here for full release."},{"time":"09:04","ticker":"FBLA","headline":"FB Bancorp, Inc. announced the authorization of a program to repurchase up to 1,785,375 shares of its outstanding common stock","body":"\n                (13.65 )"},{"time":"09:03","ticker":"TLSI","headline":"TriSalus Life Sciences announces changes to its Board of Directors\n                (4.75 ) TriSalus announced that Dr. Arjun \"JJ\" Desai, a member of the Board since \nAugust of 2023, has elected to resign from the Board. The Company and the Board \nexpressed their sincere appreciation for Dr. Desai's service and contributions \nduring his tenure. Concurrently, TriSalus announced that Michael P. Stansky has been appointed to the Company's Board of Directors, \neffective February 4, 2026.Mr. Stansky b","body":"rings 40 years of investment management and healthcare \nexperience, advising and serving on the boards of numerous public and private \nhealthcare companies. Most recently, Mr. Stansky served as a Managing Director \nat Tudor Investment Corporation, a global investment management firm, where he \nhelped form the firm's equity investment group and was responsible for \nlong/short equity, crossover, and venture investments. Prior to Tudor, Mr. \nStansky was an analyst and portfolio manager at Wellington Management Company."},{"time":"09:03","ticker":"WTW","headline":"Willis Towers Watson releases next-generation U.S. Library models in RiskAgility Financial Modeler, delivering full VM-22 capability for life insurers","body":"\n                (330.04 )"},{"time":"09:02","ticker":"WRAPX","headline":"S&amp;P futures vs fair value: -13.00. Nasdaq futures vs fair value: -76.00. The S&P 500 futures currently trade 13 points below fair value.Equity indices in the Asia-Pacific region began the week on a higher note with Japan's Nikkei (+3.9%) soaring to a fresh record after a snap election resulted in supermajority for Prime Minister Takaichi's LDP even before factoring the seats that were won by LDP's coalition partner Ishin. The win puts the prime minister in position to implement her economic ","body":"agenda. Finance Minister Katayama attempted to assuage investors by saying that there will be no additional bond issuance to fund the prime minister's agenda. Elsewhere, Thailand's election produced a three-way deadlock that was largely expected. China has resumed some rare earth exports to Japan while Australia placed a 10% tariff on steel imports from China. In economic data: Japan's December Overall Wage Income 2.4% yr/yr (expected 3.0%; last 1.7%). December Current Account surplus JPY2.70 trln (expected surplus of JPY2.95 trln; last surplus of JPY3.14 trln). January Bank Lending 4.5% yr/yr, as expected (last 4.3%) and January Economy Watchers Current Index 47.8 (expected 49.1; last 47.7) ---Equity Markets--- Japan's Nikkei: +3.9% Hong Kong's Hang Seng: +1.8% China's Shanghai Composite: +0.1% India's Sensex: +0.6% South Korea's Kospi: +4.1% Australia's ASX All Ordinaries: +2.0%Major European indices trade on a mostly higher note while the U.K.'s FTSE (-0.3%) underperforms with financials contributing to the weakness. Speculation is on the rise that British Prime Minister Starmer could be ousted after his unimpressive visit to China and growing focus on his knowledge of Lord Mandelson's ties to Jeffrey Epstein. A weekend election in Spain resulted in a rightward shift with Prime Minister Sanchez's Socialist party seeing its support fall to 24.5% from 29.5%. In Portugal, Socialist Jose Seguro was elected president.  In economic data: Eurozone's February Sentix Investor Confidence 4.2 (expected -0.2; last -1.8) Swiss Q1 SECO Consumer Climate -30, as expected (last -37) ---Equity Markets--- STOXX Europe 600: +0.1%Germany's DAX: +0.5% U.K.'s FTSE 100: -0.4%France's CAC 40: +0.1%Italy's FTSE MIB: +1.4% Spain's IBEX 35: +0.5%"},{"time":"09:01","ticker":"CART","headline":"Instacart announces its first nationwide pure-play floral partnership with floral authority 1-800-Flowers.com (FLWS)\n                (34.64 ) 1-800-Flowers.com is the first pure-play floral partnership to join the Instacart App, offering quick, on-demand delivery just in time for Valentine's Day.","body":""},{"time":"08:56","ticker":"WAL","headline":"Western Alliance Bancorp and Peachtree Group announce that the Bank is providing a $50 million warehouse funding facility to support the expansion of Peachtree's Equipment Finance division to deliver flexible capital solutions to businesses nationwide\n                (94.39 ) The new facility, which builds on the already significant relationship between both companies, will enable Peachtree to fund the origination and acquisition of equipment finance loans across various industries, strengthenin","body":"g its balance sheet and positioning the Equipment Finance platform for growth in a competitive market."},{"time":"08:53","ticker":"PLBY","headline":"Playboy, Inc. has entered into definitive agreements to sell 50% of its China business to UTG Brands Management Group\n                (1.59 ) Upon closing, UTG will manage all operational aspects of Playboy's business activities in China, Hong Kong and Macau.Under the terms of the agreements, Playboy will receive $122 million in total cash, including $45 million payable over two years in exchange for UTG's acquisition of a 50% interest in the joint venture for Playboy's China business (the \"JV\")","body":", $67 million in guaranteed minimum distribution payments over eight years, and $10 million in brand support payments over the next three years. In addition to the annual guaranteed minimum distribution payments to Playboy, which will equal or exceed its current net cash flows from China, Playboy expects to receive incremental annual distributions from its remaining ownership in the JV as UTG grows the business. UTG has paid a $9 million deposit against the purchase price, and the initial closing of the transaction is expected to occur by March 31, 2026, subject to customary closing conditions.Playboy will use a minimum of $50 million of the proceeds from the transaction to further de-leverage its balance sheet. Including the anticipated reduction in interest expense, the Company expects the transaction to be immediately accretive to earnings."},{"time":"08:42","ticker":"WAT","headline":"Waters completes combination with the Biosciences &amp; Diagnostic Solutions businesses of Becton, Dickinson and Company (BDX)\n                (381.29 ) Announces appointment of Claire M. Fraser, Ph.D., to its Board of Directors.Forms a global life sciences and diagnostics leader focused on high-volume testing in regulated applications.Announces formation of four divisions: Waters Analytical Sciences, Waters Biosciences, Waters Advanced Diagnostics, and Waters Materials Sciences.","body":""},{"time":"08:41","ticker":"WIRES","headline":"On The Wires ARIA Cybersecurity, a CSPi business (CSPI), and Acronis addressed the Operational Technology industry's greatest current challenge - the forced migration of up to millions of industrial automation endpoints running on Windows 10 to Windows 11 with no return on that investment.Silicom Limited (SILC) announced that an existing customer, a Tier-1 cyber security leader, has selected one of its Edge systems as the platform for its next generation of a high-end product line. To date, init","body":"ial orders of over $1M have been received for delivery in 2026, and quantities are expected to ramp to approximately $2 million per year. In parallel, discussions continue about additional products for the customer's additional product lines."},{"time":"08:38","ticker":"WIRES","headline":"On The Wires Ondas (ONDS) announced that its smart demining subsidiary, 4M Defense, has been awarded a large-scale multi-year demining program in Israel, after winning with a tender valued at over $30 million. The project will be executed based upon defined project milestones, with an initial execution period of up to three years and options for extensions and scope expansion.TD Bank (TD) announced the launch of its new brand platform -- More\nHuman -- a significant milestone that reflects how th","body":"e Bank's\nstrategy, culture and customer experience come together to deliver for clients\nin a digital-first world. The platform unifies TD under a single identity\nacross Canada and the United States for the first time, reinforcing the Bank's\ncommitment to creating simpler, more intuitive experiences shaped around\npeople's needs."},{"time":"08:37","ticker":"JKHY","headline":"Jack Henry increases quarterly dividend 6% to $0.61/share","body":"\n                (173.36 )"},{"time":"08:37","ticker":"BRR","headline":"ProCap Financial strengthens balance sheet through strategic deleveraging and share repurchases\n                (2.17 ) Co announces significant balance sheet improvements following the company's share repurchases, debt reduction, and continued Bitcoin accumulation.The company has executed a comprehensive deleveraging strategy that included repurchasing approximately $135 million of its convertible notes for $119 million today. The company has repurchased approximately 2% of its outstanding comm","body":"on stock since December 2025. Additionally, ProCap Financial's treasury operations generated non-dilutive yield that enabled the acquisition of six Bitcoin."},{"time":"08:37","ticker":"NAGE","headline":"Niagen Bioscience is the premiere sponsor of the inaugural 'NAD for Health: Opportunities &amp; Challenges' conference hosted by the University of Copenhagen\n                (5.20 ) Taking place March 23-25, 2026, this three-day scientific forum will convene the world's foremost NAD experts in Copenhagen to advance evidence-based dialogue and accelerate clinical translationClick here for full release.","body":""},{"time":"08:35","ticker":"GOAI","headline":"EVA Live CEO signals confidence as company focuses on disciplined growth\n                (3.31 ) Los Angeles, CA, Feb.  09, 2026  (GLOBE NEWSWIRE) -- EVA Live, Inc. (Nasdaq: GOAI), an AI-driven digital advertising company, today released the following letter from its Founder and Chief Executive Officer outlining the Company's strategic direction, capital priorities, and focus on long-term shareholder value.Click here for full release.","body":""},{"time":"08:35","ticker":"EXE","headline":"Expand Energy appoints Michael Wichterich as interim CEO; reaffirms guidance\n                (110.37 ) Michael Wichterich, Chairman of the Board, has been appointed Interim President and Chief Executive Officer, succeeding Domenic (Nick) J. Dell'Osso, Jr. Dell'Osso has stepped down as a director of the Board and will serve as an external advisor for a period of time to ensure a smooth transition. The Board is commencing a search for a permanent CEO with the assistance of an independent recruitme","body":"nt firm.Co also plans to relocate its corporate headquarters from Oklahoma City, Oklahoma, to Houston, Texas, in mid-2026.As part of this announcement, the company reaffirmed its synergy, capital and operating outlook for the fourth quarter and full year 2025 as set forth in its third quarter 2025 earnings announcement."},{"time":"08:33","ticker":"NVTS","headline":"Navitas Semiconductor unveils a breakthrough 10 kW DC-DC power platform delivering up to 98.5% peak efficiency and 1 MHz switching frequency, enabling unprecedented power density to support the rapid, large-scale expansion of next-generation AI data centers\n                (8.86 ) Industry-leading high-power-density full-brick DC-DC platform leveraging latest 650 V and 100 V GaNFast FETs to deliver unmatched efficiency, power density, and performance for 800 V DC and +/-400 V architectures.","body":""},{"time":"08:31","ticker":"BMNR","headline":"Bitmine Immersion Technologies announces ETH Holdings reach 4.326 million tokens, and total crypto and total cash holdings of $10.0 billion\n                (20.45 ) Bitmine has 2,873,459 staked ETH, representing $6.2 billion at $2,125 per ETH; MAVAN staking solution on track to launch Q1 2026. Bitmine now owns 3.58% of the ETH token supply, over 72% of the way to the 'Alchemy of 5%' in just 6 months. Bitmine recently closed on initial $200 million investment into Beast Industries. Bitmine Crypto","body":" + Total Cash Holdings + \"Moonshots\" total $10.0 billion, including 4.326 million ETH tokens, total cash of $595 million, and other crypto holdings. Bitmine leads crypto treasury peers by both the velocity of raising crypto NAV per share and by the high trading liquidity of BMNR stock. Bitmine is the 107th most traded stock in the US, trading $1.3 billion per day (5-day avg)."},{"time":"08:28","ticker":"WRAPX","headline":"S&amp;P futures vs fair value: -3.00. Nasdaq futures vs fair value: -33.00. The S&P 500 futures currently trade three points below fair value. There is a muted tone in the premarket this morning after a volatile week was capped by the major averages advancing over 2% on Friday. Six of the \"magnificent seven\" stocks are within 0.5% of their unchanged values in the premarket. Microsoft (MSFT 406.30, +5.16, +1.3%) is the exception, looking to take back more of the recent weakness that has seen the ","body":"stock plummet nearly 17% since its earnings release on January 28.The iShare Expanded Tech-Software ETF (IGV) is down 15% over the same time period amid increasing concerns that AI will disrupt the traditional software space."},{"time":"08:22","ticker":"ICU","headline":"SeaStar Medical announces publication in pediatric nephrology of positive real-world experience for QUELIMMUNE (SCD-PED) therapy in pediatric Acute Kidney Injury (AKI)\n                (2.48 ) DENVER, Feb.  09, 2026  (GLOBE NEWSWIRE) -- SeaStar Medical Holding Corporation (Nasdaq: ICU), a commercial-stage healthcare company, announced today the publication of early post-approval clinical experience from the use of the QUELIMMUNE (Selective Cytopheretic Device for Pediatrics, or SCD-PED) therapy i","body":"n the prestigious, peer-reviewed journal Pediatric Nephrology.Click here for full release."},{"time":"08:15","ticker":"BDRBF","headline":"Bombardier acquires Velocity Maintenance Solutions, a MRO services provider\n                (180.54 ) Bombardier announces the acquisition of Velocity Maintenance Solutions, a MRO services provider. This strategic acquisition -- completed through Bombardier's U.S. subsidiary, Learjet Inc. -- marks another significant step in Bombardier's ongoing expansion of its Services business and reinforces the co's commitment to delivering exceptional convenience and care to operators worldwide.","body":""},{"time":"08:15","ticker":"KEY","headline":"KeyCorp announces a strategic expansion of its middle market capabilities with the addition of a five-person family office and private capital team led by Ward Nixon, who joins as Commercial Leader based in KeyBank's Overland Park, Kansas office","body":"\n                (23.21 )"},{"time":"08:15","ticker":"PRQR","headline":"ProQR Therapeutics announces planned changes to Board composition\n                (1.50 ) Co announces that Dinko Valerio, a co-founder of the Company, and Alison Lawton will rotate off the Board at the Company's next Annual General Meeting (AGM) as their terms conclude.The planned changes to ProQR's Board composition at its 2026 AGM reflect the company's development as it advances its clinical programs, as well as its ongoing commitment to strong corporate governance and long-term succession pl","body":"anning. An executive search firm has been engaged to assist ProQR in identifying candidates to be nominated to the Board to support long-term value creation for all its stakeholders."},{"time":"08:13","ticker":"MAT","headline":"Mattel and Nintendo (NTDOY) unveil Little People My Mario\n                (21.49 ) Co unveils Little People My Mario, a brand-new toddler sized adventure that brings the characters, movements and excitement of Super Mario to the youngest fans. With familiar characters and action-packed play, the Little People My Mario line lets little ones explore, imagine, and play together in all-new ways. My Mario is a collection of products, games, and experiences inspired by Mario and his Mushroom Kingdom f","body":"riends, designed for young children and their parents."},{"time":"08:13","ticker":"HITI","headline":"High Tide announces that its Canna Cabana retail cannabis store in Ontario began selling recreational cannabis products and consumption accessories","body":" \n                (2.35 )"},{"time":"08:13","ticker":"CCIX","headline":"Churchill Capital Corp IX postpones extraordinary meeting to vote upon the proposed business combination between Churchill IX and Plus Automation to April 15 from Feb 11\n                (10.67 ) The Board of Directors of Churchill IX decided to postpone the meeting in light of current market conditions. As a result of the postponement, the deadline for delivery of redemption requests from Churchill IX's public shareholders in connection with the proposed business combination has been extended fr","body":"om February 9, 2026 to 5:00 p.m. Eastern time on the second business day preceding the date of the rescheduled extraordinary general meeting. Further information regarding the rescheduled meeting will be published once the meeting date is finalized."},{"time":"08:12","ticker":"OSS","headline":"One Stop Systems and Tauro Technologies to Showcase Sensor Bridge at AFCEA West\n                (9.24 ) ESCONDIDO, Calif., Feb.  09, 2026  (GLOBE NEWSWIRE) -- One Stop Systems, Inc. (OSS or the Company) (Nasdaq: OSS), today announced it will showcase its HSB Sensor Bridge technology at AFCEA West, the premier West Coast naval conference and exposition along with its engineering partner Tauro Technologies. The event takes place February 10-12, 2026, at the San Diego Convention Center. OSS will sh","body":"owcase its production-ready architecture for real-time, multi-sensor ingest and Artificial intelligence (AI) processing at the tactical edge at Booth #4414.Click here for full release."},{"time":"08:11","ticker":"SABR","headline":"Sabre and WestJet Airlines extend technology partnership \n                (1.18 ) Co announces the renewal of its SabreSonic Passenger Service System (PSS) agreement with major Canadian carrier WestJet Airlines. The long-term commitment highlights WestJet's confidence in Sabre's airline technology as they continue their global expansion.","body":""},{"time":"08:11","ticker":"WEX","headline":"WEX: Impactive Capital nominates four candidates to WEX Board\n                (158.95 ) Contends Board Level Change is Required to Address Alarming Share Price Underperformance, Culture of Entrenchment and Widening Valuation Gap Versus Its Closest PeerClick here for full release.","body":""},{"time":"08:10","ticker":"NG","headline":"NovaGold Resources &amp; Paulson select Fluor as Donlin Gold's Partner to lead Bankable Feasibility Study \n                (9.19 ) Co and Donlin Gold Holdings, 100% wholly-owned by Paulson Advisers, announce that Fluor Corp (FLR) was selected to lead the Bankable Feasibility Study (BFS) as the engineering firm for the Donlin Gold project in Alaska as it advances toward financing and development. Donlin Gold is advancing the BFS using an approach informed by longstanding experience in delivering ","body":"large, multi-disciplinary projects. The emphasis is on fully integrating scope, engineering, cost, and schedule to support a high-quality, investment-grade study, while continuing to make steady and deliberate progress toward development. The BFS is expected to be completed in 2027."},{"time":"08:10","ticker":"ANIX","headline":"Anixa Biosciences reports encouraging patient survival observations in ovarian cancer CAR-T trial; achieves regulatory approval enabling major dose escalation\n                (2.96 ) Multiple patients substantially exceed expected survival at low dose levels; absence of dose-limiting toxicities supports escalation to doses up to 100x higherClick here for full release.","body":""},{"time":"08:10","ticker":"NKLR","headline":"Terra Innovatum Global N.V. completes process to secure full end-to-end supply chain components for SOLO micro-modular reactor, demonstrating build-ready execution\n                (4.45 ) Secured all key nuclear- and non-nuclear-grade components and systems in preparation for rapid unit deployment. De-risked manufacturing timelines and deployment readiness. Integrated supply chain partner program consists of industry leaders with nuclear-grade qualifications.","body":""},{"time":"08:10","ticker":"UVV","headline":"Universal Corp appoints Steven S. Diel as CFO, effective April 1\n                (57.82 ) Mr. Diel brings over 25 years of experience in finance, corporate development, and business strategy expertise. Mr. Diel joined Universal Corporation in 2018 as Vice President of Business Development, where he led the Company's financial planning and analysis and corporate development functions.","body":""},{"time":"08:09","ticker":"SLDB","headline":"Solid Biosciences announces positive feedback from Type C meeting with FDA for SGT-003 gene therapy for Duchenne muscular dystrophy\n                (6.52 ) CHARLESTOWN, Mass., Feb.  09, 2026  (GLOBE NEWSWIRE) -- Solid Biosciences Inc. (Nasdaq: SLDB) (the \"Company\" or \"Solid\"), a life sciences company developing precision genetic medicines for neuromuscular and cardiac diseases, today announced a positive regulatory update from its recent Type C meeting with the U.S. Food and Drug Administration ","body":"(FDA) that supports the continued advancement of SGT-003 as a potential treatment for Duchenne muscular dystrophy.Click here for full release."},{"time":"08:09","ticker":"STXS","headline":"Stereotaxis announces the launch of a new robotic electrophysiology program at Klinikum Frth in Frth, Germany\n                (2.03 ) Klinikum Frth is the first hospital in Germany to establish a leading heart rhythm program that incorporates the Genesis Robotic Magnetic Navigation System, advanced robotic technology that establishes a new standard of care for patients with arrhythmias. Physicians at Klinikum Frth have successfully treated their first patients, with a wide range of arrhythmias, ","body":"leveraging the advanced technology."},{"time":"08:08","ticker":"FDP","headline":"Fresh Del Monte receives U.S. Bankruptcy Court approval for acquisition of Del Monte Foods assets\n                (38.47 ) Co announces that the U.S. Bankruptcy Court has approved the company as the purchaser of select assets of California-based Del Monte Foods Corporation II Inc. and its affiliates through a court-supervised sale under Section 363 of the U.S. Bankruptcy Code.As previously disclosed, the purchase price is $285 million, plus the assumption of certain liabilities. Co expects the T","body":"ransaction to close in the first quarter of 2026."},{"time":"08:08","ticker":"TU","headline":"Telus secures new 3800 MHz spectrum licences\n                (14.13 ) TELUS today announced the acquisition of new 3800 MHz spectrum licences in B.C. and Alberta at a cost of $317.6 million. These licences -- purchased during ISED's Residual Auction -- will enable TELUS to deliver enhanced 5G wireless broadband connectivity to its customers and will continue to optimize the network speeds Canadians have come to expect. \"Importantly, there will be no impact to our deleveraging plan, with 2025 net","body":" debt to adjusted EBITDA currently at 3.4-times, as we aim to reach circa 3.3-times or lower by year-end 2026, and 3.0-times or better by the end of 2027.\" The Residual Spectrum auction was designed to sell spectrum that remained unsold from previous auctions, with the majority of this leftover spectrum located in B.C. and Alberta. Among all participants in the auction, TELUS successfully obtained the most spectrum at an attractive price. This positions TELUS as an industry leader with an average of 104 MHz of prime 5G mid-band spectrum in the 3500 and 3800 MHz bands nationally, acquired for an average price of $0.82 per MHz-pop. This will further support TELUS' efforts to always be building Canada. The 3800 MHz band is mid-range spectrum that has become the critical global band for 5G innovation, as it offers the best combination of speed -- due to its wide channels -- and coverage. Its frequency can support large numbers of mobile data connections and still cover large areas, making it highly conducive to 5G deployment."},{"time":"08:07","ticker":"KRYS","headline":"Krystal Biotech announces RMAT Designation granted by FDA to KB707\n                (272.74 ) Co announces that the FDA granted Regenerative Medicine Advanced Therapy (RMAT) designation to KB707, the co's redosable immunotherapy designed to drive sustained, localized expression of interleukin-2 and interleukin-12 in the tumor microenvironment, for the treatment of advanced or metastatic non-small cell lung cancer (NSCLC). \"The FDA's decision to grant RMAT designation to KB707 reflects both the ur","body":"gent unmet need for new NSCLC therapies as well as the promising early clinical evidence of efficacy we have observed with inhaled KB707 in patients with advanced NSCLC,\" said Suma Krishnan, President of Research and Development at Krystal Biotech.The FDA's RMAT designation is intended to support and expedite the development of regenerative medicine therapies, including gene therapies."},{"time":"08:06","ticker":"NUVB","headline":"Nuvation Bio announces pivotal global Phase 3 SIGMA Trial (G203) for safusidenib in IDH1-mutant glioma\n                (5.70 ) Co announces finalization of a protocol amendment to the ongoing global SIGMA study of safusidenib that expands it to a Phase 3 trial. The new protocol broadens patient eligibility in the registrational portion of the trial and includes those with grades 2 and 3 IDH1-mutant astrocytoma with high-risk features and grade 4 IDH1-mutant astrocytoma, following standard-of-car","body":"e radiation or chemoradiation and adjuvant temozolomide. To support regulatory submissions for patients with astrocytoma, the protocol amendment significantly increases trial enrollment from 100 to 300 patients in the U.S., Australia and China.The trial will now also enroll a non-pivotal single-arm cohort to examine the efficacy and safety of safusidenib in chemotherapy- and radiotherapy-nave patients with grade 3 IDH1-mutant oligodendroglioma. The primary endpoint for this arm is objective response rate. This cohort is expected to enroll approximately 40 patients."},{"time":"08:06","ticker":"MSTR","headline":"Strategy Inc sold 616,715 shares of MSTR stock and acquired 1,142 BTC during February 2, 2026 to February 8, 2026 period","body":" \n                (134.93 )"},{"time":"08:06","ticker":"STEX","headline":"Streamex Exchange Corporation appoints Morgan Lekstrom as Executive Chairman, and announces completed repayment of convertible debenture and cancellation of SEPA\n                (3.28 ) The Company has also announced that the previously entered into Secured Convertible Debentures with YA II PN, LTD., a Cayman Islands exempt limited company have been fully repaid and the Standby Equity Purchase Agreement  previously entered into with Yorkville has been cancelled.In addition to leadership updates,","body":" on February 6, 2026, the Company successfully completed the early repayment to Yorkville of its outstanding Secured Convertible Debentures, announced previously. As previously announced, the SEPA with Yorkville, which the Company never utilized, has also been terminated. These actions have effectively removed all debt and dilution overhang from Streamex's capital structure, positioning the Company with a clean balance sheet and greater financial flexibility as it enters 2026 and focuses on growth initiatives and the upcoming GLDY launch."},{"time":"08:06","ticker":"UVV","headline":"Universal Corporation reports nine month and third quarter 2026 results\n                (57.82 ) Universal Corporation (NYSE:UVV) (\"Universal\" or the \"Company\"), a global business-to-business agriproducts company, today announced financial results for the nine months and quarter ended December 31, 2025.Click here for full release.","body":""},{"time":"08:05","ticker":"CEG","headline":"Constellation Energy and CyrusOne announce agreement to support new data center facility in Texas\n                (261.42 ) Co announces that its Calpine LLC business unit signed a new 380-megawatt (MW) agreement with Dallas-based CyrusOne, a data center developer and operator, to connect and serve a new data center adjacent to the Freestone Energy Center, in Freestone County, Texas.  The agreement provides CyrusOne with access to power, grid connectivity and site infrastructure needed to suppor","body":"t development of the new facility, while ensuring electricity continues to flow to the regional grid and ensuring reliability for all customers and communities."},{"time":"08:05","ticker":"WIRES","headline":"On The Wires Scotiabank (BNS) announced the launch\nof its newest specialized banking solution, the Scotiabank Accountant Banking\nProgram, tailored to meet the unique professional and business\nneeds of Chartered Professional Accountants  and practice owners across\nCanada.Humacyte (HUMA) announced that the recently adopted FY 2026 U.S. Department of Defense Appropriations Act includes dedicated funding to support the evaluation and incorporation of biologic vascular repair technologies for the war","body":"fighters suffering from traumatic vascular injuries.Verrica Pharmaceuticals (VRCA) announced the launch of YCANTH in Japan by its partner, Torii Pharmaceutica, a wholly-owned subsidiary of Shionogi & Co., Ltd., for the treatment of molluscum contagiosum.Aether Holdings (ATHR) announced the launch of SentimenTracker within Aether Grid, expanding the platform with sentiment-driven signals designed to simplify institutional-grade market intelligence for retail investors across equities and digital assets."},{"time":"08:05","ticker":"TAK","headline":"Takeda Pharma: Iambic announces a multi-year technology and discovery collaboration agreement with Takeda that will use Iambic's industry leading AI drug discovery models to advance a select set of high-priority small molecule programs, initially in Takeda's Oncology and Gastrointestinal and Inflammation therapeutic areas\n                (17.89 ) Multi-year partnership \nwill utilize Iambic's broad suite of AI drug discovery technologies and wet lab \ncapabilities to advance collaboration \nprogram","body":"s initially in Takeda's Oncology and \nGastrointestinal and Inflammation Therapeutic Areas.Iambic to provide Takeda access to NeuralPLexer, Iambic's \nindustry-leading model for predicting protein-ligand complexes, enabling Takeda to more broadly accelerate its drug \ndiscovery and development efforts.Iambic to receive upfront, research cost, and technology \naccess payments and is eligible to receive success-based payments that could \nexceed $1.7 billion. Iambic is also eligible to \nreceive royalties on net sales of any \nproducts generated from this collaboration."},{"time":"08:04","ticker":"LDOS","headline":"Leidos is modernizing the IT operations of the Compartmented Enterprise Services Office within the Defense Information Systems Agency to enable more efficient information sharing across the Department of War (DoW) and intelligence community.\n                (192.99 ) Under the $142 million award, Leidos is expected to provide integrated engineering, software development, operations and cybersecurity services to optimize CESO's secure web applications. The effort includes scalable, AI-driven capa","body":"bilities designed to help streamline operations, improve secure information access and advance Zero Trust compliance. This is aimed at enhancing decision making, user experience and mission readiness."},{"time":"08:04","ticker":"UBER","headline":"Uber discloses financial details of its acquisition of delivery portfolio in Trkiye;  expected to close in the second half of 2026\n                (74.77 ) On February 8, 2026, Uber Technologies, Inc. (the \"Company\") entered into an agreement with Mubadala Investment Company to acquire Getir Perakende Lojistik A.S.'s (\"Getir\") delivery portfolio in Trkiye, including food, grocery, retail, and water delivery.  The transaction is structured in phases with the agreement to acquire 100% of Getir's f","body":"ood delivery business at the outset, for $335 million in cash on a cash and debt free basis. Getir's food delivery business generated over $1 billion in gross bookings in 2025, up more than 50% from the prior year on a constant currency basis.  In addition, Uber will invest $100 million to acquire a 15% stake in Getir's grocery, retail and water delivery business. The acquisition of the remainder of Getir's delivery portfolio across grocery, retail and water delivery is expected to close in the next few years, subject to certain operating and financial performance conditions being met.  The transaction is subject to regulatory approval and other closing conditions, with the acquisition of the food delivery business expected to close in the second half of 2026."},{"time":"08:03","ticker":"PHM","headline":"PulteGroup announces the appointment of Kristin Gannon, Managing Director at Eastdil Secured, as a new independent director to its Board, effective February 10, 2026\n                (135.09 ) Ms. Gannon will serve on the Nominating and Governance Committee and the Audit  Committee.","body":""},{"time":"08:02","ticker":"SOHU","headline":"SOHU.COM reports fourth quarter and fiscal year 2025 unaudited financial results\n                (16.36 ) BEIJING, Feb. 9, 2026 /PRNewswire/ -- Sohu.com Limited (NASDAQ: SOHU) (\"Sohu\" or the \"Company\"), a leading Chinese online media platform and game business group, today reported unaudited financial results for the fourth quarter and fiscal year ended December 31, 2025.Click here for full release.","body":""},{"time":"08:02","ticker":"FDMT","headline":"4D Molecular Therapeutics announces enrollment completion for 4FRONT-1, the first Phase 3 clinical trial evaluating 4D-150 in patients with wet age-related macular degeneration\n                (8.99 ) Enrollment for 4FRONT-1, the first registrational trial for 4D-150 in wet AMD, was completed within an approximately 11-month period, ahead of initial projections. 4FRONT-1 overenrolled and expected to exceed 500 patients randomized, reflecting strong interest from investigators and patients Toplin","body":"e data from 4FRONT-1 expected in H1 2027. 4FRONT-2 global site activation momentum continues, with enrollment completion on track for H2 2026 and topline data expected in H2 2027."},{"time":"08:01","ticker":"MPAA","headline":"Motorcar Parts of America reports fiscal third quarter results\n                (13.14 ) - Sales Impacted by Reduced Ordering Activity by a Large Customer, Now Rebounding; \n        Net Sales Up with Cash Generation for Nine-Month Period -Click here for full release.","body":""},{"time":"08:01","ticker":"FLYX","headline":"flyExclusive reports record preliminary unaudited results for the fourth quarter and full year 2025, capping a transformational year with expected positive adjusted EBITDA in fourth quarter 2025\n                (3.03 ) flyExclusive Reports Record Preliminary Unaudited Results for the Fourth Quarter and Full Year 2025, Capping a Transformational Year with Expected Positive Adjusted EBITDA in Fourth Quarter 2025Click here for full release.","body":""},{"time":"08:00","ticker":"WRAPX","headline":"S&amp;P futures vs fair value: -5.00. Nasdaq futures vs fair value: -57.00. Equity futures point to a lower opening this morning after a volatile previous week for stocks. The major averages incurred sizable losses earlier in the week as software and toher tech stocks sold off sharply, though there was a broad rebound on Friday that lifted the DJIA past the 50,000 mark to a new record high. Amazon (AMZN) and Alphabet (GOOG) faced weakness after issuing massive capital expenditure forecasts for t","body":"he coming year, prompting return-on-investment concerns across the hyperscaler space that has largely defined a tough start to the year for some of the market's weightiest components. Friday's session also saw a stabilization in Bitcoin, which suffered a sharp retreat throughout the week. Headlines are relatively quiet this morning as the market gears up for another busy week of earnings that will see over 75 S&P 500 companies report earnings this week. There are no economic data releases of note scheduled for today.In corporate news:The Trump administration is preparing new arms sales to Taiwan, which could jeopardize President Trump's planned visit to China in April, according to Financial Times. Anthropic could raise $20 billion as soon as next week, according to Bloomberg. Novo Nordisk (NVO 50.16, +2.53, +5.3%) trades sharply higher in the premarket after Hims & Hers (HIMS 18.38, -4.64, -20.2%) decided to pull its knockoff Wegovy pill after threatened legal action, according to CNBC. Oracle (ORCL 146.65, +3.83, +2.7%) was upgraded to Buy from Neutral at DA Davidson, with a target price of $180.Reviewing overnight developments:Equity indices in the Asia-Pacific region began the week on a higher note with Japan's Nikkei (+3.9%) soaring to a fresh record after a snap election resulted in supermajority for Prime Minister Takaichi's LDP even before factoring the seats that were won by LDP's coalition partner Ishin. Japan's Nikkei: +3.9%, Hong Kong's Hang Seng: +1.8%, China's Shanghai Composite: +0.1%, India's Sensex: +0.6%, South Korea's Kospi: +4.1%, Australia's ASX All Ordinaries: +2.0%.In news:The win puts the prime minister in position to implement her economic agenda. Finance Minister Katayama attempted to assuage investors by saying that there will be no additional bond issuance to fund the prime minister's agenda. Elsewhere, Thailand's election produced a three-way deadlock that was largely expected. China has resumed some rare earth exports to Japan while Australia placed a 10% tariff on steel imports from China.In economic data:Japan's December Overall Wage Income 2.4% yr/yr (expected 3.0%; last 1.7%). December Current Account surplus JPY2.70 trln (expected surplus of JPY2.95 trln; last surplus of JPY3.14 trln). January Bank Lending 4.5% yr/yr, as expected (last 4.3%) and January Economy Watchers Current Index 47.8 (expected 49.1; last 47.7)Major European indices trade on a mostly higher note while the U.K.'s FTSE (-0.2%) underperforms with financials contributing to the weakness. STOXX Europe 600: +0.2%, Germany's DAX: +0.4%, U.K.'s FTSE 100: -0.2%, France's CAC 40: UNCH, Italy's FTSE MIB: +1.2%, Spain's IBEX 35: +0.5%.In news:Speculation is on the rise that British Prime Minister Starmer could be ousted after his unimpressive visit to China and growing focus on his knowledge of Lord Mandelson's ties to Jeffrey Epstein. A weekend election in Spain resulted in a rightward shift with Prime Minister Sanchez's Socialist party seeing its support fall to 24.5% from 29.5%. In Portugal, Socialist Jose Seguro was elected president.In economic data:Eurozone's February Sentix Investor Confidence 4.2 (expected -0.2; last -1.8) Swiss Q1 SECO Consumer Climate -30, as expected (last -37)"},{"time":"07:55","ticker":"BONDX","headline":"Overnight Treasury Market Summary Long End Paces Early SellingU.S. Treasuries are on track for a lower start in longer tenors while the 2-yr note is set to begin closer to its unchanged level. Treasury futures slumped last evening, once it became clear that Japan Prime Minister Takaichi's election gamble paid off, with her party winning supermajority before factoring in the seats that were won by LDP's coalition partner Ishin. The prime minister is poised to implement her agenda with little oppo","body":"sition and Finance Minister Katayama said that the programs will be funded without additional bond issuance. Treasury futures spent the rest of the night in a slow rise that erased the bulk of last night's losses. Politics remained in focus going into the European session with Spain seeing a rightward shift and growing speculation that British Prime Minister Starmer's days may be numbered. The overnight economic data flow was on the light side with things set to remain quiet on that front during the U.S. session. Crude oil holds a modest gain while the U.S. Dollar Index is down 0.4% at 97.23. Yield Check: 2-yr: +1 bp to 3.51% 3-yr: +1 bp to 3.58% 5-yr: +2 bps to 3.78% 10-yr: +3 bps to 4.24% 30-yr: +3 bps to 4.86%News: Thailand's election produced a three-way deadlock that was largely expected. China has resumed some rare earth exports to Japan. Australia placed a 10% tariff on steel imports from China. Speculation is on the rise that British Prime Minister Starmer could be ousted after his unimpressive visit to China and growing focus on his knowledge of Lord Mandelson's ties to Jeffrey Epstein. A weekend election in Spain resulted in a rightward shift with Prime Minister Sanchez's Socialist party seeing its support fall to 24.5% from 29.5%. In Portugal, Socialist Jose Seguro was elected president. Japan's December Overall Wage Income 2.4% yr/yr (expected 3.0%; last 1.7%). December Current Account surplus JPY2.70 trln (expected surplus of JPY2.95 trln; last surplus of JPY3.14 trln). January Bank Lending 4.5% yr/yr, as expected (last 4.3%) and January Economy Watchers Current Index 47.8 (expected 49.1; last 47.7) Eurozone's February Sentix Investor Confidence rose to 4.2 from -1.8 (expected -0.2). Swiss Q1 SECO Consumer Climate rose to -30 from -37, as expected. Commodities: WTI Crude: +0.3% to $63.70/bbl Gold: +1.2% to $5037.20/ozt Copper: +0.1% to $5.89/lb Currencies: EUR/USD: +0.5% to 1.1877 GBP/USD: +0.3% to 1.3651 USD/CNH: -0.1% to 6.9204 USD/JPY: -0.5% to 156.44 No Data on Today's Schedule"},{"time":"07:54","ticker":"RIG","headline":"Transocean and Valaris Limited (VAL) announce the signing of a definitive agreement to combine the two companies under which Transocean will acquire Valaris in an all-stock transaction valued at approximately $5.8 billion\n                (5.39 ) The shareholding percentages of the combined company, on a fully diluted \nbasis, will be approximately 53% for Transocean and 47% for Valaris. \nThe enterprise value of the pro forma company is approximately $17 billion.Creates an industry leader with a d","body":"iversified \noffshore fleet of 73 rigs, including 33 ultra-deepwater drillships, nine \nsemisubmersibles and 31 modern jackups, to meet emerging growth opportunities.Expands \nreach and customer access in world's most attractive offshore basins.Unlocks more than $200  million in identified cost \nsynergies, additive to Transocean's ongoing cost savings initiative.Increases \ncash flow, accelerates deleveraging and strengthens financial flexibility.Estimated \npro forma market capitalization of $12.3 billion.Improves trading liquidity and capital markets \nprofile, including an expanded investor base and opportunities for additional \nequity index inclusion.The transaction was unanimously approved by the boards of directors of both \ncompanies and is expected to close in the  second half of 2026, subject to regulatory \napprovals and customary closing conditions, and approvals by the shareholders of \neach company."},{"time":"07:35","ticker":"KR","headline":"Kroger confirms it has named former Walmart US exec Greg Foran as CEO; co also reaffirms FY26 guidance\n                (67.50 ) Co confirms that it has named Greg Foran as CEO, effective immediately. Foran will also join Kroger's Board of Directors and succeeds Ron Sargent, who served as interim CEO since March 2025. Foran brings over 40 years of experience leading large, complex consumer businesses through periods of transformation, growth, and digital adoption. Foran led Walmart U.S. for six y","body":"ears, where he oversaw a turnaround of the company's largest division until 2019. He accelerated Walmart's digital capabilities, introducing online ordering and pick up and driving meaningful retail media results. During his tenure, Foran delivered positive comps for 20 consecutive quarters and managed more than 4,600 stores and one million associates. He most recently served as CEO of Air New Zealand where he led an end-to-end digital transformation to improve the customer experience and make the business more agile. Co  reaffirms guidance for FY26 (Jan), sees EPS of $4.75-4.80, excluding non-recurring items, vs. $4.79 FactSet Consensus. Co reaffirms FY26 identical sales without fuel of +2.8-3.0%."},{"time":"07:33","ticker":"MANE","headline":"Veradermics announces completion of enrollment in its second Phase 3 registration-directed clinical trial evaluating VDPHL01 for the treatment of male pattern hair loss\n                (38.48 ) This marks the completion of enrollment of all male Phase 3 studies of \nVDPHL01 in pattern hair loss, with \napproximately 1,000 male patients enrolled across studies.Topline data from initial '302' trial anticipated in the first half of 2026; '304' confirmatory study \ntopline data anticipated in the secon","body":"d half \nof 2026.VDPHL01, if approved, has the \npotential to be the first and only \nnon-hormonal oral FDA approved treatment for men and women with pattern \nhair loss, a condition affecting an estimated 50 million men and 30 million women in the United States."},{"time":"07:32","ticker":"SUMRX","headline":"European Markets Update: DAX +0.5%, FTSE -0.3%, CAC UNCH Major European indices trade on a mostly higher note while the U.K.'s FTSE (-0.3%) underperforms with financials contributing to the weakness. Speculation is on the rise that British Prime Minister Starmer could be ousted after his unimpressive visit to China and growing focus on his knowledge of Lord Mandelson's ties to Jeffrey Epstein. A weekend election in Spain resulted in a rightward shift with Prime Minister Sanchez's Socialist party","body":" seeing its support fall to 24.5% from 29.5%. In Portugal, Socialist Jose Seguro was elected president.  In economic data: Eurozone's February Sentix Investor Confidence 4.2 (expected -0.2; last -1.8) Swiss Q1 SECO Consumer Climate -30, as expected (last -37) ---Equity Markets--- STOXX Europe 600: +0.3% Germany's DAX: +0.5% U.K.'s FTSE 100: -0.3% France's CAC 40: UNCH Italy's FTSE MIB: +1.2% Spain's IBEX 35: +0.6% ---FX--- EUR/USD: +0.5% to 1.1875 GBP/USD: +0.3% to 1.3648 USD/CHF: -0.6% to 0.7708"},{"time":"07:31","ticker":"MTW","headline":"Manitowoc announces that its wholly-owned subsidiary, MGX Equipment Services, LLC, has completed a strategic dealer agreement with Hiab\n                (15.03 ) The agreement expands the MGX and Manitowoc direct-to-customer \nfootprint by adding distribution of HIAB loader cranes with aftermarket parts \nand service support for a diverse range of \nend market customers. MGX will now serve Hiab customers in the following  U.S. states: Colorado, Delaware, Iowa, Maryland, Minnesota, Montana, Nebraska,","body":" New Jersey, North Dakota, South Dakota, Virginia, Wyoming, and Utah."},{"time":"07:30","ticker":"AVXL","headline":"Anavex Life Sciences reports fiscal 2026 first quarter financial results and provides business update\n                (4.10 ) NEW YORK, Feb.  09, 2026  (GLOBE NEWSWIRE) -- Anavex Life Sciences Corp. (\"Anavex\" or the \"Company\") (Nasdaq: AVXL), a clinical-stage biopharmaceutical company focused on developing innovative treatments for Alzheimer's disease, Parkinson's disease, schizophrenia, neurodevelopmental, neurodegenerative, and rare diseases, including Rett syndrome, and other central nervous ","body":"system (CNS) disorders, today reported financial results for its first quarter of fiscal 2026.Click here for full release."},{"time":"07:28","ticker":"SCANX","headline":"Gapping up/Gapping down Gapping up  In reaction to earnings/guidance: DT +14.2%, \nAPO +4%, \nCURB +2.1%, \nDRD +1.5%Other news: STM +7.2% (deepens AWS partnership to power next-gen cloud and AI infrastructure)\nWW +6.1% (presumably on the HIMS GLP-1 news)NVO +5.5% (takes legal action against Hims & Hers (HIMS) to protect patients from unsafe, knock-off Wegovy and Ozempic)\nABUS +3.9% (discloses that on Feb. 2, the U.S. District Court for the District of Delaware issued a memorandum and order in the ","body":"litigation filed by the company against Moderna (MRNA) seeking damages for infringement)\nLLY +1.6% (to acquire Orna Therapeutics to expand in vivo CAR-T and genetic medicine platform)\nAPH +1.1% (bought 10,000 shares at $128.51 worth ~$1.285 mln)\n Analyst comments: DOCS +1.9% (upgraded to Buy from Hold at Canaccord Genuity)RBLX +1.7% (upgraded to Buy from Neutral at Roth Capital)\n\nGapping down In reaction to earnings/guidance: KD -38.3% (also, to delay 10Q; new CFO), \nPGY -16.7%, \nMNDY -14.7%, \nBDX -4.8%, \nCLF -4.3%, \nEPC -4.3%, \nWAT -4.3%, \nSBH -2.8%, \nAIOT -1.7% Other news: HIMS -18.8% (FDA says it intends to take action against non-FDA-approved GLP-1 drugs; Novo Nordisk A/S takes legal action against Hims & Hers (HIMS) to protect patients from unsafe, knock-off Wegovy and Ozempic)\nNWG -6.9% (acquires Evelyn Partners, accelerates fee growth and returns capital)\nAXG -5.3% (collaborates with Alibaba (BABA) Taobao Shangou and Hangzhou Bossen to advance inclusive carbon reduction via Blockchain)\nELLO -3.7% (received request regarding implementation of separation mechanism concerning Ellomay Luzon Energy Infrastructures)\nSFST -2.8% (files for $125 mln mixed securities shelf offering)\nNTHI -1.9% (files for 2,950,498 share common stock offering by selling shareholders)\nAnalyst comments: LI -3.1% (downgraded to Underweight from Neutral at JPMorgan)UL -0.9% (downgraded to Hold from Buy at Deutsche Bank)"},{"time":"07:18","ticker":"ZBIO","headline":"Zenas Biopharma announces that results from the Phase 2 MoonStone trial of obexelimab in Relapsing Multiple Sclerosis were presented in a late-breaking oral presentation at the Americas Committee for Treatment and Research in Multiple Sclerosis Forum 2026\n                (21.80 ) Obexelimab met the primary endpoint with a 95% relative reduction in new \ngadolinium-enhancing T1 lesions compared with placebo over weeks 8 and 12 \n(p=0.0009).Separately announced 24-week data support the robust and \nd","body":"urable activity of obexelimab and further validate its unique inhibitory \nmechanism of action.Obexelimab was well tolerated, and no new safety signals \nwere observed."},{"time":"07:16","ticker":"OCGN","headline":"Ocugen announces the appointment of Rita Johnson-Greene as Chief Financial Officer\n                (1.33 ) Mrs. Johnson-Greene has more than 20 years of healthcare \nexperience. She most recently served as Chief \nOperating Officer at the Alliance for Regenerative Medicine where \nshe led ARM's operations, finance, and global expansion initiatives to advance the development of \nengineered cell therapies and genetic medicines and promote access for all \npatients.","body":""},{"time":"07:16","ticker":"NGEN","headline":"Nervgen Pharma announces its Board of Directors has unanimously appointed Adam Rogers, as President and Chief Executive Officer, effective immediate\n                (3.88 ) Dr. Rogers will continue leading the Company's growth and execution of its mission to transform \nthe lives of individuals living with spinal cord injury.Adam Rogers, has served on NervGen's Board of Directors since July 2022 and \nwas appointed Chairman and Interim Chief Executive Officer in \nJuly 2025 as part of a leadership ","body":"transition supporting the Company's next stage \nof growth. Dr. Rogers is a Principal of  Boston-based PFP \nBiosciences Holdings and a board-certified ophthalmologist specializing in \ndiseases and surgery of the retina and vitreous."},{"time":"07:12","ticker":"POWW","headline":"Outdoor Holding Company Reports Continued Profitability In Third Quarter Fiscal 2026\n                (1.68 ) Atlanta, GA., Feb.  09, 2026  (GLOBE NEWSWIRE) -- Outdoor Holding Company (POWW), the owner of GunBroker.com, the largest online marketplace for firearms, hunting and related products, today reported its financial results for its third fiscal quarter ended December 31, 2025.Click here for full release.","body":""},{"time":"07:11","ticker":"KD","headline":"Kyndryl misses by $0.08, misses on revs; provides FY26 guidance; Harsh Chugh has been named Interim Chief Financial Officer\n                (23.49 ) Reports Q3 (Dec) earnings of $0.52 per share, excluding non-recurring items, $0.08 worse than the FactSet Consensus of $0.60; revenues rose 0.6% year/year to $3.77 bln vs the $3.89 bln FactSet Consensus.Leadership changes -- Kyndryl today announced that Harsh Chugh has been named Interim Chief Financial Officer, Mark Ringes has been named Interim Ge","body":"neral Counsel and Bhavna Doegar has been named Interim Corporate Controller effective immediately. Hyperscaler-related revenue -- In the third quarter, as part of Kyndryl's Alliances initiative, the Company generated $500 million in revenue tied to cloud hyperscaler alliances, a 58% year-over-year increase, and is on track to exceed its initial hyperscaler revenue target of $1.8 billion for fiscal 2026. Double-digit growth in Kyndryl Consult -- In the third quarter, Kyndryl Consult revenues grew 24% year-over-year. Over the last twelve months, Kyndryl Consult revenues were $3.6 billion, and Kyndryl Consult signings were $4.1 billion.Kyndryl is providing the following outlook for its fiscal year 2026: Adjusted pretax income of $575 to $600 million Adjusted EBITDA margin of approximately 17.5% Free cash flow of $325 to $375 million Constant-currency revenue decline of 2% to 3%"},{"time":"07:11","ticker":"PGY","headline":"Pagaya beats by $0.46, misses on revs; guides Q1 revs below consensus; guides FY26 revs in-line\n                (18.64 ) Reports Q4 (Dec) earnings of $0.80 per share, excluding non-recurring items, $0.46 better than the FactSet Consensus of $0.34; revenues rose 19.8% year/year to $334.8 mln vs the $349.4 mln FactSet Consensus.Network volume of $2.7 billion (compared to the implied outlook of $2.65 to $2.9 billion) increased by 3% year-over-year, or 34% excluding SFR.Co issues downside guidance f","body":"or Q1, sees Q1 revs of $315-$335 mln vs. $346.68 mln FactSet Consensus. Network Volume expected to be between $2.5 billion and $2.7 billion.Co issues in-line guidance for FY26, sees FY26 revs of $1.400-$1.575 mln vs. $1.53 bln FactSet Consensus. Network Volume expected to be between $11.25 billion and $13 billion."},{"time":"07:10","ticker":"WIRES","headline":"On The Wires Sportradar AG (SRAD) announced a multi-year agreement with NBC Sports Regional Sports Networks to enhance the NBA viewing experience through real-time, cutting-edge broadcast solutions that enhance live game coverage.  NBC Sports Regional Networks will leverage Sportradar's NBA Advanced Data and GameFrame across live NBA game broadcasts during the 2025-26 and 2026-27 NBA seasons. The agreement supports hundreds of NBA telecasts across NBC Sports's regional networks, delivering more ","body":"dynamic coverage to fans in multiple NBA markets nationwide.Powerfleet, Inc. (AIOT) announced it has been awarded a milestone public sector contract to deliver integrated video intelligence and real-time fleet visibility services for an extensive range of South African government departments overseeing more than 100,000 vehicles. The agreement is anticipated to represent a major deployment in the company's history and is expected to generate material recurring SaaS and services revenue over a minimum five-year term following phased implementation. Preliminary department enrolments are highly encouraging and ahead of initial internal expectations. The contract also expands Powerfleet's existing partnership with MTN, supporting nationwide delivery through secure connectivity and managed network infrastructure.Astera Labs, Inc. (ALAB) announced a significant expansion of \nits global engineering operations with the establishment of an advanced research \nand development center in Israel. The new design center will accelerate the \ndevelopment of Astera Lab's next-generation scale-up fabrics for high-bandwidth \nconnectivity protocols, while also advancing technical research and development \nto address memory bottlenecks in AI training and inference applications. \nSemiconductor industry veteran Guy Azrad, senior vice president of engineering \nand general manager of Astera Labs Israel, will lead the new Israel operations, and will be \nsupported by Ido Bukspan as vice president of ASIC engineering.Fermi Inc. (FRMI), in partnership with the Texas Tech University System, announced the arrival of Project Matador's first six Siemens Energy SGT-800 natural gas turbines and their accompanying generators-marking a major milestone in the natural gas power delivery schedule for the private energy campus."},{"time":"07:09","ticker":"LLY","headline":"Eli Lilly to acquire Orna Therapeutics to expand in vivo CAR-T and genetic medicine platform\n                (1,058.18 ) Eli Lilly and Company agreed to acquire Orna Therapeutics in a cash transaction valued at up to $2.4 bln, including upfront consideration and development milestone payments.Co plans to integrate Orna's in vivo CAR-T platform, which uses circular RNA and lipid nanoparticles to generate cell therapies directly in patients, reducing reliance on ex vivo manufacturing.The deal adds","body":" ORN-252, a CD19-targeting in vivo CAR-T program aimed at B-cell--driven autoimmune diseases, an area where early autologous CAR-T data have shown clinical promise but limited scalability.Lilly is positioned to leverage the platform for broader genetic medicine and immune-reset therapies, expanding its long-term pipeline beyond traditional biologics and small molecules."},{"time":"07:08","ticker":"RY","headline":"Royal Bank of Canada launches GoSmart, a new mobile-based solution designed to empower new and aspiring self-directed investors\n                (170.40 ) GoSmart by RBC Direct Investing combines speed and convenience, commission-free trading, and the ability to invest on your terms. RBC clients can open an account in minutes, transfer funds from their RBC bank account, and start enjoying commission-free trades right away -- it's that simple.","body":""},{"time":"07:07","ticker":"WIRES","headline":"On The Wires Ashland (ASH) announces the United States Environmental Protection Agency has officially posted and approved its petition under the Federal Insecticide, Fungicide, and Rodenticide Act  for agrimer eco-coat polymer seed coating for crop care. This innovative ingredient is based on the company's patented Transformed Vegetable Oils technology. Approval means the ingredient can now be used in all food and non-food pesticide formulations under regulation 40 CFR 180.960.At SLAS2026, Chems","body":"peed Technologies introduce their open Self-Driving Lab platform. Chemspeed and SciY are vendor-agnostics divisions of Bruker Corporation (BRKR).Bruker Corporation (BRKR) announced the launch of iNTApharma, a label-free characterization platform that provides single-particle sensitivity for the quantitative analysis of nanoscale bioparticles in native aqueous media. Introduced at SLAS 2026 in Boston, iNTApharma delivers size and concentration measurements within minutes, supporting research, therapy development and quality control workflows that require direct, native-state assessment of bio-nanoparticle populations without labeling or chemical modifications."},{"time":"07:06","ticker":"HAIN","headline":"Hain Celestial Reports Fiscal Second Quarter 2026 Financial Results\n                (1.23 ) HOBOKEN, N.J., Feb.  09, 2026  (GLOBE NEWSWIRE) -- The Hain Celestial Group, Inc. (HAIN), a leading global health and wellness company whose purpose is to inspire healthier living through better-for-you brands, today reported financial results for its fiscal second quarter ended December 31, 2025.Click here for full release.","body":""},{"time":"07:05","ticker":"AIOT","headline":"Powerfleet Reports Robust Q3 Recurring Revenue Growth With 11% Year-Over-Year Increase in Services Revenue\n                (4.84 ) WOODCLIFF LAKE, N.J., Feb. 9, 2026 /PRNewswire/ -- Powerfleet, Inc. (AIOT) reported its financial results for the third quarter ended December 31, 2025.Click here for full release.","body":""},{"time":"07:04","ticker":"MNDY","headline":"Monday.com beats by $0.12, beats on revs; guides Q1 revs below consensus; guides FY26 revs below consensus\n                (98.00 ) Reports Q4 (Dec) earnings of $1.04 per share, excluding non-recurring items, $0.12 better than the FactSet Consensus of $0.92; revenues rose 24.6% year/year to $333.88 mln vs the $329.67 mln FactSet Consensus.Net dollar retention rate for customers with more than $100,000 in ARR was 116%.Customers with more than $100,000 in ARR now represent 28% of ARR, up from 24% ","body":"as of December 31, 2024.Customers with more than $500,000 in ARR now represent 6% of ARR, up from 4% as of December 31, 2024.Total remaining performance obligations (RPOs) were $839 million, up 37% from $614 million as of December 31, 2024.Co issues downside guidance for Q1, sees Q1 revs of $338-$340 mln vs. $342.95 mln FactSet Consensus. Sees non-GAAP operating income of $37 million to $39 million and operating margin of 11% to 12%, assuming a negative FX impact of 100 to 200 basis points.Co issues downside guidance for FY26, sees FY26 revs of $1.452-$1.462 bln vs. $1.48 bln FactSet Consensus. Non-GAAP operating income of $165 million to $175 million and operating margin of 11% to 12%, assuming a negative FX impact of 100 to 200 basis points."},{"time":"07:04","ticker":"WTTR","headline":"Select Water Solutions and LibertyStream entered into a definitive agreement to deploy commercial lithium carbonate production facilities\n                (12.89 ) Planned three-stage deployment of commercial lithium carbonate production facilities funded, designed, constructed, and operated by LibertyStream. The initial facility will have a nameplate capacity of 1,000 tonnes of lithium carbonate per year.The facilities will utilize Select's water treatment expertise and existing pipeline infrast","body":"ructure to source, transport, manage, and pre-treat produced water streams essential to the extraction process. In return, Select will receive a royalty on lithium carbonate production.The first commercial lithium carbonate facility will be developed at Select's operating site in Howard County, north of Midland, Texas, establishing the anchor installation for the companies' broader Midland Basin rollout."},{"time":"07:03","ticker":"FBP","headline":"First Bancorp announces that Orlando Berges, Executive Vice President and Chief Financial Officer, will retire from the Corporation effective June 30, 2026, after close to 17 years of distinguished service\n                (23.22 ) Mr. Berges joined the Corporation in May 2009 and has played a central leadership role in the Corporation's transformation and long-term strengthening. Throughout his tenure, he led the Finance organization with discipline, transparency, and strategic vision. His contr","body":"ibutions were instrumental in recapitalizing the institution and guiding it through its turnaround, adhering to the highest level of financial reporting standards, executing major acquisitions and integrations, enhancing capital planning and balance sheet strength, and contributing to the profitability and stable capital position that characterize FirstBank today.The Corporation also announced that Said Ortiz, currently Senior Vice President and Chief Accounting Officer, has been appointed Executive Vice President and Chief Financial Officer, effective July 1, 2026."},{"time":"07:02","ticker":"NVO","headline":"Novo Nordisk A/S takes legal action against Hims &amp; Hers (HIMS) to protect patients from unsafe, knock-off Wegovy and Ozempic\n                (47.64 ) Co announces that it has filed a lawsuit against telehealth company Hims & Hers (HIMS) for infringing US Patent 8,129,343 with Hims' compounded semaglutide products for the US market. Hims has engaged in promotional campaigns that highlight its compounded semaglutide products, duping consumers and healthcare professionals as to the clinical ben","body":"efits and safety of these unapproved drugs. This includes Hims' recent launch, and two days later, abrupt discontinuance of its \"Compounded GLP-1 Pill,\" which came on the heels of Novo Nordisk's introduction of the Wegovy pill, the first and only FDA-approved GLP-1 pill for weight loss. Hims continues to unlawfully mass compound injectable versions, made with inauthentic API, and these knock-offs are putting patient health and wellbeing at risk.\"Throughout Novo Nordisk's 103-year-long history, patient safety has always been our top priority. Hims & Hers is mass marketing unapproved knock-off versions of Wegovy and Ozempic that evade the FDA's gold standard review process -- that's dangerous and deceptive to patients, and undermines the scientific innovation and regulatory rigor in place to ensure these treatments are safe and effective,\" said John F. Kuckelman, senior vice president, Group General Counsel, Global Legal, IP and Security. \"We've taken legal action to protect the American public and our intellectual property and will continue to work with regulators, law enforcement, and other key stakeholders to ensure patients have access to FDA approved safe and effective medicines.\"Novo Nordisk is asking the court to permanently ban Hims from selling unapproved, compounded drugs that infringe our patents, and is seeking to recover damages."},{"time":"07:00","ticker":"SUMRX","headline":"Asian Markets Close: Nikkei +3.9%, Hang Seng +1.8%, Shanghai +0.1% Equity indices in the Asia-Pacific region began the week on a higher note with Japan's Nikkei (+3.9%) soaring to a fresh record after a snap election resulted in supermajority for Prime Minister Takaichi's LDP even before factoring the seats that were won by LDP's coalition partner Ishin. The win puts the prime minister in position to implement her economic agenda. Finance Minister Katayama attempted to assuage investors by sayin","body":"g that there will be no additional bond issuance to fund the prime minister's agenda. Elsewhere, Thailand's election produced a three-way deadlock that was largely expected. China has resumed some rare earth exports to Japan while Australia placed a 10% tariff on steel imports from China. In economic data: Japan's December Overall Wage Income 2.4% yr/yr (expected 3.0%; last 1.7%). December Current Account surplus JPY2.70 trln (expected surplus of JPY2.95 trln; last surplus of JPY3.14 trln). January Bank Lending 4.5% yr/yr, as expected (last 4.3%) and January Economy Watchers Current Index 47.8 (expected 49.1; last 47.7) ---Equity Markets--- Japan's Nikkei: +3.9% Hong Kong's Hang Seng: +1.8% China's Shanghai Composite: +0.1% India's Sensex: +0.6% South Korea's Kospi: +4.1% Australia's ASX All Ordinaries: +2.0% ---FX--- USD/JPY: -0.4% to 156.53 USD/CNH: -0.1% to 6.9219 USD/INR: +0.2% to 90.69"},{"time":"06:55","ticker":"CNS","headline":"Cohen &amp; Steers announces preliminary assets under management and net flows for January 2026\n                (62.71 ) Co reported preliminary assets under management of $93.1 billion as of January 31, 2026, an increase of $2.5 billion from assets under management of $90.5 billion at December 31, 2025. The increase was due to market appreciation of $2.2 billion and net inflows of $449 million, partially offset by distributions of $153 million.","body":""},{"time":"06:52","ticker":"KD","headline":"Kyndryl Board appointed Harsh Chugh as Interim Chief Financial Officer and Bhavna Doegar as Interim Corporate Controller of the Company, effective immediately\n                (23.49 ) Concurrently with Mr. Chugh's appointment, David Wyshner departed from his position as Chief Financial Officer of the Company, and Edward Sebold departed from his position as General Counsel of the Company, effective immediately. In addition, on the same date, Vineet Khurana stepped down from his position as Senior","body":" Vice President and Global Controller of the Company and assumed a different role at the Company."},{"time":"06:51","ticker":"KD","headline":"Kyndryl files to delay its 10-Q; anticipates reporting material weaknesses in the Company's internal control over financial reporting \n                (23.49 ) In connection with the filing of the Quarterly Report, when made, the Company anticipates reporting material weaknesses in the Company's internal control over financial reporting for the period covered in the Quarterly Report, as well as for the full fiscal year ended March 31, 2025, and the first two fiscal quarters of fiscal year 2026, ","body":"which are expected to include, but may not be limited to, the effectiveness and strength of certain functions at the Company, including with respect to controls related to information and communication and tone at the top. As a result, the Company notes that its assessment of internal control over financial reporting and the related opinion of PricewaterhouseCoopers LLP only with respect to the effectiveness of the Company's internal control over financial reporting as of March 31, 2025 included in the Company's Annual Report on Form 10-K for the full fiscal year ended March 31, 2025 should no longer be relied upon.  The Company is developing a remediation plan that will be described further in the Quarterly Report."},{"time":"06:51","ticker":"WIRES","headline":"On The Wires Comstock (LODE) and its subsidiary, Comstock Metals announced that it has received tax abatements from the Nevada Governor's Office of Economic Development.Nexus Global Payments appoints Payments Network Malaysia (PayNet) and Network for Electronic Transfers Singapore  joint venture as the Nexus Technical Operato. This follows a competitive procurement process involving global bidders and marks a major milestone in building an interoperable global payments infrastructure. The newly ","body":"appointed NTO will work closely with leading global firms Amazon Web Services (AMZN) and Endava (DAVA) to deliver the technical design and development of the Nexus platform.Cango (CANG) announced it completed the sale of 4,451 Bitcoin on the open market during the past weekend, which were settled directly in USDT for aggregate net proceeds of approximately US$305 million in equivalent value. The full amount of the USDT proceeds has been utilized to partially repay a Bitcoin-collateralized loan."},{"time":"06:50","ticker":"SCANX","headline":"Early premarket gappers Gapping up: DT +10.6%, \nWW +9.6%, \nCNA +8.5%, \nSTM +6.7%, \nNVO +6.4%, \nABUS +3.9%, \nCURB +2.9%, \nAPO +2.4%, \nLLY +1.2%, \nRERE +1.2%, \nMOH +1%, \nCGC +0.9%, \nSHLS +0.7%, \nBAH +0.6%, \nCVS +0.5%Gapping down: HIMS -14.9%, \nNWG -6%, \nEPC -4%, \nELLO -3.7%, \nCLF -3.2%, \nBDX -2.9%, \nAXG -2.8%, \nSFST -2.8%, \nNTHI -1.9%, \nBWLP -1.3%, \nEXAS -1.1%, \nWAT -1%, \nACLS -0.8%, \nL -0.8%","body":""},{"time":"06:48","ticker":"SBH","headline":"Sally Beauty beats by $0.02, reports revs in-line; guides Q2 EPS in-line, revs in-line; narrows FY26 EPS, reaffirms FY26 revs guidance\n                (16.16 ) Reports Q1 (Dec) earnings of $0.48 per share, excluding non-recurring items, $0.02 better than the FactSet Consensus of $0.46; revenues rose 0.6% year/year to $943.2 mln vs the $940.23 mln FactSet Consensus.  Co issues in-line guidance for Q2, sees EPS of $0.39-0.42, excluding non-recurring items, vs. $0.45 FactSet Consensus; sees Q2 revs","body":" of $895-905 mln vs. $898.48 mln FactSet Consensus. Co issues guidance for FY26, narrows EPS to $2.02-2.10 from $2.00-2.10, excluding non-recurring items, vs. $2.07 FactSet Consensus; sees FY26 revs of $3.71-3.77 bln vs. $3.74 bln FactSet Consensus.\"Our first quarter performance marks a strong start to fiscal 2026,\" said Denise Paulonis, president and chief executive officer. \"We achieved top line results that met our expectations, maintained healthy gross margins and delivered adjusted EPS growth of 12% - consistent with our long-term financial algorithm. Our robust cash flow from operations enabled us to invest for growth, reduce debt and return value to shareholders. We also made continued progress on our strategic initiatives designed to accelerate growth and increase profitability.\""},{"time":"06:46","ticker":"DSGX","headline":"Descartes showcases AI innovations to help improve supply chain and logistics operations\n                (66.78 ) ATLANTA, Feb.  09, 2026  (GLOBE NEWSWIRE) -- Descartes Systems Group (Nasdaq:DSGX) (TSX:DSG), the global leader in uniting logistics-intensive businesses in commerce, is showcasing its latest technology innovations focused on artificial intelligence (AI) and advanced automation at Manifest 2026 from February 9--11 in Las Vegas. Descartes' solutions leverage its Global Logistics Netwo","body":"rk to help organizations of all sizes operate more intelligently, securely and resiliently in complex supply chain and logistics environments where execution, compliance, and risk mitigation matter.Click here for full release."},{"time":"06:45","ticker":"MCHP","headline":"Microchip announces proposed private offering of $600 mln of convertible senior notes due 2030 \n                (76.01 ) In connection with the pricing of the notes, Microchip has been advised that J. Wood Capital Advisors LLC (\"JWCA\"), Microchip's financial advisor with respect to the offering, intends to purchase up to $25 million of shares of common stock concurrently with the offering in privately negotiated transactions with institutional investors through one of the initial purchasers or i","body":"ts affiliate (the \"JWCA Purchase\")."},{"time":"06:41","ticker":"DT","headline":"Dynatrace beats by $0.03, beats on revs; guides Q4 EPS above consensus, revs above consensus\n                (33.71 ) Reports Q3 (Dec) earnings of $0.44 per share, excluding non-recurring items, $0.03 better than the FactSet Consensus of $0.41; revenues rose 18.2% year/year to $515.47 mln vs the $505.81 mln FactSet Consensus.  Co issues upside guidance for Q4, sees EPS of $0.38-0.39, excluding non-recurring items, vs. $0.37 FactSet Consensus; sees Q4 revs of $518-523 mln vs. $514.18 mln FactSet ","body":"Consensus."},{"time":"06:36","ticker":"WAT","headline":"Waters beats by $0.02, reports revs in-line; guides Q1 EPS below consensus, revs above consensus; guides FY26 EPS above consensus, revs in-line\n                (381.29 ) Reports Q4 (Dec) earnings of $4.53 per share, excluding non-recurring items, $0.02 better than the FactSet Consensus of $4.51; revenues rose 6.9% year/year to $932.6 mln vs the $928.34 mln FactSet Consensus.  Co issues mixed guidance for Q1, sees EPS of $2.25-2.35, excluding non-recurring items, vs. $2.51 FactSet Consensus; sees","body":" Q1 revs of $718-731 mln vs. $711.77 mln FactSet Consensus. Co issues guidance for FY26, sees EPS of $14.30-14.50, excluding non-recurring items, vs. $14.28 FactSet Consensus; sees FY26 revs of $3.355-3.405 bln vs. $3.37 bln FactSet Consensus."},{"time":"06:31","ticker":"CNL","headline":"Collective Mining announces assay results for five diamond drill holes targeting definition and expansion of the high-grade, outcropping gold-tungsten-rich zone at the summit of the Apollo system\n                (16.28 ) Step-out drilling from surface at the Apollo system in hole APC-159 has expanded the breccia body to the northeast by approximately 30 metres (where it remains open for further expansion) by intercepting gold grades up to 40% above the grades at the outer edge of the internal mo","body":"del. Highlights from the high-grade section of this hole are as follows:165.75 metres @ 5.35 g/t gold equivalent from 8.85 metres including 31.70 metres @ 17.35 g/t gold equivalentFour additional holes have infilled the Apollo breccia body near surface by intercepting gold, tungsten, silver and copper grades above the prediction of the internal block model with highlights as follows:60.45 metres @ 4.68 g/t gold equivalent from surface including 22.15 metres @ 6.98 g/t gold equivalent (APC-155)131.20 metres @ 2.61 g/t gold equivalent from 6.80 metres including 34.55 metres @ 4.13 g/t gold equivalent from 8.45 metres (APC-158)"},{"time":"06:26","ticker":"ACLS","headline":"Axcelis Tech CORRECTION: Axcelis Tech stockholders approve merger with Veeco (VECO)\n                (86.08 ) Our prior comment said that Axcelis Tech approved a merger with Axcelis Tech. That comment was edited to reflect that correct merger partner.","body":""},{"time":"06:22","ticker":"XPEV","headline":"XPeng launched its start-and-stop charging payment functionality on the XPENG APP in Hong Kong\n                (17.72 ) Antom becomes the first global payment partner for XPENG's EV charging business, supporting the global expansion of XPENG's EV charging business.XPENG is the first Chinese new-generation EV maker to establish a global payment cooperation with Antom.The collaboration debuts in Hong Kong, China in February, with expansion to Southeast Asia and other global markets later in 2026.A","body":"ntom draws on Ant International's payments, global accounts, treasury management, and AI capabilities to deliver tailored solutions that supports EV makers' globalization."},{"time":"06:19","ticker":"VFS","headline":"VinFast Auto announces global delivery target of 300,000 electric vehicles for the full year 2026, reflecting its expectation of continued strong momentum in Asian markets\n                (3.33 ) For two-wheelers, the Company targets 2026 deliveries to be at least 2.5 times its 2025 deliveries.","body":""},{"time":"06:15","ticker":"S","headline":"&amp;P futures vs fair value: -17.50. Nasdaq futures vs fair value: -121.00.","body":""},{"time":"06:15","ticker":"FTSE","headline":"European Markets FTSE...10364.19...-5.60...-0.10%.  DAX...24768.47...+47.00...+0.20%.","body":""},{"time":"06:15","ticker":"","headline":"Asian Markets Nikkei...56363.94...+2110.30...+3.90%.  Hang Seng...27027.17...+467.20...+1.80%.","body":""},{"time":"06:09","ticker":"WIRES","headline":"On The Wires MannKind Corporation (MNKD) announced that the first patient has been enrolled in INHALE-1ST, a clinical study evaluating the initiation of Afrezza (insulin human) Inhalation Powder shortly after a type 1 diabetes diagnosis in pediatric patients.Eni (E) invested\n550,000 and announced a collaboration with the startup EXE Engineering in the\nfield of carbon offsetting initiatives in Africa. This new investment will\nenable the startup to accelerate its roadmap and support the expansion ","body":"of its\nprojects into new operating contexts, including international growth in Europe\nand Africa."},{"time":"06:06","ticker":"KBR","headline":"KBR has been awarded two firm-fixed-price task orders totaling $103 mln under the United States Space Force \n                (43.49 ) These follow on awards from the Chief Technology & Innovation Office (CTIO) will be executed in Chantilly, Virginia and further strengthen KBR's role as a trusted partner in national defense and space operations.Under the terms of the contract, KBR will deliver data analysis and specialized technical expertise to support strategic decision-making, capability devel","body":"opment and personnel readiness across the USSF and Department of the Air Force (DAF) over a three-year period of performance."},{"time":"06:03","ticker":"CLF","headline":"Cleveland-Cliffs beats by $0.19, misses on revs; provides FY26 guidance\n                (14.73 ) Reports Q4 (Dec) loss of $0.43 per share, excluding non-recurring items, $0.19 better than the FactSet Consensus of ($0.62); revenues fell 0.3% year/year to $4.31 bln vs the $4.57 bln FactSet Consensus.The Company put forth the following expectations for the full-year 2026: Steel shipment volumes of approximately 16.5 - 17.0 million net tons. Steel unit cost reductions of approximately $10 per net to","body":"n compared to 2025, inclusive of richer mix impact from expiration of slab contract. Capital expenditures of approximately $700 million. Selling, general and administrative expenses of approximately $575 million. Depreciation, depletion and amortization of approximately $1.1 billion. Cash Pension and OPEB payments and contributions of approximately $125 million."},{"time":"06:03","ticker":"UBER","headline":"Uber to acquire Getir's delivery portfolio in Trkiye, including food, grocery, retail, and water delivery, subject to regulatory approval and other closing conditions\n                (74.77 ) This deal represents another milestone in Uber's continued investment in Trkiye, bringing together Getir and Trendyol Go delivery into the Uber family and further reinforcing Uber's commitment to Trkiye. Following the closing of the deal, Uber plans to combine the unique strengths of Getir and Trendyol Go, ","body":"increasing selection for consumers, supporting more delivery opportunities for couriers, and driving increased demand to restaurants and retailers across Trkiye. Getir consumers will continue to access delivery services through the Getir Super App, but with the benefit of more restaurants from Trendyol Go. Additionally, Trendyol Go customers will be able to access Getir's grocery offerings directly through the Trendyol Go app."},{"time":"06:03","ticker":"BRR","headline":"ProCap Financial to acquire CFO Silvi; to become the first publicly traded agentic finance firm and unveiled its mission to 'help independent investors make money\n                (2.17 ) To execute on this plan, ProCap Financial has entered into an agreement to acquire CFO Silvia, a leading AI agent lab exclusively focused on finance. Silvia's consumer product is free for all users and currently has proprietary AI agents answering queries from digital-native, wealthy users. Since its public laun","body":"ch in May 2025, Silvia has achieved the following milestones: More than $30 billion in assets on the platform; Average user has a net worth exceeding $2.5 million; Average user has connected 12+ accounts; 94% of users interact with Silvia's AI features.Transaction DetailsOn February 8, 2026, the Company entered into a definitive merger agreement (\"Agreement\") with Silvia pursuant to which the Company agreed to acquire Silvia, subject to the satisfaction of customary closing conditions, including approval by the Company's shareholders (the \"Proposed Transaction\"). Under the terms of the Agreement, the Company will acquire Silvia in an all-stock transaction, which is subject to the Company achieving significant equity milestones, namely, 50% of the equity consideration is subject to a lockup until the Company's stock price reaches $9.00. The remaining 50% of the equity consideration is forfeited if the Company's stock price does not cross $9.00 per share in the first five years.The acquisition is subject to a shareholder vote, which is currently expected to occur by the end of the first quarter of 2026. If approved, the Proposed Transaction is expected to close shortly thereafter.Following the close of the Proposed Transaction, Shain Noor, Silvia's Co-Founder, will assume the role of Chief Technology Officer for ProCap Financial, responsible for growing the Silvia product and overseeing all technology products across the Company.Updated Company Balance Sheet: As of today, the Company has 5,007 Bitcoin, $72 million in cash, and $100 million outstanding from its convertible note offering, which was reduced from $235 million upon settlement of the repurchase."},{"time":"06:01","ticker":"EXAS","headline":"Exact Sciences: Geneoscopy wins second patent trial and appeal board decision, invalidating all challenged claims of Exact Sciences' '746 patent\n                (103.18 ) Geneoscopy, Inc., a life sciences company focused on developing diagnostic tests for the advancement of gastrointestinal health, today announced that the Patent Trial and Appeal Board (PTAB) of the U.S. Patent and Trademark Office has issued a Final Written Decision following inter partes review, finding all 10 challenged claim","body":"s of Exact Sciences' U.S. Patent No. 11,970,746 (the '746 patent) unpatentable. This decision follows the PTAB's July 2025 Final Written Decision invalidating all 20 claims of Exact Sciences' U.S. Patent No. 11,634,781 (the '781 patent). As a result, all patent claims asserted by Exact Sciences against the company in the parties' ongoing litigation have now been invalidated by the PTAB."},{"time":"06:00","ticker":"SUMRX","headline":"Overnight Summary -- Japan's election surge powers Asia higher while U.S. futures retreat Global markets are pulling in opposite directions this morning, with Asia ripping higher, precious metals catching a bid, and U.S. futures slipping below fair value as investors weigh momentum against caution. S&P futures are down about 21 points, trading around 6932. The market started stronger, but was capped at 6979.75. After some time spent straddling the neutral zone, sellers finally established firm c","body":"ontrol, enabling the S&P to roll over and fall to a low of 6921.00 before the modest bounce to the current level.Asian equities surge on Monday as technology stocks rebound from last week's AI-driven selloff and Japan rallies on a decisive election outcome. Japan leads the region, with the Nikkei 225 jumping 3.9% after Prime Minister Takaichi's coalition secured a historic landslide, fueling expectations for increased fiscal spending and tax cuts. China also posts solid gains, with the Shanghai Composite up 1.41% ahead of upcoming inflation and producer price data, while Hong Kong's Hang Seng climbs 1.76% as financials and tech names advance. A weaker dollar adds to the risk-on tone, pushing gold above $5,000, even as oil slips despite elevated U.S.--Iran tensions.European equities trade broadly higher on Monday as tech-related jitters ease, and a wave of M&A and earnings news lifts sentiment across the region. The FTSE 100 declines after a weaker U.K. jobs report, as easing declines in permanent placements offset stock-specific pressure from NatWest following its agreement to acquire Evelyn Partners. Germany's DAX pushes higher, supported by banks, industrials, and defense names, after eurozone investor confidence improves sharply, with the Sentix index rising to its highest level since mid-2025. France's CAC 40 is little, with strength in technology and healthcare after STMicroelectronics expands its AWS partnership and Novo Nordisk jumps on news that a copycat weight-loss drug is being pulled from the market. Market UpdatesS&P Futures vs Fair Value: -20.010 yr Note: 4.233%USD/JPY:  156.72   -0.52EUR/USD: 1.1860  +0.0043Europe: FTSE: -0.1% DAX: +0.1% CAC: -0.2%Asia: Hang Seng: +1.8%  Shanghai: +1.4%  Nikkei: +3.9%Gold (5005.50 +25.70) Silver (78.630 +1.570) Crude (63.73 +0.18)"},{"time":"05:31","ticker":"WIRES","headline":"On The Wires Ouster, Inc. (OUST)  announced that on February 4, 2026 it closed the acquisition of StereoLabs SAS, a pioneer in AI vision and perception solutions. With this acquisition, Ouster now offers Physical AI's first unified sensing and perception platform, combining high-performance digital lidar, cameras, AI compute, sensor fusion and perception software, and cutting-edge AI models.Adyen, the global financial technology platform of choice for leading businesses, and Uber (UBER) announce","body":"d the renewal and expansion of their global partnership. Building on more than a decade of successful collaboration first starting in 2012, Adyen continues to serve as a key payments engine supporting Uber's global footprint, which now spans over 70 countries across six continents. The expanded partnership reflects Uber's growing use of Adyen's global payments platform to enhance performance and offer more alternative payment methods, to support Uber's continued international growth. GXO Logistics, Inc. (GXO) has been selected by BMW Group, the world's leading premium manufacturer of automobiles and motorcycles, to manage operations at its Swindon manufacturing plant. Under the new partnership, GXO will lead the warehouse operations of car parts in Swindon, optimising BMW Group's supply chain and further strengthening automotive production resilience across the UK. The Swindon site plays a crucial role in producing pressed parts for the MINI vehicles assembled at the BMW Group plant in Oxford as well as BMW models produced at other international facilities within the BMW Group.The President of the Republic of Congo, Denis Sassou N'Guesso, and Eni's (E) Chief Executive Officer, Claudio Descalzi, attended today in Pointe-Noire the ceremony marking the first cargo of liquefied natural gas from the Nguya FLNG floating facility, signaling the start-up of gas exports from Phase 2 of the Congo LNG project. This represents a further step toward Eni's target of expanding its LNG portfolio to 20 million tonnes per annum by 2030, leveraging the flexibility, competitiveness and geographical diversification of its equity projects, and is a key milestone in building a leading position in the global LNG market. With Phase 2, the Congo LNG project reaches a total liquefaction capacity of 3 million tonnes per annum of LNG, equivalent to 4.5 billion cubic metres of gas per year, leveraging gas resources from the Nen and Litchendjili fields in the offshore Marine XII license.Nexra, Cadeler's (CDLR) dedicated service concept, today announces the signing of a firm contract for the execution of an Operations & Maintenance  campaign in Taiwan, further demonstrating Cadeler's strength within the expanding offshore wind aftermarket. The contract, with an undisclosed client, has an expected value exceeding EUR 20 million and will be executed across two offshore wind farms in Taiwan. The campaign will commence in March 2026, will run for 3-4 months, and will be carried out by Cadeler's wind installation vessel Wind Maker. The contract will be executed by Nexra -- Cadeler's dedicated service concept -- which launched last year and is focused exclusively on the delivery of O&M services, supporting clients throughout the operational lifetime of offshore wind farms."},{"time":"05:24","ticker":"TTE","headline":"TotalEnergies SE signs landmark 1 GW solar PPA with Google (GOOG) to power Texas data centers\n                (73.83 ) TotalEnergies agreed to supply 1 GW of solar capacity to Google under two 15-year PPAs, delivering ~28 TWh of renewable electricity to Google's Texas data centers.Co will source power from company-owned Texas projects under development - Wichita (805 MWp) and Mustang Creek (195 MWp) - with construction starting Q2 2026.Deal complements a separate 1.2 GW of gross PPAs secured by ","body":"Clearway (50% owned by TotalEnergies) across ERCOT, PJM, and SPP, deepening TotalEnergies' role in powering AI-driven data center growth.Strategic impact: largest renewable PPA ever signed by TotalEnergies in the U.S.; supports Google's clean-energy goals while adding new generation to Texas' grid, alongside local job creation and tax revenue benefits."},{"time":"05:17","ticker":"NWG","headline":"NatWest Group plc acquires Evelyn Partners, accelerates fee growth and returns capital\n                (18.11 ) NatWest Group agreed to acquire Evelyn Partners for 2.7 bln EV, creating the UK's leading private banking and wealth management franchise and lifting fee income by ~20% pre-synergies.Co announced a 750 mln share buyback, underscoring capital strength while deploying capital into a high-growth, capital-light business that will represent ~20% of group customer assets and liabilities.Evel","body":"yn brings 69 bln AUMA, ~7%+ AUMA CAGR, and 179 mln FY25 EBITDA; deal values the business at ~9.7x FY25 EV/EBITDA (including target run-rate cost synergies).Combined PBWM reaches 127 bln AUMA and 188 bln customer assets & liabilities, with ~100 mln annual cost synergies (10% of PBWM cost base) and additional revenue synergies via NatWest's 20 mln customers; accretive to growth and RoTE in year one, with returns exceeding a buyback."},{"time":"05:03","ticker":"RERE","headline":"ATRenew outlines China-centric playbook for scaling global circular electronics\n                (5.86 ) ATRenew positioned itself as the only China-based voice at Circular Markets London, framing how China's open, fragmented device supply contrasts with carrier-led models in North America and Europe.Co emphasized its role as a large-scale aggregator, using automated grading, pricing, and compliance infrastructure to standardize non-standard devices into export-ready inventory.Co argued that trad","body":"e-in growth in China is becoming a structurally important supply source, enabling tighter linkage between domestic collection and global circular value chains.Co highlighted policy, logistics, and compliance as key unlocks for cross-border refurbishment economics, positioning its platform to bridge China supply with international demand for quality pre-owned devices."},{"time":"05:00","ticker":"WIRES","headline":"On The Wires Coinbase (COIN) made its second appearance in America's most-watched sporting event, unveiling a new 60-second spot intentionally designed for people to watch together. \"Everybody Coinbase\" is a karaoke-style ad that invites viewers in every living room, sports bar and watch-party gathering place to unite their voices in a familiar, but slightly tweaked popular tune - \"Everybody (Backstreet's Back)\" - that reinforces crypto's mainstream appeal. Additional creative extensions are poi","body":"sed to give the campaign legs for well beyond the big game.Evinova announced that Bristol Myers Squibb (BMY) has signed an agreement to optimize clinical trials with Evinova's AI-native clinical development platform. Under the terms of the agreement, Bristol Myers Squibb will deploy the Cost Optimizer module of Evinova's Study Designer across the company's global portfolio, harnessing advanced artificial intelligence to improve insight-driven decision making, identify productivity opportunities, and unlock more efficient trial designs that accelerate innovation and improve experience for sites and patients.WISeKey International Holding Ltd (WKEY) announced that its subsidiary, WISe.Art which focuses on trusted blockchain NFTs and operates the WISe.ART marketplace for secure NFT transactions, and Global Market of Artification is an innovative company, focused on offering NFT services, will be organizing Art&DeepTech Convergence, an international event and exhibition that will mark a new, fundamental milestone in the convergence of art, advanced technologies, and space in Venice, Italy in September 2026. Venice, cradle of the Renaissance and historic crossroads of cultures, will become the global laboratory of a new creative era, where technological innovation is placed at the service of artistic expression and human values.Schroders and Apollo (APO) announce a strategic partnership to develop a next generation of innovative wealth and retirement investment solutions aimed at enhancing client choice and outcomes. The partnership brings together two global leaders, combining Schroders' active management pedigree in public markets and specialist capabilities across private markets, through Schroders Capital, with the expertise of Apollo's private markets platform focusing on complementary strengths. Key initiatives include accelerating and deepening the firms' offering in the UK wealth market, through the co-creation of new investment products blending public and private market fixed income exposures from across Schroders, Schroders Capital and Apollo."},{"time":"04:57","ticker":"FDX","headline":"FedEx to take 37% stake in InPost via 7.8 bln all-cash take-private\n                (369.23 ) FedEx agreed to acquire a 37% stake in InPost as part of a consortium-led 15.60/share all-cash offer, valuing InPost at 7.8 bln and expected to close in H2 2026.Co positions the deal as a capital-light way to scale European B2C last-mile, giving FedEx customers access to InPost's 61,000-locker out-of-home network while improving profitability and returns in Europe.Co will not integrate operations with I","body":"nPost; instead, post-close arm's-length commercial agreements will link FedEx's global network (3 mln businesses, 225 mln recipients) to InPost's lockers and B2C capabilities, subject to antitrust rules.The consortium includes Advent International (37%), FedEx (37%), A&R (16%), and PPF Group (10% via reinvestment), with committed financing and board support, underscoring deal certainty and FedEx's disciplined capital allocation focus."},{"time":"04:51","ticker":"BWLP","headline":"BW LPG Ltd secures multi-year charters, lifts fixed-rate coverage\n                (16.54 ) BW LPG Limited entered into three-year time charter-out contracts for two VLGCs, BW Tucana and BW Yushi, starting January 2026.The new contracts increase fixed-rate charter coverage to ~35% of fleet capacity for 2026.Average charter rate for covered capacity is approximately $43,500 per day for 2026.Co noted coverage levels and average rates may change ahead of the Q4 2025 earnings release, as charter rene","body":"wal negotiations remain ongoing."},{"time":"04:48","ticker":"STM","headline":"STMicroelectronics deepens AWS partnership to power next-gen cloud and AI infrastructure\n                (29.85 ) STMicroelectronics entered a multi-year, multi-billion-dollar strategic engagement with Amazon Web Services to supply advanced semiconductors for high-performance compute infrastructure in cloud and AI data centers.Co will provide high-bandwidth connectivity, mixed-signal processing, advanced microcontrollers, and analog/power ICs aimed at improving performance, energy efficiency, an","body":"d total cost of ownership for hyperscale operations.Co said the collaboration supports AWS's rollout of new high-performance compute instances and scalable AI workloads, while accelerating product time-to-market through cloud-optimized EDA workflows.Co issued warrants to Amazon.com for up to 24.8 mln ordinary shares, vesting largely based on AWS purchases, exercisable over seven years at an initial price of $28.38 per share."},{"time":"04:44","ticker":"WIRES","headline":"On The Wires VEON Ltd. (VEON) announced the launching of its \"Invest in Pakistan, NOW!\" initiative in partnership with JazzWorld, VEON's services company in Pakistan, during World Governments Summit in Dubai, UAE. \"Invest in Pakistan, NOW!\" invites international investors to take a fresh look at Pakistan as the country's economic fundamentals strengthen, and long-term growth opportunities become more visible.  As a part of the initiative, JazzWorld and Nutshell Group of Pakistan, signed a Memora","body":"ndum of Understanding to advance dialogue and partnerships around digitalization, inclusive growth, and cross-border investment in Pakistan.TG Therapeutics, Inc. (TGTX) announced a collaboration with actress Christina Applegate to help raise awareness of multiple sclerosis and support meaningful conversations for those living with the disease. Christina Applegate, who has been living with MS for 5 years, will lead the new national disease-awareness initiative designed to elevate the voices of people living with MS, highlight the realities, and explore what comes next, on their own terms.Intercontinental Exchange, Inc. (ICE) announced the launch of FTSE South Korea RIC Capped Index Futures. This new CFTC-approved contract, created in alignment with FTSE Russell and the Korea Exchange Inc., combines FTSE Russell's RIC Capped methodology - developed to support regulatory alignment and limit single-name concentration - with KRX's market expertise and ICE's globally traded, deeply liquid futures platform. The contract is designed to provide international investors with efficient and consistent access to Korea's equity market. The contract is USD-denominated and designed to support effective portfolio and risk management needs to help enable international investor's participation in South Korean equity markets. The new FTSE Korea futures is part of ICE's Index futures suite and can be traded directly by U.S.-based market participants.Tigo Energy, Inc. (TYGO) announced the successful certification of the Tigo EI Residential solar-plus-storage solution with Romanian distribution system operators, further expanding market reach of Tigo products across Europe. Following the successful completion of their respective grid-compliance and certification procedures with Distribu?ie Energie Electrica Romania, Distribu?ie Oltenia, and Re?ele Electrice, single-phase and three-phase configurations of the EI Residential solution are now fully listed and approved for use in the Romanian market. With 2026 expected to be another strong year for solar growth nationally, the Tigo EI Residential system becomes an important addition to the list of options for installers deploying advanced solar-plus-storage systems in Romania. In line with its National Energy and Climate Plan, Romania added approximately 2.2GW of new solar capacity in 2025, with total installed solar capacity projected to exceed 10GW by 2030."},{"time":"04:33","ticker":"RHHBY","headline":"Roche Hldg: Genentech's Fenebrutinib is the first investigational medicine in over a decade that reduces disability progression in primary progressive Multiple Sclerosis (PPMS)\n                (57.70 ) -- Late-breaking Phase III FENtrepid results presented at ACTRIMS show investigational fenebrutinib met its primary endpoint of non-inferiority compared to the current standard of care, Ocrevus, in reducing disability progression in PPMS --Click here for full release.","body":""},{"time":"04:29","ticker":"JNJ","headline":"Johnson &amp; Johnson presents early outcomes from the OMNY-AF Pilot Study at 2026 AF Symposium\n                (239.99 ) Johnson & Johnson today announced 12-month pilot-phase data from the OMNY-AF study, evaluating the investigational OMNYPULSE Platform for the treatment of symptomatic paroxysmal atrial fibrillation (AFib), during the 31st Annual AF Symposium in Boston. Initial results for 12-month outcomes across the 30-patient pilot cohort show investigators achieved 100% acute procedural su","body":"ccess with no procedure-associated adverse events, while 56.7% of cases were performed with zero fluoroscopy and 90% of patients achieved primary effectiveness at 12 months.iClick here for full release."},{"time":"04:24","ticker":"SNY","headline":"Sanofi's rilzabrutinib gains breakthrough and orphan designations for rare anemia\n                (47.83 ) Sanofi said the FDA granted Breakthrough Therapy designation to rilzabrutinib (Wayrilz) for warm autoimmune hemolytic anemia (wAIHA), marking the first investigational BTK inhibitor in this disease to receive the status.Co also received orphan drug designation in Japan from the Ministry of Health, Labour and Welfare for wAIHA, reflecting high unmet medical need in the rare autoimmune condit","body":"ion.Co said the designations are supported by data from the ongoing LUMINA 2 Phase 2b study, with a LUMINA 3 Phase 3 trial now evaluating rilzabrutinib versus placebo in wAIHA.Co noted rilzabrutinib is already approved in the US, EU, and UAE for immune thrombocytopenia, with additional rare-disease indications under investigation, underscoring the asset's broad therapeutic potential. Friday After the Close Friday After the Close"}],"fetchedAt":1770663891174},"savedAt":1770663891175}