{"data":{"updated":"2/10/2026, 6:07:52 AM","entries":[{"time":"05:18","ticker":"BP","headline":"BP reports EPS in-line, beats on revs; suspends buyback; proposes dividend raise","body":"• Reports Q4 (Dec) earnings of $0.60 per share, in-line with the FactSet Consensus of $0.60; revenues rose 3.6% year/year to $47.38 bln vs the $42.45 bln FactSet Consensus.bp delivered underlying replacement cost profit of $7.5 bln in 2025 and operating cash flow of $24.5 bln despite weaker oil prices.Co posted record operational performance, with upstream plant reliability of 96.1%, refining availability of 96.3%, seven major project start-ups, and reserves replacement ratio rising to 90%.\n• bp delivered underlying replacement cost profit of $7.5 bln in 2025 and operating cash flow of $24.5 bln despite weaker oil prices.\n• Co posted record operational performance, with upstream plant reliability of 96.1%, refining availability of 96.3%, seven major project start-ups, and reserves replacement ratio rising to 90%.\n• bp suspends share buyback and redirects excess cash to balance sheetCo expects more than $11 bln of proceeds from completed and announced divestments, including the sale of a 65% stake in Castrol for about $6 bln.Co suspended its share buyback and will fully allocate excess cash toward accelerating balance sheet strengthening.Co reaffirmed its capital framework, targeting a resilient dividend growing at least 4% annually and declared a Q4 dividend of 8.320 cents per ordinary share.\n• Co expects more than $11 bln of proceeds from completed and announced divestments, including the sale of a 65% stake in Castrol for about $6 bln.\n• Co suspended its share buyback and will fully allocate excess cash toward accelerating balance sheet strengthening.\n• Co reaffirmed its capital framework, targeting a resilient dividend growing at least 4% annually and declared a Q4 dividend of 8.320 cents per ordinary share."},{"time":"05:02","ticker":"EVTL","headline":"Vertical Aerospace Group explores Saudi manufacturing and deployment pathway","body":"• Vertical Aerospace signed a non-binding MoU with AHQ Group and the Saudi National Industrial Development Centre to assess advanced air mobility manufacturing, operations, and investment opportunities in Saudi Arabia.Co will evaluate in-country eVTOL manufacturing, commercial deployment, and incentive structures aligned with Saudi Arabia's Vision 2030 industrial strategy.The collaboration positions Saudi Arabia as a potential regional hub for electric aircraft, battery systems, and AAM services, with demand potential exceeding 1,000 aircraft.The MoU supports Co's certification roadmap and long-term global scale-up strategy but does not include binding investment commitments or timelines.\n• Co will evaluate in-country eVTOL manufacturing, commercial deployment, and incentive structures aligned with Saudi Arabia's Vision 2030 industrial strategy.\n• The collaboration positions Saudi Arabia as a potential regional hub for electric aircraft, battery systems, and AAM services, with demand potential exceeding 1,000 aircraft.\n• The MoU supports Co's certification roadmap and long-term global scale-up strategy but does not include binding investment commitments or timelines."},{"time":"05:00","ticker":"FSM","headline":"Fortuna Silver Mines advances Diamba Sud toward development decision","body":"• Fortuna Mining Corp. submitted an exploitation permit application for the Diamba Sud Gold Project to Senegal's Ministry of Energy, Petroleum, and Mines on February 4, 2026.Co continues early works and detailed engineering to de-risk critical path activities ahead of a feasibility study.Co plans to publish an updated Mineral Resource estimate by month-end, which will underpin Mineral Reserves and the feasibility study.Co targets a potential construction decision in mid-2026, following robust project economics outlined in the October 2025 preliminary economic assessment.\n• Co continues early works and detailed engineering to de-risk critical path activities ahead of a feasibility study.\n• Co plans to publish an updated Mineral Resource estimate by month-end, which will underpin Mineral Reserves and the feasibility study.\n• Co targets a potential construction decision in mid-2026, following robust project economics outlined in the October 2025 preliminary economic assessment."},{"time":"04:58","ticker":"WIRES","headline":"On The Wires","body":"• Walker & Dunlop (WD) announced today that it has arranged a total of $371,500,000 in financing to facilitate the development of The Nashville EDITION Hotel & Residences. The luxury hotel and residences are planned for the heart of Nashville's highly sought-after Gulch neighborhood.\n• STMicroelectronics (STM) announced the Stellar P3E, the first automotive microcontroller with built-in AI acceleration for automotive edge intelligence. Designed for future software-defined vehicles, the Stellar P3E simplifies multi-function integration for X-in-1 Electronic Control Units that reduce system cost, weight, and complexity.\n• Square (XYZ) announced the UK launch of Square AI, a free, conversational AI assistant built directly into the Square platform to help businesses of all sizes make clearer, faster decisions using their own business data. The launch follows new research commissioned by Square, which shows that while more than half (53%) of UK SMEs have used AI in their business, only 30% use it regularly. This low level of adoption is leaving many businesses experimenting without seeing value, or not yet taking advantage of AI at all.\n• InterDigital, Inc. (IDCC) announced the establishment of the Haptic Excellence Center. The collaborative venture establishes a center of excellence dedicated to foster the innovation, education, implementation, and promotion of haptic technology for enhanced media experiences. Alongside audio and video, haptics is now a first order media type as digital devices equipped with haptic technology have become more ubiquitous. According to the Futuresource and InterDigital white paper \"Haptics: The next modality in immersive entertainment,\" there were roughly 4.1 billion haptic-enabled consumer devices in use at the end of 2024, and projections that 53% of consumer devices will be haptic enabled by 2028."},{"time":"04:56","ticker":"CSCO","headline":"Cisco broadens AgenticOps, security, and AI networking platform","body":"• Cisco announced new AgenticOps capabilities across networking, security, and observability, advancing its agent-first IT operating model for autonomous operations with built-in oversight.Co expanded its security portfolio to support agentic AI adoption, adding protections for autonomous agents, governance over agent interactions, and resilient, cryptographically secured connectivity across hybrid environments.Co unveiled the Silicon One G300, a 102.4 Tbps switching chip designed for large-scale AI clusters, forming the backbone of new Cisco N9000 and 8000 data center systems.Co enhanced Nexus One to simplify operation of AI networks across on-premises and cloud environments, aiming to reduce complexity and improve efficiency as customers scale AI infrastructure.\n• Co expanded its security portfolio to support agentic AI adoption, adding protections for autonomous agents, governance over agent interactions, and resilient, cryptographically secured connectivity across hybrid environments.\n• Co unveiled the Silicon One G300, a 102.4 Tbps switching chip designed for large-scale AI clusters, forming the backbone of new Cisco N9000 and 8000 data center systems.\n• Co enhanced Nexus One to simplify operation of AI networks across on-premises and cloud environments, aiming to reduce complexity and improve efficiency as customers scale AI infrastructure."},{"time":"04:54","ticker":"ORCL","headline":"Oracle expands Fusion Cloud with embedded AI agents across CX and supply chain","body":"• Oracle announced new role-based AI agents embedded in Oracle Fusion Cloud Applications to support customer experience, supply chain, and manufacturing workflows.Co's CX-focused AI agents are integrated into marketing, sales, and service processes to analyze unified data, automate tasks, and deliver predictive insights at scale.Co also introduced AI agents across planning, procurement, manufacturing, maintenance, and logistics to automate end-to-end supply chain workflows and accelerate decision-making.Co added new Oracle Fusion Cloud SCM capabilities for process manufacturing, enabling real-time production visibility and improved regulatory compliance through unified management of formulas, materials, and batch execution.\n• Co's CX-focused AI agents are integrated into marketing, sales, and service processes to analyze unified data, automate tasks, and deliver predictive insights at scale.\n• Co also introduced AI agents across planning, procurement, manufacturing, maintenance, and logistics to automate end-to-end supply chain workflows and accelerate decision-making.\n• Co added new Oracle Fusion Cloud SCM capabilities for process manufacturing, enabling real-time production visibility and improved regulatory compliance through unified management of formulas, materials, and batch execution."},{"time":"04:52","ticker":"GSK","headline":"GlaxoSmithKline advances RSV vaccine toward first adult approval in China","body":"• GSK plc announced that China's Center for Drug Evaluation accepted Arexvy for regulatory review to prevent RSV-related lower respiratory tract disease in adults aged 60 and older.Co is positioned to become the first approved RSV vaccine in China for this age group, where RSV affects more than 6 mln people annually.Co's submission is supported by Phase III China trial data showing positive safety and immunogenicity results with all primary endpoints met.Co expects a regulatory decision in 2027, reflecting standard review timelines in China.\n• Co is positioned to become the first approved RSV vaccine in China for this age group, where RSV affects more than 6 mln people annually.\n• Co's submission is supported by Phase III China trial data showing positive safety and immunogenicity results with all primary endpoints met.\n• Co expects a regulatory decision in 2027, reflecting standard review timelines in China."},{"time":"04:50","ticker":"TSM","headline":"Taiwan Semiconductor Manufacturing reports Jan revs increased 36.8% yr/yr","body":"• Co announced its net revenue for January 2026: On a consolidated basis, revenue for January 2026 was approximately NT$401.26 billion, an increase of 19.8% from December 2025 and an increase of 36.8% from January 2025."},{"time":"04:49","ticker":"AZN","headline":"AstraZeneca beats by $0.01, reports revs in-line","body":"• Reports Q4 (Dec) earnings of $2.12 per share, $0.01 better than the FactSet Consensus of $2.11; revenues rose 4.1% year/year to $15.5 bln vs the $15.46 bln FactSet Consensus.Second interim dividend declared of $2.17 per share (159.5 pence, 19.49 SEK). Total dividend declared for FY 2025 increased by 3% to $3.20 per share\n• Second interim dividend declared of $2.17 per share (159.5 pence, 19.49 SEK). Total dividend declared for FY 2025 increased by 3% to $3.20 per share\n• OutlookTotal Revenue is expected to increase by a mid-to-high single-digit percentageCore EPS is expected to increase by a low double-digit percentage\n• Total Revenue is expected to increase by a mid-to-high single-digit percentage\n• Core EPS is expected to increase by a low double-digit percentage"},{"time":"04:46","ticker":"ASX","headline":"ASE Technology reports January revs increased 21.3% yr/yr to ~NT$59.99 bln","body":""},{"time":"04:46","ticker":"UBER","headline":"Uber: Baidu (BIDU) expands Apollo Go overseas with autonomous Uber launch in Dubai","body":"• Baidu Inc. will deploy its Apollo Go autonomous ride-hailing service on the Uber platform in Dubai, in partnership with Uber Technologies and Dubai's Roads and Transport Authority.Co plans to launch fully driverless rides within the Jumeirah area in the coming month, with expansion subject to regulatory approvals and operational performance.Co is positioned to leverage Uber's consumer platform while supporting Dubai's target for 25% of all transportation trips to be autonomous by 2030.Co highlighted Apollo Go's scale, with more than 240 mln autonomous kilometers logged and over 17 mln cumulative rides completed globally.\n• Co plans to launch fully driverless rides within the Jumeirah area in the coming month, with expansion subject to regulatory approvals and operational performance.\n• Co is positioned to leverage Uber's consumer platform while supporting Dubai's target for 25% of all transportation trips to be autonomous by 2030.\n• Co highlighted Apollo Go's scale, with more than 240 mln autonomous kilometers logged and over 17 mln cumulative rides completed globally."},{"time":"04:28","ticker":"AVA","headline":"Avista raises dividend","body":"• Co's board of directors has declared a quarterly dividend of $0.4925 per share on the company's common stock, yielding an annualized dividend of $1.97. The common stock dividend is payable March 13, 2026, to shareholders of record at the close of business on February 25, 2026.\n• This is up from annual rate of $1.97 per share."},{"time":"04:27","ticker":"CE","headline":"Celanese raises acetic acid, VAM and derivative prices across Western Hemisphere","body":"• Celanese Corporation announced price increases for acetic acid, vinyl acetate monomer, and related derivatives in the Western Hemisphere, effective immediately or as contracts allow.Co increased acetic acid prices by $50/MT in the U.S./Canada and Mexico/South America and by 50/MT in EMEA.Co raised vinyl acetate monomer prices by $100/MT in the Americas and 100/MT in EMEA, representing the largest adjustment in the slate.Co will implement derivative product price increases on a customer-by-customer basis, reflecting product-specific exposure and contract structures.\n• Co increased acetic acid prices by $50/MT in the U.S./Canada and Mexico/South America and by 50/MT in EMEA.\n• Co raised vinyl acetate monomer prices by $100/MT in the Americas and 100/MT in EMEA, representing the largest adjustment in the slate.\n• Co will implement derivative product price increases on a customer-by-customer basis, reflecting product-specific exposure and contract structures."},{"time":"04:25","ticker":"SVM","headline":"Silvercorp Metals reports Q3 results","body":"VANCOUVER, BC, Feb. 9, 2026 /PRNewswire/ - Silvercorp Metals Inc. (\"Silvercorp\" or the \"Company\") (TSX: SVM) (NYSE American: SVM) reported its financial and operating results for the three months ended December 31, 2025 (\"Q3 Fiscal 2026\"). All amounts are expressed in US dollars, and figures may not add due to rounding.Click here for full release."},{"time":"04:22","ticker":"CCSI","headline":"Consensus Cloud Solutions beats by $0.11; beats on revs; sees Q1, FY26 EPS and revs in-line","body":"• Reports Q4 EPS of $1.41 vs $1.30 FactSet consensus; revs of $87.1 mln vs $86.6 mln consensus\n• OutlookQ1 Co sees Q1 EPS of $1.36-1.46 vs 1.38 consensusCo sees Q1 revs of $85.4-89.4 mln vs 87.3 mln consensusFY26Co sees FY26 EPS of $5.55-5.95 vs 5.62 consensusCo sees FY26 revs of $350.0-357.0 mln vs $352.6 mln consensus\n• Q1 Co sees Q1 EPS of $1.36-1.46 vs 1.38 consensusCo sees Q1 revs of $85.4-89.4 mln vs 87.3 mln consensus\n• Co sees Q1 EPS of $1.36-1.46 vs 1.38 consensus\n• Co sees Q1 revs of $85.4-89.4 mln vs 87.3 mln consensus\n• FY26Co sees FY26 EPS of $5.55-5.95 vs 5.62 consensusCo sees FY26 revs of $350.0-357.0 mln vs $352.6 mln consensus\n• Co sees FY26 EPS of $5.55-5.95 vs 5.62 consensus\n• Co sees FY26 revs of $350.0-357.0 mln vs $352.6 mln consensus"},{"time":"04:16","ticker":"SLP","headline":"Simulations Plus extends FDA and NIEHS research collaborations on computational safety models","body":"• Simulations Plus announced extensions of separate research collaborations with the U.S. Food and Drug Administration and the National Institute of Environmental Health Sciences.Co will continue supporting federal research into non-animal, computational, and AI-driven methodologies for food, chemical, and environmental safety assessments.The FDA collaboration expands work on AI-based chemical safety models, supported by new federal funding and access to curated toxicology datasets for validation and benchmarking.The NIEHS extension continues applying Simulations Plus' software to environmental exposure research, aligned with national efforts to modernize chemical safety evaluation.\n• Co will continue supporting federal research into non-animal, computational, and AI-driven methodologies for food, chemical, and environmental safety assessments.\n• The FDA collaboration expands work on AI-based chemical safety models, supported by new federal funding and access to curated toxicology datasets for validation and benchmarking.\n• The NIEHS extension continues applying Simulations Plus' software to environmental exposure research, aligned with national efforts to modernize chemical safety evaluation."},{"time":"04:11","ticker":"ELVR","headline":"Elevra Lithium outlines potential Canadian offtake for spodumene concentrate with supply agreement with Mangrove Lithium","body":"• Elevra Lithium Limited signed a non-binding memorandum of understanding with Mangrove Lithium to supply up to 144,000 tonnes per year of spodumene concentrate from North American Lithium, subject to a future binding agreement.Co plans for the proposed offtake to run for five years starting in 2028, ramping to full volume by 2030 and representing about 46% of estimated sales volumes.The framework includes market-linked pricing with floor and ceiling mechanisms, aiming to support positive cash flow across lithium price cycles.The arrangement is contingent on Mangrove making a final investment decision by June 2027 for a Canadian lithium conversion facility, positioning the deal as optional upside rather than committed revenue.\n• Co plans for the proposed offtake to run for five years starting in 2028, ramping to full volume by 2030 and representing about 46% of estimated sales volumes.\n• The framework includes market-linked pricing with floor and ceiling mechanisms, aiming to support positive cash flow across lithium price cycles.\n• The arrangement is contingent on Mangrove making a final investment decision by June 2027 for a Canadian lithium conversion facility, positioning the deal as optional upside rather than committed revenue."},{"time":"04:05","ticker":"DC","headline":"Dakota Gold Corp. prices offering of 12,336,000 shares of its common stock for gross proceeds of $75 mln","body":""},{"time":"04:03","ticker":"TAK","headline":"Takeda Pharma moves closer to first orexin-based treatment for narcolepsy type 1","body":"• Takeda Pharmaceutical Company received FDA acceptance and Priority Review for the New Drug Application for oveporexton (TAK-861) for narcolepsy type 1, with a PDUFA action date set for Q3 2026.Co is seeking approval for what could become the first orexin receptor 2 agonist therapy designed to address the underlying orexin deficiency driving narcolepsy type 1, rather than only managing symptoms.Phase 3 data showed statistically significant and clinically meaningful improvements across excessive daytime sleepiness, cataplexy, attention, and quality of life, with a generally consistent safety profile.Takeda expects no material impact on its FY2025/26 consolidated forecast, positioning the potential approval as a pipeline catalyst rather than a near-term financial driver.\n• Co is seeking approval for what could become the first orexin receptor 2 agonist therapy designed to address the underlying orexin deficiency driving narcolepsy type 1, rather than only managing symptoms.\n• Phase 3 data showed statistically significant and clinically meaningful improvements across excessive daytime sleepiness, cataplexy, attention, and quality of life, with a generally consistent safety profile.\n• Takeda expects no material impact on its FY2025/26 consolidated forecast, positioning the potential approval as a pipeline catalyst rather than a near-term financial driver."}],"fetchedAt":1770721672638},"savedAt":1770721672639}