{"data":{"updated":"2/10/2026, 7:05:03 AM","entries":[{"time":"07:00","ticker":"SUMRX","headline":"Asian Markets Close: Nikkei +2.2%, Hang Seng +0.6%, Shanghai +0.1%","body":"• In economic data:Japan's M2 Money Stock 1.6% yr/yr (expected 1.7%; prior 1.7%); Machine Tool Orders 25.3% yr/yr (prior 10.9%)Australia's February Westpac Consumer Sentiment 90.5 (prior 92.9); January NAB Confidence 3 (prior 2)\n• Japan's M2 Money Stock 1.6% yr/yr (expected 1.7%; prior 1.7%); Machine Tool Orders 25.3% yr/yr (prior 10.9%)\n• Australia's February Westpac Consumer Sentiment 90.5 (prior 92.9); January NAB Confidence 3 (prior 2)\n• Japan's Nikkei: +2.2%\n• Hong Kong's Hang Seng: +0.6%\n• China's Shanghai Composite: +0.1%\n• India's Sensex: +0.3%\n• South Korea's Kospi: +0.1%\n• Australia's All Ordinaries: +0.1%\n• USD/JPY: -0.4% to 155.23\n• USD/CNH: -0.1% to 6.9101\n• USD/INR: -0.3% to 90.436"},{"time":"06:59","ticker":"KO","headline":"Coca-Cola beats by $0.02, misses on revs; Issues FY26 outlook, expects to deliver organic revenue growth of 4-5%","body":"• Reports Q4 (Dec) earnings of $0.58 per share, excluding non-recurring items, $0.02 better than the FactSet Consensus of $0.56; revenues rose 2.2% year/year to $11.8 bln vs the $12.03 bln FactSet Consensus.\n• Organic revenues grew 5%, driven by a 4% increase in concentrate sales and 1% growth in price/mix.\n• Unit case volume grew 1% for the quarter, led by growth in Brazil, the United States and Japan.\n• Comparable operating margin (non-GAAP) was 24.4% versus 24.0% in the prior year.\n• 2026 Outlook: Expects to deliver organic revenue growth of 4% to 5%. Expects to deliver comparable currency neutral EPS excluding acquisitions and divestitures growth of 5% to 6% and comparable EPS (non-GAAP) growth of 7% to 8% versus $3.00 in 2025. The company expects to generate free cash flow of approximately $12.2 billion. This consists of cash flow from operations of approximately $14.4 billion, less capital expenditures of approximately $2.2 billion."},{"time":"06:59","ticker":"XYL","headline":"Xylem beats by $0.01, beats on revs; guides FY26 EPS in-line, revs below consensus; raises dividend","body":"• Reports Q4 (Dec) earnings of $1.42 per share, excluding non-recurring items, $0.01 better than the FactSet Consensus of $1.41; revenues rose 6.3% year/year to $2.4 bln vs the $2.37 bln FactSet Consensus.\n• Co issues guidance for FY26, sees EPS of $5.35-5.60 vs. $5.55 FactSet Consensus; sees FY26 revs of +1-3% yr/yr to ~$9.1-9.2 bln vs. $9.32 bln FactSet Consensus.\n• The Board of Directors of Xylem has declared a first-quarter dividend of $0.43 per share, an increase of 8%. The dividend is payable on March 24, 2026, to shareholders of record as of February 24, 2026."},{"time":"06:56","ticker":"DXF","headline":"Eason Technology Limited announces that its subsidiary entered into a definitive agreement to make a strategic investment of $1 mln in Shou Chang Energy Private Investment Fund, acquiring approximately 30% interest of the fund","body":""},{"time":"06:49","ticker":"RACE","headline":"Ferrari beats by 0.05, beats on revs","body":"• Reports Q4 (Dec) earnings of 2.14 per share, excluding non-recurring items, 0.05 better than the FactSet Consensus of 2.09; revenues rose 3.8% year/year to 1.8 bln vs the 1.77 bln FactSet Consensus.\n• Shipments of 3,152 units, down 173 units.\n• \" ... Demand for Ferrari remains very solid and is managed with discipline in every market reflecting our exclusivity model: our order book extends towards the end of 2027. We remain true to our identity: forward-looking and defined by our will to progress\"."},{"time":"06:49","ticker":"DGX","headline":"Quest Diagnostics beats by $0.05, beats on revs; guides FY26 EPS above consensus, revs above consensus","body":"• Reports Q4 (Dec) earnings of $2.42 per share, excluding non-recurring items, $0.05 better than the FactSet Consensus of $2.37; revenues rose 7.1% year/year to $2.81 bln vs the $2.76 bln FactSet Consensus.\n• Co issues upside guidance for FY26, sees EPS of $10.50-10.70, excluding non-recurring items, vs. $10.40 FactSet Consensus; sees FY26 revs of $11.70-11.82 bln vs. $11.4 bln FactSet Consensus."},{"time":"06:47","ticker":"LAZ","headline":"Lazard reports January 2026 assets under management","body":"• Co reported that its preliminary assets under management as of January 31, 2026 totaled approximately $267.0 billion.\n• The month's AUM included market appreciation of $7.6 billion, net inflows of $2.9 billion and FX appreciation of $2.1 billion."},{"time":"06:47","ticker":"MCHP","headline":"Microchip announces the pricing of $800 million aggregate principal amount of Convertible Senior Notes due 2030 a private offering","body":"• The size of the offering was increased from the previously announced $600 million in aggregate principal amount.\n• The sale of the notes to the initial purchasers is expected to settle on February 11, 2026, subject to customary closing conditions, and is expected to result in approximately $785.1 million in net proceeds to Microchip after deducting the initial purchasers' discounts and commissions and estimated offering expenses payable by Microchip (assuming no exercise of the initial purchasers' option to purchase additional notes).\n• Microchip intends to use approximately $60.5 million of the net proceeds of the offering to pay the cost of the capped call transactions described above. If the initial purchasers exercise their option to purchase additional notes, Microchip expects to use a portion of the net proceeds from the sale of such additional notes to enter into additional capped call transactions. Microchip intends to use the remaining net proceeds to repay notes outstanding under Microchip's commercial paper program."},{"time":"06:42","ticker":"ENTA","headline":"Enanta Pharmaceuticals reports financial results for its fiscal first quarter; cash runway expected to fund operations into fiscal 2029","body":"Enanta Pharmaceuticals, Inc. (NASDAQ:ENTA), a clinical-stage biotechnology company dedicated to creating small molecule drugs for viral infections and immunological diseases, today reported financial results for its fiscal first quarter ended December 31, 2025.Click here for full release."},{"time":"06:39","ticker":"USAS","headline":"Americas Silver  entered into a definitive agreement with United States Antimony (UAMY) forming a Joint Venture","body":"• U.S.-Based Vertical Integration: The JV will construct a new antimony processing plant in Idaho's Silver Valley. This construction and processing business will be overseen by representatives of each company.Americas-Controlled Feedstock and Site: Americas will contribute the site under existing operating permits for the JV Facility at its Galena Complex in Idaho and will sell antimony feed material mined from the Galena Complex to the JV on market terms. While Americas material will have priority, the JV Facility will also have the potential to process from other mines.\n• Operational and Market Expertise: US Antimony will contribute its knowledge and technical expertise in constructing and operating these types of facilities and will provide the JV with access to its extensive antimony marketing network including the U.S. Government. Subject to the completion of supply agreements as contemplated by the JV in the following 90 days, US Antimony will purchase the antimony produced by the JV at market terms."},{"time":"06:38","ticker":"ZBH","headline":"Zimmer Biomet beats by $0.02, reports revs in-line; guides FY26 EPS below consensus, revs below consensus","body":"• Reports Q4 (Dec) earnings of $2.42 per share, excluding non-recurring items, $0.02 better than the FactSet Consensus of $2.40; revenues rose 10.9% year/year to $2.24 bln vs the $2.22 bln FactSet Consensus.\n• Co issues downside guidance for FY26, sees EPS of $8.30-8.45, excluding non-recurring items, vs. $8.46 FactSet Consensus; sees FY26 revs of +2.5-4.0% yr/yr to ~$8.44-8.56 bln vs. $8.62 bln FactSet Consensus."},{"time":"06:36","ticker":"ARMK","headline":"Aramark beats by $0.01, beats on revs; reaffirms FY26 EPS guidance, revs guidance","body":"• Reports Q1 (Dec) earnings of $0.51 per share, excluding non-recurring items, $0.01 better than the FactSet Consensus of $0.50; revenues rose 6.1% year/year to $4.83 bln vs the $4.74 bln FactSet Consensus.\n• Co reaffirms guidance for FY26, sees EPS of $2.18-2.28, excluding non-recurring items, vs. $2.22 FactSet Consensus; sees FY26 revs of $19.55-19.95 bln vs. $19.7 bln FactSet Consensus.\n• The Company is off to a great start to fiscal 2026, with momentum building across the business. New business wins were extensive in the quarter, and the Company delivered unprecedented client retention levels in both FSS United States and International-resulting in currently outpacing the run-rate to achieve Aramark's Net New Business target of 4% to 5% of prior year revenue.\n• The Company is highly committed to expanding its Global Supply Chain network and is actively pursuing meaningful business opportunities in hospitality categories, while continuing to benefit from increased volume and scale. Aramark remains focused on driving profitability from its multiple operating levers, including supply chain initiatives and effective cost management. Among these strategies, AI-driven technology is enhancing the Company's supply chain capabilities, delivering back-end efficiencies and actionable business insights."},{"time":"06:35","ticker":"WIRES","headline":"On The Wires","body":"• Abu Dhabi Health Data Services, part of the M42 group, and TELUS (TU) Health, announced a strategic agreement to introduce new personalized employee wellbeing solutions in the UAE that combine wellness, precision medicine and AI-driven healthcare innovation. As part of M42's mission to shift health from reactive care to predictive, personalized wellbeing at scale, ADHDS will work with TELUS Health on an Employee Assistance Program (EAP) that currently includes more than 40 modules addressing emotional, lifestyle and wellbeing support. Delivered in local languages for enhanced user experience, the EAP will help improve workplace focus, lowering absenteeism rates while also enabling employers to achieve measurable improvements in productivity and engagement.\n• Amrize (AMRZ) disclosed that on February 5, 2026, the it received a Section 107(a) imminent danger Order from MSHA due to a third party contract miner exposed to a fall hazard by straddling a three foot step ladder (i.e., beyond design capacity) at the Ravena cement plant, New York. No injuries occurred as a result of this incident.\n• Sound Point Meridian Capital (SPMC) unaudited estimate of the range of the net asset value per share of Sound Point Meridian Capital common stock as of January 31, 2026, was between $13.35 and $13.45."},{"time":"06:35","ticker":"DGX","headline":"Quest Diagnostics increases quarterly cash dividend 7.5% to $0.86/share from $0.80/share and increases the Company's share repurchase authorization by $1 bln","body":"The increased authority is in addition to the approximately $0.4 bln that was available as of December 31, 2025 under the Company's share repurchase program."},{"time":"06:34","ticker":"HAS","headline":"Hasbro beats by $0.57, beats on revs; Sees FY26 revenue up 3-5% in constant currency, Announces $1 bln share repurchase program","body":"• Reports Q4 (Dec) earnings of $1.51 per share, excluding non-recurring items, $0.57 better than the FactSet Consensus of $0.94; revenues rose 31.3% year/year to $1.45 bln vs the $1.26 bln FactSet Consensus.\n• Growth in Wizards and Digital Gaming (+86%) and Consumer Products (+7%) partially offset by a decline in Entertainment (-5%).\n• Announces $1 bln share repurchase program.\n• 2026 Outlook: Total revenue up 3-5% in constant currency. Adjusted operating margin of 24%-25%. Adjusted EBITDA of $1.40 billion to $1.45 billion."},{"time":"06:33","ticker":"SCANX","headline":"Early premarket gappers","body":"• Gapping up: ICHR +18.3%, CRDO +17.3%, SPOT +13.9%, CCO +8.2%, PHG +7.1%, YMT +6.7%, UTL +5.9%, RLGT +5.4%, TII +4.6%, CMCO +4.5%, SSD +4.5%, ACM +4.2%, AMKR +3.8%, PSNL +3.4%, SLP +3%, RNG +2.8%, TSM +2.8%, CCSI +2.7%, LUXE +2.7%, CRBG +2.6%, DD +2.5%, HGTY +2%, PSN +2%, AZN +2%, KT +2%, ASX +1.8%, CE +1.7%, AXTA +1.5%, TAK +1.4%, UDR +1.4%, HMC +1.4%, EVTL +1.2%, GSK +1%\n• ICHR +18.3%, CRDO +17.3%, SPOT +13.9%, CCO +8.2%, PHG +7.1%, YMT +6.7%, UTL +5.9%, RLGT +5.4%, TII +4.6%, CMCO +4.5%, SSD +4.5%, ACM +4.2%, AMKR +3.8%, PSNL +3.4%, SLP +3%, RNG +2.8%, TSM +2.8%, CCSI +2.7%, LUXE +2.7%, CRBG +2.6%, DD +2.5%, HGTY +2%, PSN +2%, AZN +2%, KT +2%, ASX +1.8%, CE +1.7%, AXTA +1.5%, TAK +1.4%, UDR +1.4%, HMC +1.4%, EVTL +1.2%, GSK +1%\n• Gapping down: UPWK -25.3%, RGNX -12.6%, AMTM -11.3%, GTM -10.7%, GT -7.8%, ASB -7.6%, DC -7%, PAL -6.4%, WCC -6.2%, MEDP -4.8%, ON -4.7%, BP -4.1%, VNO -3.8%, LTM -2.9%, MTW -2.5%, CPA -1.9%, BCS -1.8%, NISN -1.7%, ELVR -1.6%, GBCI -1.2%\n• UPWK -25.3%, RGNX -12.6%, AMTM -11.3%, GTM -10.7%, GT -7.8%, ASB -7.6%, DC -7%, PAL -6.4%, WCC -6.2%, MEDP -4.8%, ON -4.7%, BP -4.1%, VNO -3.8%, LTM -2.9%, MTW -2.5%, CPA -1.9%, BCS -1.8%, NISN -1.7%, ELVR -1.6%, GBCI -1.2%"},{"time":"06:33","ticker":"CVS","headline":"CVS Health beats by $0.09, beats on revs; guides FY26 EPS in-line","body":"• Reports Q4 (Dec) earnings of $1.09 per share, excluding non-recurring items, $0.09 better than the FactSet Consensus of $1.00; revenues rose 8.2% year/year to $105.69 bln vs the $103.67 bln FactSet Consensus.\n• Co issues in-line guidance for FY26, sees EPS of $7.00-7.20, excluding non-recurring items, vs. $7.18 FactSet Consensus.Updated cash flow from operations guidance to at least $9.0 billion from at least $10.0 billion\n• Updated cash flow from operations guidance to at least $9.0 billion from at least $10.0 billion"},{"time":"06:33","ticker":"IQ","headline":"iQIYI  announces repurchase right notification for 6.50% Convertible Senior Notes due 2028","body":"The Repurchase Right begins at 9:00 a.m., New York City time, on Tuesday, February 10, 2026 and expires at 5:00 p.m., New York City time, on Thursday, March 12, 2026."},{"time":"06:24","ticker":"MT","headline":"ArcelorMittal confirms the construction of an electric arc furnace at its steelmaking site in Dunkirk - a strategic 1.3 bln investment which marks a major step in the decarbonisation of ArcelorMittal's steel production in France","body":"The start-up of this 2-million-tonne EAF is scheduled for 2029. It will produce steel with three times less CO2 compared with a blast furnace (0.6 tonne CO2 per tonne of steel in the EAF based on a mix of scrap, HBI/DRI and hot metal). Its funding will be supported by Energy Efficiency Certificates (CEE), a regulatory mechanism that promotes energy savings and CO2 reduction. The amount of support will represent 50% of the 1.3 billion investment."},{"time":"06:20","ticker":"VALE","headline":"Vale S.A. updates on asset freeze requests by authorities","body":"• Further to the press release disclosed on February 5, 2026, Vale S.A. informs that three requests for asset freezes, filed on a preliminary basis and totaling R$ 2.846 billion, have been denied by the respective competent courts. Only one decision remains pending, related to an asset freeze request in the amount of R$ 200 million. The Company further highlights that other preliminary measures of a different nature have been granted by the competent courts, some of which are already being fulfilled, such as the suspension of operations at the Fbrica and Viga units (which were halted by Vale on January 25, 2026) and the preparation of the Degraded Areas Recovery Plan.\n• The Company clarifies that the overflows that occurred at the Fbrica and Viga units in January 2026 are not related to any of Vale's dams in the region, which remains in unchanged safe conditions and under continuous monitoring, 24 hours a day, seven days a week. The causes of the events continue under investigation through a technical and structured process, with transparency. The Company's priority remains the protection of people, communities, and the environment. Vale continues to cooperate with the authorities and is carrying out sediment removal and cleaning of the affected areas, in line with its commitments. The Company will keep the market informed of any relevant developments, in line with applicable regulations."},{"time":"06:18","ticker":"WCC","headline":"Wesco announces the upcoming retirement of Dave Schulz, Executive Vice President and Chief Financial Officer, and the appointment of Indraneel Dev as Executive Vice President and Chief Financial Officer","body":"• Mr. Schulz notified the Company that he expects to retire in May 2026, and Mr. Dev will join the Company in February 2026 to ensure a smooth transition.\n• Most recently, Mr. Dev served as the Chief Financial Officer and Chief Revenue Officer of Congruex LLC, a communications network infrastructure design, engineering and construction company."},{"time":"06:16","ticker":"CTSH","headline":"Cognizant Tech is collaborating under a three-year strategic agreement with DAMAC Group","body":"• Through this collaboration, DAMAC entrusts Cognizant with the comprehensive management and enhancement of its IT infrastructure and application services. This initiative focuses on working to streamline operations and help improve digital experiences for both customers and employees.\n• Under this strategic engagement, Cognizant supports DAMAC's technology transformation by elevating service delivery, accelerating digital maturity, and driving measurable business impact. The engagement encompasses a wide spectrum of IT infrastructure services and application services across DAMAC's ecosystem, including digital and e-commerce platforms, CRM, core enterprise systems, data platforms, and AI-led initiatives. By embedding automation, operational excellence, and continuous improvement, the initiative is designed to boost business agility, scalability, and alignment with DAMAC's long-term strategic vision."},{"time":"06:16","ticker":"CPA","headline":"Copa Holdings announces monthly traffic statistics for January 2026; ASM +11.9%; load factor 87.5% versus 86.4% last year","body":""},{"time":"06:14","ticker":"PSNL","headline":"Personalis announces Medicare coverage for the company's NeXT Personal molecular residual disease test for surveillance of patients with Stage I to III non-small cell lung cancer","body":"• This coverage determination is grounded in clinical evidence generated through the company's collaboration with the TRACERx (TRAcking Cancer Evolution through therapy (Rx)) consortium. Data from this world-renowned longitudinal study, recently published in Cell, demonstrated NeXT Personal's ability to identify residual disease with high accuracy, validating the test's clinical performance in lung cancer.\n• Lung cancer remains the leading cause of cancer death in the United States, with an estimated ~230,000 new cases diagnosed annually. For patients with Stage I-III NSCLC, the risk of recurrence remains a primary clinical concern. To address this challenge, NeXT Personal is designed to detect trace amounts of circulating tumor DNA that can indicate the presence of cancer, often before the cancer appears on standard of care imaging scans."},{"time":"06:11","ticker":"DD","headline":"DuPont beats by $0.03, reports revs in-line; guides Q1 EPS in-line, revs in-line; guides FY26 EPS above consensus, revs above consensus","body":"• Reports Q4 (Dec) earnings of $0.46 per share, excluding non-recurring items, $0.03 better than the FactSet Consensus of $0.43; revenues rose 0.2% year/year to $1.69 bln vs the $1.69 bln FactSet Consensus.\n• Organic sales decreased 1% versus year-ago period including a $30 million, or 2%, headwind from the third quarter timing shift.\n• Co issues in-line guidance for Q1, sees EPS of $0.48 vs. $0.48 FactSet Consensus; sees Q1 revs of $1.670 bln vs. $1.67 bln FactSet Consensus.\n• Co issues upside guidance for FY26, sees EPS of $2.25-$2.30, excluding non-recurring items, vs. $2.14 FactSet Consensus; sees FY26 revs of $7.075-$7.135 bln vs. $7.06 bln FactSet Consensus."},{"time":"06:09","ticker":"WCC","headline":"Wesco misses by $0.49, reports revs in-line; guides FY26 EPS in-line, revs in-line","body":"• Reports Q4 (Dec) earnings of $3.40 per share, excluding non-recurring items, $0.49 worse than the FactSet Consensus of $3.89; revenues rose 10.3% year/year to $6.07 bln vs the $6.03 bln FactSet Consensus.\n• \"Looking ahead in 2026, we expect to continue to outperform the market and deliver mid- to high-single-digit organic sales growth, strong operating leverage and margin expansion, double-digit EPS growth, and improved free cash flow generation.\"\n• Co issues in-line guidance for FY26, sees EPS of $14.50-16.50, excluding non-recurring items, vs. $16.39 FactSet Consensus; sees FY26 revs growth of 5-8%, which translates to ~$24.7-25.4 bln vs. $24.92 bln FactSet Consensus.\n• We plan to increase our common stock dividend 10% again this year to $2.00 per share."},{"time":"06:08","ticker":"SPOT","headline":"Spotify beats by 1.69, reports revs in-line; guides Q1 revs below consensus","body":"• Reports Q4 (Dec) earnings of 4.43 per share, 1.69 better than the FactSet Consensus of 2.74; revenues rose 6.8% year/year to 4.53 bln vs the 4.52 bln FactSet Consensus.\n• Total Monthly Active Users (\"MAUs\") up 11% yr/yr to 751 mln.\n• Premium Subscribers up 10% yr/yr to 290 mln.\n• Co issues downside guidance for Q1, sees Q1 revs of 4.5 bln vs. 4.58 bln FactSet Consensus. Sees total MAUs of 759 mln, implying the addition of approximately 8 mln net new MAUs. Sees Total Premium Subscribers of 293 mln, implying the addition of approximately 3 million net new subscribers in the quarter."},{"time":"06:08","ticker":"AXTA","headline":"Axalta Coating Systems misses by $0.01, reports revs in-line; guides Q1 EPS below consensus; guides FY26 EPS in-line","body":"• Reports Q4 (Dec) earnings of $0.59 per share, excluding non-recurring items, $0.01 worse than the FactSet Consensus of $0.60; revenues fell 3.7% year/year to $1.26 bln vs the $1.27 bln FactSet Consensus.\n• Co issues downside guidance for Q1, sees EPS of ~$0.50 vs. $0.60 FactSet Consensus.Co sees Q1 net sales down mid-single digits percentage\n• Co sees Q1 net sales down mid-single digits percentage\n• Co issues in-line guidance for FY26, sees EPS of $2.55 - $2.70 vs. $2.66 FactSet Consensus.Co sees FY26 revs growing low-single-digits percentage\n• Co sees FY26 revs growing low-single-digits percentage"},{"time":"06:04","ticker":"OSCR","headline":"Oscar Health misses by $0.35, misses on revs; guides FY26 revs in-line","body":"• Reports Q4 (Dec) loss of $1.24 per share, $0.35 worse than the FactSet Consensus of ($0.89); revenues rose 17.3% year/year to $2.81 bln vs the $3.11 bln FactSet Consensus.\n• Co issues in-line guidance for FY26, sees FY26 revs of $18.7-19.0 bln vs. $12.48 bln FactSet Consensus."},{"time":"06:04","ticker":"TII","headline":"Titan Mining delivers record zinc production in 2025 and provides guidance for 2026","body":"• Delivered record zinc production of 64.2 million payable pounds in 2025, up 8% from 2024.\n• Achieved full-year production guidance, with Q4 output of 18.7 million pounds, up 28% sequentially.\n• 2026 production guidance of 62--66 million payable pounds, reflecting a mine plan focused on development, access to higher-quality ore and long-term value optimization. Production guidance for 2026 is estimated to be between 73 - 78 million zinc recoverable pounds or 62 - 66 million zinc payable pounds. C1 Cash Cost for 2026 is estimated between $0.93 and $1.01 per payable pound, and AISC for 2026 is estimated between $1.07 and $1.17 per payable pound.\n• First production of graphite concentrate from the Kilbourne facility has commenced with ongoing optimization and qualification runs.\n• Germanium identified in zinc process streams is being analyzed for optimal recovery techniques, with ongoing exploration of partnership options with technology partners."},{"time":"06:04","ticker":"LUXE","headline":"LuxExperience reports Q2 net sales growth of +5.7% ex-FX; fully confirming the transformation plan targets","body":"Q2 FY26 Results: LuxExperience Group reports Net Sales growth of +5.7% ex-FX and return to Adjusted EBITDA profitability, fully confirming the transformation plan targetsClick here for full release."},{"time":"06:03","ticker":"","headline":"S&P futures vs fair value: +3.00. Nasdaq futures vs fair value: -1.00.","body":""},{"time":"06:03","ticker":"","headline":"European Markets","body":"FTSE...10346.93...-39.30...-0.40%. DAX...25017...+2.10...+0.00%."},{"time":"06:03","ticker":"","headline":"Asian Markets","body":"Nikkei...57650.54...+1286.60...+2.30%. Hang Seng...27183.16...+156.00...+0.60%."},{"time":"06:03","ticker":"HTGC","headline":"Hercules Capital announces new supplemental cash distribution of $0.07 per share for the fourth quarter of 2025 is in addition to the regular quarterly cash distribution of $0.40 per share","body":""},{"time":"06:02","ticker":"IMOS","headline":"ChipMOS TECHNOLOGIES reported its unaudited consolidated revenue for the month of January 2026","body":"• Revenue for the month of January 2026 was NT$2,290.4 million or US$72.7 million, representing an increase of 4.0% from December 2025, and an increase of 31.2% from January 2025\n• This represents the highest year-over-year increase in monthly revenue since June of 2021. The Company noted it is continuing to benefit from the semiconductor industry's fundamentally improved cycle position, with continued strong revenue growth led by robust demand for high-value memory solutions, particularly in data center and AI-related applications."},{"time":"06:00","ticker":"SUMRX","headline":"Overnight Summary -- Asia sets the tone with record Japan rally while U.S. futures hold gains and Europe digests earnings","body":"• Markets are opening with a cautiously upbeat lean, as U.S. futures hover just above fair value, Asia powers higher led by Japan, Europe sends mixed signals, and a softer yen offsets steady rates and quiet commodity moves. S&P futures are up about five points, trading around 6989. The market's range consolidated to just over 25 points. The high was set at 6997.00. The low sits at 6972.25.\n• Asian equities finished mostly higher on Tuesday as post-election optimism in Japan and a rebound in technology stocks supported regional sentiment. Japan led gains, with the Nikkei 225 jumping 2.28% to a fresh record after Prime Minister Takaichi's landslide victory, while SoftBank surged ahead of earnings and Furukawa Electric rallied on strong results. China edged higher, with the Shanghai Composite up 0.13% on stimulus expectations and continued enthusiasm around artificial intelligence. Hong Kong also advanced, with the Hang Seng rising 0.58%, led by strength in pharma and tech names, as a softer dollar and steadier commodities provided a relatively calm macro backdrop.\n• European equities trade broadly higher on Monday as tech-related jitters ease, and a wave of M&A and earnings news lifts sentiment across the region. The FTSE 100 declines after a weaker U.K. jobs report, as easing declines in permanent placements offset stock-specific pressure from NatWest following its agreement to acquire Evelyn Partners. Germany's DAX pushes higher, supported by banks, industrials, and defense names, after eurozone investor confidence improves sharply, with the Sentix index rising to its highest level since mid-2025. France's CAC 40 is up 0.4%, with strength in technology and healthcare after STMicroelectronics expands its AWS partnership and Novo Nordisk jumps on news that a copycat weight-loss drug is being pulled from the market.\n• S&P Futures vs Fair Value: +5.0\n• 10 yr Note: 4.186%\n• USD/JPY: 155.22 -0.66\n• EUR/USD: 1.1916 -0.0001\n• Europe: FTSE: -0.4% DAX: +0.1% CAC: +0.4%\n• Asia: Hang Seng: +0.6% Shanghai: +0.1% Nikkei: +2.3%\n• Gold (5070.50 -8.90) Silver (81.910 -0.324) Crude (64.26 -0.10)"},{"time":"05:18","ticker":"BP","headline":"BP reports EPS in-line, beats on revs; suspends buyback; proposes dividend raise","body":"• Reports Q4 (Dec) earnings of $0.60 per share, in-line with the FactSet Consensus of $0.60; revenues rose 3.6% year/year to $47.38 bln vs the $42.45 bln FactSet Consensus.bp delivered underlying replacement cost profit of $7.5 bln in 2025 and operating cash flow of $24.5 bln despite weaker oil prices.Co posted record operational performance, with upstream plant reliability of 96.1%, refining availability of 96.3%, seven major project start-ups, and reserves replacement ratio rising to 90%.\n• bp delivered underlying replacement cost profit of $7.5 bln in 2025 and operating cash flow of $24.5 bln despite weaker oil prices.\n• Co posted record operational performance, with upstream plant reliability of 96.1%, refining availability of 96.3%, seven major project start-ups, and reserves replacement ratio rising to 90%.\n• bp suspends share buyback and redirects excess cash to balance sheetCo expects more than $11 bln of proceeds from completed and announced divestments, including the sale of a 65% stake in Castrol for about $6 bln.Co suspended its share buyback and will fully allocate excess cash toward accelerating balance sheet strengthening.Co reaffirmed its capital framework, targeting a resilient dividend growing at least 4% annually and declared a Q4 dividend of 8.320 cents per ordinary share.\n• Co expects more than $11 bln of proceeds from completed and announced divestments, including the sale of a 65% stake in Castrol for about $6 bln.\n• Co suspended its share buyback and will fully allocate excess cash toward accelerating balance sheet strengthening.\n• Co reaffirmed its capital framework, targeting a resilient dividend growing at least 4% annually and declared a Q4 dividend of 8.320 cents per ordinary share."},{"time":"05:02","ticker":"EVTL","headline":"Vertical Aerospace Group explores Saudi manufacturing and deployment pathway","body":"• Vertical Aerospace signed a non-binding MoU with AHQ Group and the Saudi National Industrial Development Centre to assess advanced air mobility manufacturing, operations, and investment opportunities in Saudi Arabia.Co will evaluate in-country eVTOL manufacturing, commercial deployment, and incentive structures aligned with Saudi Arabia's Vision 2030 industrial strategy.The collaboration positions Saudi Arabia as a potential regional hub for electric aircraft, battery systems, and AAM services, with demand potential exceeding 1,000 aircraft.The MoU supports Co's certification roadmap and long-term global scale-up strategy but does not include binding investment commitments or timelines.\n• Co will evaluate in-country eVTOL manufacturing, commercial deployment, and incentive structures aligned with Saudi Arabia's Vision 2030 industrial strategy.\n• The collaboration positions Saudi Arabia as a potential regional hub for electric aircraft, battery systems, and AAM services, with demand potential exceeding 1,000 aircraft.\n• The MoU supports Co's certification roadmap and long-term global scale-up strategy but does not include binding investment commitments or timelines."},{"time":"05:00","ticker":"FSM","headline":"Fortuna Silver Mines advances Diamba Sud toward development decision","body":"• Fortuna Mining Corp. submitted an exploitation permit application for the Diamba Sud Gold Project to Senegal's Ministry of Energy, Petroleum, and Mines on February 4, 2026.Co continues early works and detailed engineering to de-risk critical path activities ahead of a feasibility study.Co plans to publish an updated Mineral Resource estimate by month-end, which will underpin Mineral Reserves and the feasibility study.Co targets a potential construction decision in mid-2026, following robust project economics outlined in the October 2025 preliminary economic assessment.\n• Co continues early works and detailed engineering to de-risk critical path activities ahead of a feasibility study.\n• Co plans to publish an updated Mineral Resource estimate by month-end, which will underpin Mineral Reserves and the feasibility study.\n• Co targets a potential construction decision in mid-2026, following robust project economics outlined in the October 2025 preliminary economic assessment."},{"time":"04:58","ticker":"WIRES","headline":"On The Wires","body":"• Walker & Dunlop (WD) announced today that it has arranged a total of $371,500,000 in financing to facilitate the development of The Nashville EDITION Hotel & Residences. The luxury hotel and residences are planned for the heart of Nashville's highly sought-after Gulch neighborhood.\n• STMicroelectronics (STM) announced the Stellar P3E, the first automotive microcontroller with built-in AI acceleration for automotive edge intelligence. Designed for future software-defined vehicles, the Stellar P3E simplifies multi-function integration for X-in-1 Electronic Control Units that reduce system cost, weight, and complexity.\n• Square (XYZ) announced the UK launch of Square AI, a free, conversational AI assistant built directly into the Square platform to help businesses of all sizes make clearer, faster decisions using their own business data. The launch follows new research commissioned by Square, which shows that while more than half (53%) of UK SMEs have used AI in their business, only 30% use it regularly. This low level of adoption is leaving many businesses experimenting without seeing value, or not yet taking advantage of AI at all.\n• InterDigital, Inc. (IDCC) announced the establishment of the Haptic Excellence Center. The collaborative venture establishes a center of excellence dedicated to foster the innovation, education, implementation, and promotion of haptic technology for enhanced media experiences. Alongside audio and video, haptics is now a first order media type as digital devices equipped with haptic technology have become more ubiquitous. According to the Futuresource and InterDigital white paper \"Haptics: The next modality in immersive entertainment,\" there were roughly 4.1 billion haptic-enabled consumer devices in use at the end of 2024, and projections that 53% of consumer devices will be haptic enabled by 2028."},{"time":"04:56","ticker":"CSCO","headline":"Cisco broadens AgenticOps, security, and AI networking platform","body":"• Cisco announced new AgenticOps capabilities across networking, security, and observability, advancing its agent-first IT operating model for autonomous operations with built-in oversight.Co expanded its security portfolio to support agentic AI adoption, adding protections for autonomous agents, governance over agent interactions, and resilient, cryptographically secured connectivity across hybrid environments.Co unveiled the Silicon One G300, a 102.4 Tbps switching chip designed for large-scale AI clusters, forming the backbone of new Cisco N9000 and 8000 data center systems.Co enhanced Nexus One to simplify operation of AI networks across on-premises and cloud environments, aiming to reduce complexity and improve efficiency as customers scale AI infrastructure.\n• Co expanded its security portfolio to support agentic AI adoption, adding protections for autonomous agents, governance over agent interactions, and resilient, cryptographically secured connectivity across hybrid environments.\n• Co unveiled the Silicon One G300, a 102.4 Tbps switching chip designed for large-scale AI clusters, forming the backbone of new Cisco N9000 and 8000 data center systems.\n• Co enhanced Nexus One to simplify operation of AI networks across on-premises and cloud environments, aiming to reduce complexity and improve efficiency as customers scale AI infrastructure."},{"time":"04:54","ticker":"ORCL","headline":"Oracle expands Fusion Cloud with embedded AI agents across CX and supply chain","body":"• Oracle announced new role-based AI agents embedded in Oracle Fusion Cloud Applications to support customer experience, supply chain, and manufacturing workflows.Co's CX-focused AI agents are integrated into marketing, sales, and service processes to analyze unified data, automate tasks, and deliver predictive insights at scale.Co also introduced AI agents across planning, procurement, manufacturing, maintenance, and logistics to automate end-to-end supply chain workflows and accelerate decision-making.Co added new Oracle Fusion Cloud SCM capabilities for process manufacturing, enabling real-time production visibility and improved regulatory compliance through unified management of formulas, materials, and batch execution.\n• Co's CX-focused AI agents are integrated into marketing, sales, and service processes to analyze unified data, automate tasks, and deliver predictive insights at scale.\n• Co also introduced AI agents across planning, procurement, manufacturing, maintenance, and logistics to automate end-to-end supply chain workflows and accelerate decision-making.\n• Co added new Oracle Fusion Cloud SCM capabilities for process manufacturing, enabling real-time production visibility and improved regulatory compliance through unified management of formulas, materials, and batch execution."},{"time":"04:52","ticker":"GSK","headline":"GlaxoSmithKline advances RSV vaccine toward first adult approval in China","body":"• GSK plc announced that China's Center for Drug Evaluation accepted Arexvy for regulatory review to prevent RSV-related lower respiratory tract disease in adults aged 60 and older.Co is positioned to become the first approved RSV vaccine in China for this age group, where RSV affects more than 6 mln people annually.Co's submission is supported by Phase III China trial data showing positive safety and immunogenicity results with all primary endpoints met.Co expects a regulatory decision in 2027, reflecting standard review timelines in China.\n• Co is positioned to become the first approved RSV vaccine in China for this age group, where RSV affects more than 6 mln people annually.\n• Co's submission is supported by Phase III China trial data showing positive safety and immunogenicity results with all primary endpoints met.\n• Co expects a regulatory decision in 2027, reflecting standard review timelines in China."},{"time":"04:50","ticker":"TSM","headline":"Taiwan Semiconductor Manufacturing reports Jan revs increased 36.8% yr/yr","body":"• Co announced its net revenue for January 2026: On a consolidated basis, revenue for January 2026 was approximately NT$401.26 billion, an increase of 19.8% from December 2025 and an increase of 36.8% from January 2025."},{"time":"04:49","ticker":"AZN","headline":"AstraZeneca beats by $0.01, reports revs in-line","body":"• Reports Q4 (Dec) earnings of $2.12 per share, $0.01 better than the FactSet Consensus of $2.11; revenues rose 4.1% year/year to $15.5 bln vs the $15.46 bln FactSet Consensus.Second interim dividend declared of $2.17 per share (159.5 pence, 19.49 SEK). Total dividend declared for FY 2025 increased by 3% to $3.20 per share\n• Second interim dividend declared of $2.17 per share (159.5 pence, 19.49 SEK). Total dividend declared for FY 2025 increased by 3% to $3.20 per share\n• OutlookTotal Revenue is expected to increase by a mid-to-high single-digit percentageCore EPS is expected to increase by a low double-digit percentage\n• Total Revenue is expected to increase by a mid-to-high single-digit percentage\n• Core EPS is expected to increase by a low double-digit percentage"},{"time":"04:46","ticker":"ASX","headline":"ASE Technology reports January revs increased 21.3% yr/yr to ~NT$59.99 bln","body":""},{"time":"04:46","ticker":"UBER","headline":"Uber: Baidu (BIDU) expands Apollo Go overseas with autonomous Uber launch in Dubai","body":"• Baidu Inc. will deploy its Apollo Go autonomous ride-hailing service on the Uber platform in Dubai, in partnership with Uber Technologies and Dubai's Roads and Transport Authority.Co plans to launch fully driverless rides within the Jumeirah area in the coming month, with expansion subject to regulatory approvals and operational performance.Co is positioned to leverage Uber's consumer platform while supporting Dubai's target for 25% of all transportation trips to be autonomous by 2030.Co highlighted Apollo Go's scale, with more than 240 mln autonomous kilometers logged and over 17 mln cumulative rides completed globally.\n• Co plans to launch fully driverless rides within the Jumeirah area in the coming month, with expansion subject to regulatory approvals and operational performance.\n• Co is positioned to leverage Uber's consumer platform while supporting Dubai's target for 25% of all transportation trips to be autonomous by 2030.\n• Co highlighted Apollo Go's scale, with more than 240 mln autonomous kilometers logged and over 17 mln cumulative rides completed globally."},{"time":"04:28","ticker":"AVA","headline":"Avista raises dividend","body":"• Co's board of directors has declared a quarterly dividend of $0.4925 per share on the company's common stock, yielding an annualized dividend of $1.97. The common stock dividend is payable March 13, 2026, to shareholders of record at the close of business on February 25, 2026.\n• This is up from annual rate of $1.97 per share."},{"time":"04:27","ticker":"CE","headline":"Celanese raises acetic acid, VAM and derivative prices across Western Hemisphere","body":"• Celanese Corporation announced price increases for acetic acid, vinyl acetate monomer, and related derivatives in the Western Hemisphere, effective immediately or as contracts allow.Co increased acetic acid prices by $50/MT in the U.S./Canada and Mexico/South America and by 50/MT in EMEA.Co raised vinyl acetate monomer prices by $100/MT in the Americas and 100/MT in EMEA, representing the largest adjustment in the slate.Co will implement derivative product price increases on a customer-by-customer basis, reflecting product-specific exposure and contract structures.\n• Co increased acetic acid prices by $50/MT in the U.S./Canada and Mexico/South America and by 50/MT in EMEA.\n• Co raised vinyl acetate monomer prices by $100/MT in the Americas and 100/MT in EMEA, representing the largest adjustment in the slate.\n• Co will implement derivative product price increases on a customer-by-customer basis, reflecting product-specific exposure and contract structures."},{"time":"04:25","ticker":"SVM","headline":"Silvercorp Metals reports Q3 results","body":"VANCOUVER, BC, Feb. 9, 2026 /PRNewswire/ - Silvercorp Metals Inc. (\"Silvercorp\" or the \"Company\") (TSX: SVM) (NYSE American: SVM) reported its financial and operating results for the three months ended December 31, 2025 (\"Q3 Fiscal 2026\"). All amounts are expressed in US dollars, and figures may not add due to rounding.Click here for full release."},{"time":"04:22","ticker":"CCSI","headline":"Consensus Cloud Solutions beats by $0.11; beats on revs; sees Q1, FY26 EPS and revs in-line","body":"• Reports Q4 EPS of $1.41 vs $1.30 FactSet consensus; revs of $87.1 mln vs $86.6 mln consensus\n• OutlookQ1 Co sees Q1 EPS of $1.36-1.46 vs 1.38 consensusCo sees Q1 revs of $85.4-89.4 mln vs 87.3 mln consensusFY26Co sees FY26 EPS of $5.55-5.95 vs 5.62 consensusCo sees FY26 revs of $350.0-357.0 mln vs $352.6 mln consensus\n• Q1 Co sees Q1 EPS of $1.36-1.46 vs 1.38 consensusCo sees Q1 revs of $85.4-89.4 mln vs 87.3 mln consensus\n• Co sees Q1 EPS of $1.36-1.46 vs 1.38 consensus\n• Co sees Q1 revs of $85.4-89.4 mln vs 87.3 mln consensus\n• FY26Co sees FY26 EPS of $5.55-5.95 vs 5.62 consensusCo sees FY26 revs of $350.0-357.0 mln vs $352.6 mln consensus\n• Co sees FY26 EPS of $5.55-5.95 vs 5.62 consensus\n• Co sees FY26 revs of $350.0-357.0 mln vs $352.6 mln consensus"},{"time":"04:16","ticker":"SLP","headline":"Simulations Plus extends FDA and NIEHS research collaborations on computational safety models","body":"• Simulations Plus announced extensions of separate research collaborations with the U.S. Food and Drug Administration and the National Institute of Environmental Health Sciences.Co will continue supporting federal research into non-animal, computational, and AI-driven methodologies for food, chemical, and environmental safety assessments.The FDA collaboration expands work on AI-based chemical safety models, supported by new federal funding and access to curated toxicology datasets for validation and benchmarking.The NIEHS extension continues applying Simulations Plus' software to environmental exposure research, aligned with national efforts to modernize chemical safety evaluation.\n• Co will continue supporting federal research into non-animal, computational, and AI-driven methodologies for food, chemical, and environmental safety assessments.\n• The FDA collaboration expands work on AI-based chemical safety models, supported by new federal funding and access to curated toxicology datasets for validation and benchmarking.\n• The NIEHS extension continues applying Simulations Plus' software to environmental exposure research, aligned with national efforts to modernize chemical safety evaluation."},{"time":"04:11","ticker":"ELVR","headline":"Elevra Lithium outlines potential Canadian offtake for spodumene concentrate with supply agreement with Mangrove Lithium","body":"• Elevra Lithium Limited signed a non-binding memorandum of understanding with Mangrove Lithium to supply up to 144,000 tonnes per year of spodumene concentrate from North American Lithium, subject to a future binding agreement.Co plans for the proposed offtake to run for five years starting in 2028, ramping to full volume by 2030 and representing about 46% of estimated sales volumes.The framework includes market-linked pricing with floor and ceiling mechanisms, aiming to support positive cash flow across lithium price cycles.The arrangement is contingent on Mangrove making a final investment decision by June 2027 for a Canadian lithium conversion facility, positioning the deal as optional upside rather than committed revenue.\n• Co plans for the proposed offtake to run for five years starting in 2028, ramping to full volume by 2030 and representing about 46% of estimated sales volumes.\n• The framework includes market-linked pricing with floor and ceiling mechanisms, aiming to support positive cash flow across lithium price cycles.\n• The arrangement is contingent on Mangrove making a final investment decision by June 2027 for a Canadian lithium conversion facility, positioning the deal as optional upside rather than committed revenue."},{"time":"04:05","ticker":"DC","headline":"Dakota Gold Corp. prices offering of 12,336,000 shares of its common stock for gross proceeds of $75 mln","body":""},{"time":"04:03","ticker":"TAK","headline":"Takeda Pharma moves closer to first orexin-based treatment for narcolepsy type 1","body":"• Takeda Pharmaceutical Company received FDA acceptance and Priority Review for the New Drug Application for oveporexton (TAK-861) for narcolepsy type 1, with a PDUFA action date set for Q3 2026.Co is seeking approval for what could become the first orexin receptor 2 agonist therapy designed to address the underlying orexin deficiency driving narcolepsy type 1, rather than only managing symptoms.Phase 3 data showed statistically significant and clinically meaningful improvements across excessive daytime sleepiness, cataplexy, attention, and quality of life, with a generally consistent safety profile.Takeda expects no material impact on its FY2025/26 consolidated forecast, positioning the potential approval as a pipeline catalyst rather than a near-term financial driver.\n• Co is seeking approval for what could become the first orexin receptor 2 agonist therapy designed to address the underlying orexin deficiency driving narcolepsy type 1, rather than only managing symptoms.\n• Phase 3 data showed statistically significant and clinically meaningful improvements across excessive daytime sleepiness, cataplexy, attention, and quality of life, with a generally consistent safety profile.\n• Takeda expects no material impact on its FY2025/26 consolidated forecast, positioning the potential approval as a pipeline catalyst rather than a near-term financial driver."}],"fetchedAt":1770725103465},"savedAt":1770725103465}