{"data":{"updated":"2/19/2026, 9:58:14 AM","entries":[{"time":"09:00","ticker":"WRAPX","headline":"S&amp;P futures vs fair value: -24.00. Nasdaq futures vs fair value: -105.00.","body":"• In economic data: Japan's December Core Machinery Orders 19.1% m/m (expected 5.1%; last -11.0%); 16.8% yr/yr (expected 3.9%; last -6.4%) South Korea's January trade surplus $8.72 bln (expected surplus of $8.74 bln; last surplus of $12.17 bln). January Imports 11.6% yr/yr (expected 11.7%; last 4.6%) and Exports 33.8% yr/yr (expected 33.9%; last 13.3%) Australia's January Employment Change 17,800 (expected 20,000; last 68,500) and full employment change 50,500 (last 56,900). January Unemployment Rate 4.1% (expected 4.2%; last 4.1%) and Participation Rate 66.7% (expected 66.8%; last 68.5%)\n• Japan's December Core Machinery Orders 19.1% m/m (expected 5.1%; last -11.0%); 16.8% yr/yr (expected 3.9%; last -6.4%)\n• South Korea's January trade surplus $8.72 bln (expected surplus of $8.74 bln; last surplus of $12.17 bln). January Imports 11.6% yr/yr (expected 11.7%; last 4.6%) and Exports 33.8% yr/yr (expected 33.9%; last 13.3%)\n• Australia's January Employment Change 17,800 (expected 20,000; last 68,500) and full employment change 50,500 (last 56,900). January Unemployment Rate 4.1% (expected 4.2%; last 4.1%) and Participation Rate 66.7% (expected 66.8%; last 68.5%)\n• Japan's Nikkei: +0.6%\n• Hong Kong's Hang Seng: CLOSED\n• China's Shanghai Composite: CLOSED\n• India's Sensex: -1.5%\n• South Korea's Kospi: +3.1%\n• Australia's ASX All Ordinaries: +0.8%\n• In economic data: Eurozone's December Current Account surplus EUR14.6 bln (expected surplus of EUR9.8 bln; last surplus of EUR8.9 bln). December Construction Output 0.88% m/m (last -1.54%) U.K.'s February CBI Industrial Trends Orders -28, as expected (last -30) Spain's December trade deficit EUR5.57 bln (last deficit of EUR5.68 bln) Swiss January trade surplus CHF3.818 bln (last surplus of CHF934 mln). Q4 Industrial Production -0.7% yr/yr (last 2.0%)\n• Eurozone's December Current Account surplus EUR14.6 bln (expected surplus of EUR9.8 bln; last surplus of EUR8.9 bln). December Construction Output 0.88% m/m (last -1.54%)\n• U.K.'s February CBI Industrial Trends Orders -28, as expected (last -30)\n• Spain's December trade deficit EUR5.57 bln (last deficit of EUR5.68 bln)\n• Swiss January trade surplus CHF3.818 bln (last surplus of CHF934 mln). Q4 Industrial Production -0.7% yr/yr (last 2.0%)\n• STOXX Europe 600: -0.6%\n• Germany's DAX: -1.1%\n• U.K.'s FTSE 100: -0.6%\n• France's CAC 40: -0.8%\n• Italy's FTSE MIB: -1.3%\n• Spain's IBEX 35: -1.3%"},{"time":"08:47","ticker":"ASPI","headline":"ASP Isotopes' Quantum Leap Energy has formed a Strategic Advisory Board","body":"The SAB is expected to provide guidance and insights as QLE aims to address gaps in the nuclear fuel cycle, promote safe nuclear power, and enhance the sustainability of the nuclear fuel cycle for advanced nuclear reactors, fusion systems, as well as the existing nuclear fleet."},{"time":"08:46","ticker":"BKH","headline":"Black Hills Corp requests rate review in South Dakota","body":"• The Co. announced that its electric utility has filed a rate review application with the South Dakota Public Utilities Commission requesting recovery of the necessary capital infrastructure and operational costs required to deliver safe, reliable electric service to approximately 75,000 customers in South Dakota\n• The company is seeking $50.6 million in new annual revenue for recovery of approximately $523 million of critical investments since its last rate review in 2014 and increased costs of delivering safe and reliable electric service to homes and businesses. This includes investments to strengthen the electric grid, maintain reliability and reduce wildfire risk."},{"time":"08:45","ticker":"CME","headline":"CME Group announces that its regulated Cryptocurrency futures and options will be available for trading 24 hours a day, seven days a week beginning on May 29","body":""},{"time":"08:42","ticker":"SSTK","headline":"Shutterstock issues statement on CMA's interim report","body":"NEW YORK, Feb. 19, 2026 /PRNewswire/ -- Shutterstock, a family of brands delivering scalable creative and GenAI solutions, today issued the following statement on the UK Competition and Markets Authority's (CMA) provisional decision:Click here for full release."},{"time":"08:40","ticker":"ETOR","headline":"eToro Group Ltd entered into $50 mln accelerated share repurchase transaction","body":"• The ASR Transaction is being completed under the Company's previously announced share repurchase authorization, following an increase of $100.0 million to its then overall remaining availability of $50.0 million (with current overall remaining availability of $100.0 million after giving effect to the ASR Transaction).\n• The ASR Transaction is scheduled to terminate in the second calendar quarter of 2026."},{"time":"08:39","ticker":"LUCK","headline":"Lucky Strike Entertainment President Lev Ekster notified Lucky Strike Entertainment Corporation of his resignation","body":"he Company appointed Thomas Shannon, its Chairman and Chief Executive Officer, to replace Mr. Ekster as the President of the Company. Mr. Shannon will serve as Chairman, Chief Executive Officer and President of the Company."},{"time":"08:37","ticker":"LAES","headline":"SEALSQ Corp announces new strategic investment in EeroQ","body":"• Co announces a new strategic investment in EeroQ, a U.S.-based quantum chip design company pioneering a breakthrough quantum computing architecture based on electrons on helium (eHe).\n• This represents one of several investments made under SEALSQ's SEALQUANTUM.com Quantum Investment Fund platform and marks a new milestone in its \"Quantum Made in USA\" strategy, reinforcing its objective to build a \"Quantum Security Vertical Stack\" while accelerating the deployment of sovereign, scalable, and secure quantum technologies in the United States and Europe."},{"time":"08:36","ticker":"GATX","headline":"GATX beats by $0.02, reports revs in-line; guides FY26 EPS in-line; increases dividend and approves a new $300 mln share repurchase authorization","body":"• Reports Q4 (Dec) earnings of $2.44 per share, excluding non-recurring items, $0.02 better than the FactSet Consensus of $2.42; revenues rose 8.6% year/year to $449 mln vs the $445.17 mln FactSet Consensus.\n• Co issues in-line guidance for FY26, sees EPS of $9.50-10.10 vs. $10.02 FactSet Consensus. This guidance is inclusive of $0.20-$0.30 per share related to the acquisition of Wells Fargo's (WFC) rail operating lease portfolio, which was completed on Jan. 1, 2026.\n• Co also approves an 8.2% increase to its quarterly dividend to $0.66 per share.\n• Co also approves a new $300 mln share repurchase authorization, as the co's prior authorization from 2019 has largely been exhausted."},{"time":"08:36","ticker":"IDT","headline":"IDT Corp: net2phone launches integrated communications for hospitality providers","body":"• Co introduces an enhanced communications solution for the hospitality industry. net2phone's cloud-native voice, video, and messaging capabilities synchronize in real time with many popular property management system (PMS) platforms for unified reporting and streamlined workflows.\n• To further maximize efficiency and automate workflows, net2phone's AI Agent integrates with its hospitality communications solution to automate front desk operations and enhance customer service.\n• net2phone is a subsidiary of IDT Corporation."},{"time":"08:35","ticker":"WIRES","headline":"On The Wires","body":"• IMAX (IMAX) announced they're working with Apple (AAPL) TV to bring the 2026 FIA Formula One World Championship live to select IMAX locations across the United States. Through the first-of-its-kind collaboration, five of the most iconic Grands Prix in F1 - Miami, Monaco, Silverstone, Monza, and Austin - will be available across at least 50 IMAX locations nationwide.\n• Parse Biosciences, a QIAGEN company (QGEN), announced the launch of the new Evercode Whole Transcriptome v4 product line, delivering expanded scalability, higher sensitivity and a simplified workflow for single-cell RNA sequencing. Evercode v4 supports extraordinary scalability of up to five million cells and 384 samples in a single run, enabling researchers to design large studies while maintaining sample resolution. The upgraded chemistry increases gene detection per cell while requiring fewer sequencing reads, helping reduce overall sequencing costs.\n• RingCentral (RNG) announced it is integrating OpenAI to advance enterprise-grade voice AI. The effort combines RingCentral's trusted communications platform with OpenAI frontier models like GPT-5.2 to bring generative AI into the most valuable business communication channel: voice. This effort will enable organizations to work smarter, serve customers faster, and unlock the full value of every conversation.\n• Sharplink (SBET) announced record level institutional ownership of its common stock. According to the latest available Form 13F filings, institutional ownership of Sharplink's common stock has grown to 46% as of December 31, 2025."},{"time":"08:34","ticker":"ANGO","headline":"AngioDynamics announces expanded European indications for its NanoKnife System to include soft tissue ablation for tumors of the liver, pancreas, kidney, and prostate, including in patients with intermediate-risk prostate cancer","body":"• The expanded indications increase physician access to the NanoKnife System's irreversible electroporation technology across key oncologic applications, supporting the treatment of patients with tumors that may be difficult to resect or located near critical structures.\n• The NanoKnife System utilizes irreversible electroporation (IRE), a non-thermal ablation technology designed to destroy tumor cells while preserving critical surrounding anatomy such as blood vessels, bile ducts, and nerves. This differentiated mechanism of action makes it particularly suited for tumors located in complex anatomical regions, such as the pancreas and liver."},{"time":"08:34","ticker":"WRAPX","headline":"S&amp;P futures vs fair value: -25.00. Nasdaq futures vs fair value: -128.00.","body":"The S&P 500 futures currently trade 25 points below fair value. Initial jobless claims for the week ending February 14 decreased by 23,000 to 206,000 (Briefing.com consensus: 225,000) from an upwardly revised 229,000 (from 227,000). Continuing jobless claims for the week ending February 7 increased by 17,000 to 1.869 million, from a downwardly revised 1.852 million (from 1.862 million). The U.S. trade deficit widened to $70.3 billion in December (Briefing.com consensus: -$55.8 billion) from an upwardly revised $53.0 billion (from -$56.8 billion) in November. The Philadelphia Fed Index checked in at 16.3 in February (Briefing.com consensus 8.5) from a prior reading of 12.6."},{"time":"08:33","ticker":"OSIS","headline":"OSI Systems receives ECAC/EU G1 certification of trace detection solutions for airport security","body":"• Co announces that its Security division's Itemiser 4DX and new Itemiser 5X trace detection systems have achieved ECAC/EU G1 approval, meeting the highest European standards for aviation security. This approval reflects compliance with the European Civil Aviation Conference (ECAC) and European Commission requirements for trace detection systems, supporting enhanced security for airline passengers."},{"time":"08:32","ticker":"ERIC","headline":"Ericsson's Vonage expands developer ecosystem to accelerate the next era of enterprise digital transformation","body":"Vonage verified Postman workspace extends reach by 40+ million developers; MCP servers and Startup Program among resources designed to further accelerate time-to-value for developers and enterprises."},{"time":"08:32","ticker":"VWAV","headline":"VisionWave Holdings announces that it has begun early-stage architecture and feasibility work on a conceptual AI-controlled intelligent radar system concept designed, which if successfully developed, may potentially enhance the survivability and continuity of sensing by distributing radar-related functions across a network of mesh-connected RF units","body":""},{"time":"08:31","ticker":"ECONX","headline":"February Philadelphia Fed Index 16.3 vs. 8.5 Briefing.com consensus; prior 12.6","body":""},{"time":"08:30","ticker":"ECONX","headline":"December Trade Balance -$70.3 bln vs. -$55.8 bln Briefing.com consensus; prior revised to -$53.0 bln from -$56.8 bln","body":""},{"time":"08:30","ticker":"ECONX","headline":"Weekly Continuing Claims 1.869 mln --- prior revised to 1.852 mln from 1.862 mln","body":""},{"time":"08:30","ticker":"ECONX","headline":"Weekly Initial Claims 206K vs. 225K Briefing.com consensus; prior revised to 229K from 227K","body":""},{"time":"08:16","ticker":"AMTM","headline":"Amentum Holdings will open a new worldwide headquarters in Reston, Virginia in early 2027","body":""},{"time":"08:13","ticker":"WIRES","headline":"On The Wires","body":"• WD (WDC) announced the re-launch of its G-DRIVE brand as the unified identity for its content creator and creative professional external storage product portfolio. The brand consolidation brings together high-capacity, high-performance storage solutions under a single name brand -- G-DRIVE -- known for its quality, performance, and reliability.\n• United Airlines (UAL) is giving travelers three new reasons to hold and use a United MileagePlus credit or debit card: the ability to earn up to twice as many miles as non-cardholders, at least 10% off United award tickets and access to special inventory of its lowest-priced award seats.\n• Jefferies (JEF) unit M Science announced the launch of Maddie, a multi-agent AI solution for investment intelligence. Designed to operate at the intersection of proprietary data and institutional workflows, Maddie transforms the traditional research process from a static consumption model into a dynamic, real-time dialogue.\n• Boeing (BA) 777-9 flight training simulators are one step closer to conducting regulator-approved pilot training after the FAA and European Union Aviation Safety Agency issued simulator qualification certificates granting initial qualification.\n• FOREWARN (RDVT) announced that Memphis Area Association of REALTORS is offering FOREWARN services to its 4,600+ members to promote proactive real estate agent safety. Available both online and through a mobile application, FOREWARN analyzes billions of data points and provides users with the ability to mitigate risks by verifying identity, searching for criminal histories, and validating information provided by potential clients using just a phone number. FOREWARN allows agents to properly and safely plan for showings with a higher level of confidence."},{"time":"08:11","ticker":"WIRES","headline":"On The Wires","body":"• Samsung (SSNLF) HVAC North America unveiled the next generation of Hylex, its advanced electric heat pump system designed to deliver reliable heating performance in cold and variable climates while supporting the region's growing shift toward electrification.\n• Teledyne HiRel Semiconductors (TDY) announced the TDLNA0840EP, an ultra-low-power, wideband, low-noise amplifier that delivers guaranteed operation to 4.0 GHz, while consuming only tens of milliwatts from a single 1.5-volt supply. With a typical gain of 29 dB and a typical noise figure of 1.5 dB across 0.3--4.0 GHz, the TDLNA0840EP enables significant power savings in space, avionics, and battery-constrained RF systems."},{"time":"08:08","ticker":"OSS","headline":"One Stop Systems announces $10.5 mln in new awards to support US Navy P-8A Poseidon aircraft program","body":""},{"time":"08:07","ticker":"AWI","headline":"Armstrong World Industries expands architectural specialties design and fabrication capabilities with acquisition of Eventscape","body":"• Eventscape was founded in 1999 and now employs 150 highly skilled professionals including architects, industrial and interior designers, engineers, specialized fabricators and expert craftsmen. The business has headquarters along with a design studio and fabrication facility in Toronto and a showroom and fabrication facility in New York.\n• In 2025, the company generated approximately $30 million in revenue. Armstrong funded the acquisition with a combination of available cash and its revolving credit facility, and District Capital Partners acted as its buyside adviser."},{"time":"08:07","ticker":"ONL","headline":"Orion Properties has entered into a new $215 mln senior secured revolving credit facility and extended its existing $355 million commercial mortgage-backed securities loan","body":"• These transactions meaningfully extend Orion's debt maturity profile and maintain the Company's healthy liquidity position.\n• The new $215 million revolving credit facility, entered into with four of the banks in the existing lender group, is secured by a pool of 28 properties and is scheduled to mature on February 18, 2029, inclusive of two six-month extension options. This new credit facility refinances and replaces the existing $350 million revolving credit facility that was due to mature on May 12, 2026, reduces the interest rate margin on our borrowings by 50-basis points, to SOFR plus 2.75%, and eliminates the 10-basis point SOFR adjustment. As of February 19, 2026, the Company had $113 million outstanding on the new revolving credit facility.\n• In addition, the Company amended its $355 million CMBS loan secured by 19 properties, which was due to mature in February 2027. The amendment extends the maturity date by three and a half years to August 2030, inclusive of two additional extension options for a total of 18 months. During this time, the fixed interest rate of 4.971% will remain unchanged and excess cash flows after payment of interest and property operating expenses will be swept by the lender to be applied to a combination of prepaying the outstanding principal balance of the CMBS loan and funding reserves principally for capital expenditures.\n• Following these transactions, the Company had total liquidity of approximately $119.9 million, including cash and availability under the new revolving credit facility."},{"time":"08:05","ticker":"WIRES","headline":"On The Wires","body":"• Markel, the insurance operations within Markel Group Inc. (MKL), announced a new collaboration with Upfort to provide eligible U.S. cyber policyholders with an expanded suite of tools to help them safeguard their businesses and help reduce the risk of cyberattacks. Upfort Shield, a multi-layer cyber defense platform, is now available to Markel eligible cyber policyholders, providing AI-powered, automated protection against common cyber threats. Policyholders can also gain access to an easy-to-deploy endpoint detection and response solution that uses behavioral analytics to help reduce the chance of a breach. Service availability and pricing may vary.\n• Sequel Med Tech, LLC, a company developing transformative drug delivery technologies, and Senseonics Holdings (SENS) announced full availability of the twiist Automated Insulin Delivery System integrated with the Eversense 365 CGM system across the U.S. Powered by Tidepool, twiist is the first AID system compatible with Eversense 365, the world's only one-year CGM. This powerful combination is a significant leap forward for the diabetes community, offering a transformative solution for long-term diabetes management by significantly reducing the burden of frequent sensor changes and re-pairing while maintaining exceptional CGM accuracy."},{"time":"08:05","ticker":"ESOA","headline":"Energy Services of America announces pricing of $20 million public offering of common stock; at a price to the public of $11.50 per share","body":"• The aggregate gross proceeds to the Company from the offering will be approximately $20.0 million before underwriting discounts and commissions and expenses related to the offering. Assuming full exercise by the underwriter of its option to purchase additional shares, the aggregate gross proceeds to the Company from the offering would be approximately $23.0 million before underwriting discounts and commissions and expenses related to the offering.\n• The Company intends to use the net proceeds from the offering for general corporate purposes, working capital and for potential acquisitions. The Company has no current plans, arrangements or understandings relating to any specific acquisition or similar transaction. The offering is expected to close on February 20, 2026, subject to customary closing conditions."},{"time":"08:05","ticker":"WEAV","headline":"Weave Communications announces strategic CareCredit integration partnership with Synchrony","body":"• Weave (WEAV) announces a partnership with Synchrony (SYF), a consumer financial services company, to integrate the company's leading patient financing solution, CareCredit.\n• This integration streamlines practice operations and helps patients to confidently opt in to treatments sooner with both clearer and easier access to financing. By surfacing a patient's CareCredit status directly within Weave, front office staff can begin a more informed financial conversation before the patient even walks through the door."},{"time":"08:04","ticker":"SAVA","headline":"Cassava Sciences announces that the U.S. Department of Justice Fraud Section has closed its inquiry into the Company regarding allegations of research misconduct as described in the indictment in United States v. Wang, 8:24-cr-000211-TDC","body":"• That indictment was dismissed with prejudice by DOJ on October 23, 2025.\n• As previously disclosed, the Company reached a settlement with the U.S. Securities and Exchange Commission (SEC) of negligence-based disclosure charges in September 2024 and paid a monetary penalty without admitting or denying the SEC's allegations.\n• The Company cooperated fully with both the DOJ and SEC investigations. These outcomes end the investigations of the Company by the DOJ and SEC."},{"time":"08:03","ticker":"ITGR","headline":"Integer Holdings beats by $0.06, beats on revs; guides FY26 EPS in-line, revs in-line; Intends to commence an accelerated share repurchase program to repurchase approximately $50 mln of common stock","body":"• Reports Q4 (Dec) earnings of $1.76 per share, excluding non-recurring items, $0.06 better than the FactSet Consensus of $1.70; revenues rose 5.0% year/year to $472 mln vs the $462.72 mln FactSet Consensus.\n• Accelerated Share Repurchase: The Company intends to commence an accelerated share repurchase program to repurchase approximately $50 mln of the Company's common stock under its existing share repurchase program previously authorized by the Board of Directors, which authorized the repurchase of up to $200 million of the Company's common stock.\n• Co issues in-line guidance for FY26, sees EPS of $6.29-$6.78, excluding non-recurring items, vs. $6.30 FactSet Consensus; sees FY26 revs of $1.826-$1.876 bln vs. $1.84 bln FactSet Consensus."},{"time":"08:03","ticker":"CRWD","headline":"CrowdStrike announces a new integration with Qualtrics","body":"• Co and Qualtrics announce a new integration that adds a new layer of security to customer and employee experience programs, giving organizations real-time visibility to detect and address risks proactively.\n• The integration connects CrowdStrike Falcon Shield with the Qualtrics XM Platform to provide organizations with real-time visibility and automated protection for user activity, permission, configurations, and data access."},{"time":"08:02","ticker":"TALK","headline":"Talkspace announces fourth quarter results with 2026 guidance","body":"NEW YORK, Feb. 19, 2026 (GLOBE NEWSWIRE) -- Talkspace, Inc. (\"Talkspace\" or the \"Company\") (NASDAQ: TALK), today reported fourth quarter and full year 2025 financial results.Click here for full release."},{"time":"08:01","ticker":"WRAPX","headline":"S&amp;P futures vs fair value: -18.00. Nasdaq futures vs fair value: -93.00.","body":"• OpenAI funding could top $100 billion, according to Bloomberg.\n• DoorDash (DASH 190.00, +16.62, +9.6%) reported revenues in line and reported adjusted EBITDA above the midpoint of guidance; Q4 total orders grew 32% yr/yr to 903 million.\n• eBay (EBAY 88.50, +6.32, +7.7%) beat EPS expectations by $0.06, beat on revenues, and guided Q1 EPS above consensus with revenues above consensus. The company increased its dividend and authorised a $2 billion increase to share repurchase program to acquire Depop\n• Walmart (WMT 122.38, -4.24, -3.4%) beat EPS expectations by $0.01 and reported revenues in-line. The company guided Q1 and FY27 EPS below expectations and authorized a $30 billion share-repurchase program.\n• South Korea's Kospi (+3.1%) reopened after this week's closure, vaulting to a fresh record high with help from relative strength in Samsung Electronics.\n• Japan reported a big jump in Core Machinery Orders for December (+19.1% m/m; expected 5.1%), though it will be interesting to see if the growth is sustained in the coming months.\n• Japan's December Core Machinery Orders 19.1% m/m (expected 5.1%; last -11.0%); 16.8% yr/yr (expected 3.9%; last -6.4%)\n• South Korea's January trade surplus $8.72 bln (expected surplus of $8.74 bln; last surplus of $12.17 bln). January Imports 11.6% yr/yr (expected 11.7%; last 4.6%) and Exports 33.8% yr/yr (expected 33.9%; last 13.3%)\n• Australia's January Employment Change 17,800 (expected 20,000; last 68,500) and full employment change 50,500 (last 56,900). January Unemployment Rate 4.1% (expected 4.2%; last 4.1%) and Participation Rate 66.7% (expected 66.8%; last 68.5%)\n• Rio Tinto reported good results while Airbus beat Q4 expectations but issued cautious delivery guidance for the year.\n• Air France beat expectations thanks to strong cost controls. '\n• European Central Bank President Lagarde told other ECB policymakers that she remains focused on her job amid recent reports that she will leave her post before the end of her term.\n• The ECB's latest Economic Bulletin noted that the central bank needs to ensure that inflation stabilizes at the 2.0% target in the medium term.\n• Eurozone's December Current Account surplus EUR14.6 bln (expected surplus of EUR9.8 bln; last surplus of EUR8.9 bln). December Construction Output 0.88% m/m (last -1.54%)\n• U.K.'s February CBI Industrial Trends Orders -28, as expected (last -30)\n• Spain's December trade deficit EUR5.57 bln (last deficit of EUR5.68 bln)\n• Swiss January trade surplus CHF3.818 bln (last surplus of CHF934 mln). Q4 Industrial Production -0.7% yr/yr (last 2.0%)"},{"time":"07:58","ticker":"BONDX","headline":"Overnight Treasury Market Summary","body":"• U.S. Treasuries are on track for a modestly lower start after facing some pressure in the overnight futures market. Treasury futures began slipping in early evening action, continuing their retreat until the start of the European session, when a rebound took shape. The selling coincided with general softness in other sovereign debt with relative weakness in Australian bonds after the release of a good employment report for January. Japan reported a big jump in Core Machinery Orders for December (+19.1% m/m; expected 5.1%), and the market will be eager to see if this strength can be sustained in the coming months since it would imply accelerating activity in Japan's economy. The U.S. session will see the release of a handful of economic reports, headlined by weekly Initial Claims (Briefing.com consensus 225,000; prior 227,000) and December Trade Balance (Briefing.com consensus -$55.8 bln; prior -$56.8 bln). Crude oil is on the verge of overtaking its January high (66.48) while the U.S. Dollar Index is up 0.1% at 97.82.\n• Yield Check: 2-yr: +1 bp to 3.47% 3-yr: +2 bps to 3.51% 5-yr: +1 bp to 3.66% 10-yr: +2 bps to 4.10% 30-yr: +2 bps to 4.73%\n• 2-yr: +1 bp to 3.47%\n• 3-yr: +2 bps to 3.51%\n• 5-yr: +1 bp to 3.66%\n• 10-yr: +2 bps to 4.10%\n• 30-yr: +2 bps to 4.73%\n• News: The European Central Bank's latest Economic Bulletin noted that the central bank needs to ensure that inflation stabilizes at the 2.0% target in the medium term. European Central Bank President Lagarde told other ECB policymakers that she remains focused on her job amid recent reports that she will leave her post before the end of her term. Japan's December Core Machinery Orders jumped 19.1% m/m (expected 5.1%; last -11.0%), rising 16.8% yr/yr (expected 3.9%; last -6.4%). South Korea's January trade surplus reached $8.72 bln (expected surplus of $8.74 bln; last surplus of $12.17 bln) as imports grew 11.6% yr/yr (expected 11.7%; last 4.6%) and exports rose 33.8% yr/yr (expected 33.9%; last 13.3%). Australia's January Employment increased by 17,800 (expected 20,000; last 68,500) and full employment increased by 50,500 (last 56,900). January Unemployment Rate remained at 4.1% (expected 4.2%) and Participation Rate fell to 66.7% from 68.5% (expected 66.8%). Eurozone's December Current Account surplus reached EUR14.6 bln (expected surplus of EUR9.8 bln; last surplus of EUR8.9 bln). December Construction Output was up 0.88% m/m (last -1.54%). U.K.'s February CBI Industrial Trends Orders rose to -28 from -30, as expected. Spain's December trade deficit reached EUR5.57 bln (last deficit of EUR5.68 bln). Swiss January trade surplus reached CHF3.818 bln (last surplus of CHF934 mln). Q4 Industrial Production was down 0.7% yr/yr (last 2.0%).\n• The European Central Bank's latest Economic Bulletin noted that the central bank needs to ensure that inflation stabilizes at the 2.0% target in the medium term.\n• European Central Bank President Lagarde told other ECB policymakers that she remains focused on her job amid recent reports that she will leave her post before the end of her term.\n• Japan's December Core Machinery Orders jumped 19.1% m/m (expected 5.1%; last -11.0%), rising 16.8% yr/yr (expected 3.9%; last -6.4%).\n• South Korea's January trade surplus reached $8.72 bln (expected surplus of $8.74 bln; last surplus of $12.17 bln) as imports grew 11.6% yr/yr (expected 11.7%; last 4.6%) and exports rose 33.8% yr/yr (expected 33.9%; last 13.3%).\n• Australia's January Employment increased by 17,800 (expected 20,000; last 68,500) and full employment increased by 50,500 (last 56,900). January Unemployment Rate remained at 4.1% (expected 4.2%) and Participation Rate fell to 66.7% from 68.5% (expected 66.8%).\n• Eurozone's December Current Account surplus reached EUR14.6 bln (expected surplus of EUR9.8 bln; last surplus of EUR8.9 bln). December Construction Output was up 0.88% m/m (last -1.54%).\n• U.K.'s February CBI Industrial Trends Orders rose to -28 from -30, as expected.\n• Spain's December trade deficit reached EUR5.57 bln (last deficit of EUR5.68 bln).\n• Swiss January trade surplus reached CHF3.818 bln (last surplus of CHF934 mln). Q4 Industrial Production was down 0.7% yr/yr (last 2.0%).\n• Commodities: WTI Crude: +1.5% to $66.19/bbl Gold: -0.1% to $5005.60/ozt Copper: -1.7% to $5.705/lb\n• WTI Crude: +1.5% to $66.19/bbl\n• Gold: -0.1% to $5005.60/ozt\n• Copper: -1.7% to $5.705/lb\n• Currencies: EUR/USD: -0.1% to 1.1767 GBP/USD: -0.2% to 1.3460 USD/CNH: +0.2% to 6.8999 USD/JPY: UNCH at 154.78\n• EUR/USD: -0.1% to 1.1767\n• GBP/USD: -0.2% to 1.3460\n• USD/CNH: +0.2% to 6.8999\n• USD/JPY: UNCH at 154.78\n• Data out Today: 8:30 ET: Weekly Initial Claims (Briefing.com consensus 225,000; prior 227,000), Continuing Claims (prior 1.862 mln), December Trade Balance (Briefing.com consensus -$55.8 bln; prior -$56.8 bln), and February Philadelphia Fed survey (Briefing.com consensus 8.5; prior 12.6) 10:00 ET: January Pending Home Sales (Briefing.com consensus 1.4%; prior -9.3%) 10:30 ET: Weekly natural gas inventories (prior -249 bcf) 12:00 ET: Weekly crude oil inventories (prior +8.53 mln)\n• 8:30 ET: Weekly Initial Claims (Briefing.com consensus 225,000; prior 227,000), Continuing Claims (prior 1.862 mln), December Trade Balance (Briefing.com consensus -$55.8 bln; prior -$56.8 bln), and February Philadelphia Fed survey (Briefing.com consensus 8.5; prior 12.6)\n• 10:00 ET: January Pending Home Sales (Briefing.com consensus 1.4%; prior -9.3%)\n• 10:30 ET: Weekly natural gas inventories (prior -249 bcf)\n• 12:00 ET: Weekly crude oil inventories (prior +8.53 mln)"},{"time":"07:56","ticker":"UPST","headline":"Upstart announces that it purchased $100 million of common stock over the last four trading days","body":"These shares were repurchased in open market transactions pursuant to a $400 million share repurchase program previously authorized by the Upstart Board of Directors. After these repurchases, there is $122 million remaining under the program."},{"time":"07:49","ticker":"ALL","headline":"Allstate estimates catastrophe losses for the month of January of $175 mln or $138 mln, after-tax, primarily related to Winter Storm Fern","body":""},{"time":"07:41","ticker":"AAL","headline":"American Airlines  announced that its future deliveries of Airbus (EADSY) A321neos will continue to be powered by the CFM LEAP-1A engine from CFM International, a joint venture between GE Aerospace (GE) and Safran (SAFRY) Aircraft Engines","body":"• These engines will be installed on the Airbus A321neos that American ordered two years ago. As part of the expanded partnership, CFM International will continue to provide long-term maintenance for American's CFM LEAP-1A engines for years to come.\n• American has the youngest fleet of the legacy U.S. carriers, with 84 A321neos and five A321XLRs in its fleet, with an additional 120 A321neos and 35 A321XLRs on order through 2032, all to be powered by CFM LEAP-1A engines. American also has options to purchase 116 additional A320 family aircraft from Airbus which, if exercised, will also be outfitted with the CFM LEAP-1A engine.\n• The airline recently debuted the A321XLR, elevating transcontinental travel. As the only U.S.-based airline to operate the aircraft, American offers customers luxurious Flagship Suite seats, relaxing Premium\n• Economy seats and a reimagined Main Cabin, all featuring high-speed Wi-Fi and complimentary seatback entertainment with Bluetooth connectivity throughout the journey.\n• American first selected the CFM LEAP-1B engine in 2011 when it announced its purchase of 100 Boeing 737 MAX aircraft. The airline currently has 93 Boeing 737 MAX aircraft in operation with an additional 125 on order. The relationship expanded three years later when American chose the LEAP-1A engine for its order of A321neos."},{"time":"07:38","ticker":"KLAR","headline":"Klarna Group plc reports Q4 results, revs in-line, GMV increased 32%; guides Q1 revs in-line","body":"• Reports Q4 (Dec) results; revenues rose 38.5% year/year to $1.08 bln vs the $1.07 bln FactSet Consensus.\n• GMV grew 32% yr/yr (23% like-for-like) in Q4, with like-for-like growth consistent with the prior quarter. U.S. GMV grew 43% year-over-year in Q4.\n• Transaction margin dollars grew 17% yr/yr in Q4, representing a 28 percentage point quarter-over-quarter acceleration, but came in at $372 mln, below the guidance range.\n• Provision for credit losses declined to 0.65% of GMV in Q4, down 7 basis points quarter-over-quarter.\n• Co issues in-line guidance for Q1, sees Q1 revs of $900-$980 mln vs. $965.77 mln FactSet Consensus. Sees GMV of $32-$33 bln, representing growth of 26-30%.\n• 2026 Guidance: Sees GMV of more than $155 bln and revenue of more than 2.8% of GMV."},{"time":"07:38","ticker":"ALIT","headline":"Alight reports fourth quarter results; will replace its cash dividend with more efficient capital allocation activities","body":"Alight, Inc. (NYSE: ALIT), a leading provider of health, wealth, and leave administrative solutions, today reported results for the fourth quarter and full year ended December 31, 2025.Click here for full release."},{"time":"07:37","ticker":"BWAY","headline":"Brainsway invests $1.0 mln in BrainStim Health, expands minority-stake strategy","body":"• BrainsWay announced a strategic equity financing agreement to invest $1.0 mln initially in Canada-based BrainStim Health for a minority position via a preferred, annually compounding security.\n• The agreement includes potential additional milestone-based investments of up to $1.5 mln and provides for a redemption mechanism related to the shares.\n• Co said the investment marks its fifth minority-stake investment in growth-oriented mental health service platforms, supporting its strategy to expand access to Deep TMS while focusing on technology advancement.\n• BrainStim operates mental health clinics in British Columbia, and the partnership is aimed at accelerating clinic growth and increasing adoption of BrainsWay's neurostimulation treatments."},{"time":"07:37","ticker":"VALE","headline":"Vale S.A. Base Metals enters into an agreement to form a four-party consortium for Thompson Nickel Belt","body":"• Co announces that its subsidiary Vale Base Metals has signed an agreement with Exiro Minerals Corporation, Orion Resources Partners, and Canada Growth Fund to create a new consortium of owners for the Thompson Nickel Belt in Manitoba.\n• The transaction is part of the strategic review of Thompson, aimed at strengthening the competitiveness of VBM's global mining portfolio, and positioning the operations for long-term value creation.\n• Under the agreement, the companies will form a new company in which Exiro, Orion and CGF will own 81.1%, while VBM will retain an 18.9% minority stake. The consortium partners have also committed to investing up to US$ 200 million to secure the future of nickel mining in Thompson, Manitoba.\n• In addition, VBM has signed an offtake agreement for the nickel concentrate produced at the Thompson Mill to maintain its strategic position as Canada's leading nickel producer.\n• The transaction is expected to close by the end of 2026, subject to customary regulatory and government authorization."},{"time":"07:37","ticker":"PRAX","headline":"Praxis Precision Medicines provides corporate update and reports fourth quarter financial results","body":"Two new drug applications (NDA) for ulixacaltamide in essential tremor (ET) and for relutrigine in SCN2A and SCN8A developmental and epileptic encephalopathies (DEEs) have been submitted to the U.S. Food and Drug Administration (FDA)Click here for full release."},{"time":"07:35","ticker":"ATI","headline":"ATI Inc. authorizes additional $500 mln share repurchase program","body":"• ATI announced its board authorized an additional $500 mln share repurchase program for its common stock.\n• The new authorization is expected to support a multi-year program alongside the remaining $120 mln under the prior authorization.\n• Repurchases may be executed in the open market or through privately negotiated transactions, depending on market conditions and corporate needs."},{"time":"07:34","ticker":"APPN","headline":"Appian Board also authorized a program to repurchase up to $50.0 million of Appian's common stock","body":""},{"time":"07:30","ticker":"SUMRX","headline":"European Markets Update: DAX -0.8%, FTSE -0.7%, CAC -0.8%","body":"• In economic data: Eurozone's December Current Account surplus EUR14.6 bln (expected surplus of EUR9.8 bln; last surplus of EUR8.9 bln). December Construction Output 0.88% m/m (last -1.54%) U.K.'s February CBI Industrial Trends Orders -28, as expected (last -30) Spain's December trade deficit EUR5.57 bln (last deficit of EUR5.68 bln) Swiss January trade surplus CHF3.818 bln (last surplus of CHF934 mln). Q4 Industrial Production -0.7% yr/yr (last 2.0%)\n• Eurozone's December Current Account surplus EUR14.6 bln (expected surplus of EUR9.8 bln; last surplus of EUR8.9 bln). December Construction Output 0.88% m/m (last -1.54%)\n• U.K.'s February CBI Industrial Trends Orders -28, as expected (last -30)\n• Spain's December trade deficit EUR5.57 bln (last deficit of EUR5.68 bln)\n• Swiss January trade surplus CHF3.818 bln (last surplus of CHF934 mln). Q4 Industrial Production -0.7% yr/yr (last 2.0%)\n• STOXX Europe 600: -0.6%\n• Germany's DAX: -0.8%\n• U.K.'s FTSE 100: -0.7%\n• France's CAC 40: -0.8%\n• Italy's FTSE MIB: -1.3%\n• Spain's IBEX 35: -0.8%\n• EUR/USD: -0.1% to 1.1775\n• GBP/USD: -0.2% to 1.3463\n• USD/CHF: +0.3% to 0.7757"},{"time":"07:27","ticker":"LAUR","headline":"Laureate Education beats by $0.37, beats on revs","body":"• Reports Q4 (Dec) earnings of $1.15 per share, excluding non-recurring items, $0.37 better than the FactSet Consensus of $0.78; revenues rose 27.9% year/year to $541.4 mln vs the $527.1 mln FactSet Consensus."},{"time":"07:27","ticker":"SCANX","headline":"Gapping up/Gapping down","body":"• RELY +21.2% (also names new CEO), ETSY +18.8%, NP +16.1%, HLF +13.7%, LMND +13.2%, FIG +10.7%, DASH +10%, APPN +9.9%, NABL +9.7%, EBAY +8.7% (also to acquire Depop; increases dividend; increases share repurchase program by $2 bln), NICE +7.9%, TROX +6.1%, PWR +5.6%, DE +5%, OXY +4.6%, FPI +4.6%, MTLS +4.6%, TS +4.1%, LILA +4%, XPRO +3.8%, AG +3.5%, FUN +3.3%, CWK +3.2%, OBDC +3.1% (also certain BDCs to sell $1.4 bln of assets), HST +2.9% (also announces sale of two Four Seasons resorts), PAAS +2.9%, ADAM +2.7%, ILPT +2.7%, JXN +2.5% (also increases dividend), ULS +2.5%, SPNT +2.2%, ECO +2.2% (also increases dividend), MD +2.1%, SII +1.7%, THRM +1.4%, OMC +1.3% (also authorizes new $5 bln share repurchase program, including $2.5 bln accelerated share repurchase), CWAN +1.2%, KAI +1.1%, ARR +1.1%, EIX +1.1%\n• CDNL +9.9% (acquires A.L. Grading Contractors; provides FY25 and FY26 guidance)\n• HIMS +7.3% (has entered into a definitive agreement to acquire Eucalyptus)\n• DEI +3.5% (Chairman & Chief Executive Officer discloses the purchase of 98,000 shares at $9.96 - $10.25 worth approximately $998K)\n• CMPS +2.8% (prices offering consisting of ADSs and warrants)\n• MGIC +2% (provides several merger updates)\n• ATEX +1.7% (FCC approves rules to expand 900 MHz band to 10 mhz)\n• CHWY +2.8% (upgraded to Outperform from Market Perform at Raymond James)\n• GRMN +0.9% (upgraded to Equal Weight from Underweight at Morgan Stanley)\n• EPAM -16.5%, CVNA -14.2%, CAR -14.1%, TBI -11.9%, BTG -11.7%, W -9.3%, GTX -7.7%, LKQ -7.4%, YETI -6.8%, POOL -6.6%, CAKE -6.3%, KALU -6.3%, TAP -6%, VC -5.6%, OGS -5.3%, AEG -5.1%, OII -4.6%, AMPL -3.8% (also authorizes new $100 mln share repurchase program), BHC -3.7%, COLD -3.7%, MDGL -3.6%, CVI -3.4%, INSM -3.4%, BNL -3.1%, RIO -3%, SB -2.8%, WMT -2.8%, BKD -2.5%, OR -2.5% (also acquires portfolio of royalty assets), JACK -2.3%, LOPE -2.3%, TECK -2.3%, CYH -2.1%, TNK -2%, UPBD -2%, CRH -1.9% (also increases dividend; enters buyback program arrangement with Wells Fargo), MAC -1.7%, CNP -1.7%, RS -1.3% (also increases dividend), WES -1%\n• BTDR -16.1% (intends to offer, subject to market conditions and other factors, US$300.0 mln principal amount of Convertible Senior Notes due 2032)\n• EPRX -10.8% (prices offering consisting of common stock and warrants)\n• ESOA -10.4% (stock offering)\n• BNC -4.2% (advances plan to revise asset management deal)\n• LYV -2.7% (Judge rejects Live Nation's effort to dismiss antitrust lawsuit, according to Reuters)\n• AMRZ -1.6% (completes acquisition of PB Materials Holdings)\n• UDR -1.3% (files mixed shelf offering)\n• HUN -1.9% (downgraded to Neutral from Overweight at JPMorgan)"},{"time":"07:23","ticker":"AU","headline":"AngloGold Ashanti: Thesis Gold announces strategic investment by AngloGold Ashanti whereby AngloGold Ashanti will acquire 5% of the issued and outstanding common shares of the Company","body":"• Pursuant to the Subscription, AngloGold Ashanti has agreed to purchase, by way of private placement, 13,858,883 Common Shares at a price of $2.79 per Common Share for gross proceeds of $38,666,284. The issue price represents the volume weighted average price of the Common Shares as traded on the TSX Venture Exchangeon February 18, 2026.\n• In connection with closing of the Subscription, Thesis and AngloGold Ashanti will enter into an investor rights agreement, whereby, subject to certain conditions, the Company will grant AngloGold Ashanti certain financing and other participation rights to enable AngloGold Ashanti to maintain its shareholding interest in the Company, as well as technical committee appointment rights and other customary investor rights."},{"time":"07:21","ticker":"WMT","headline":"Walmart increases quarterly cash dividend 5% to $0.2475/share from $0.235/share","body":""},{"time":"07:13","ticker":"ETSY","headline":"Etsy beats by $0.07, reports revs in-line, provides guidance","body":"• Reports Q4 (Dec) GAAP earnings of $0.92 per share, $0.07 better than the FactSet Consensus of $0.85; revenues rose 3.5% year/year to $881.64 mln vs the $884.79 mln FactSet Consensus.GMS was $3,592.6 million, up 2.4% yr/yr, excluding Reverb from the prior-year period. On an as reported basis, including Reverb's fourth quarter 2024 GMS of $228.3 million, consolidated GMS was down 3.8% year-over-year.\n• GMS was $3,592.6 million, up 2.4% yr/yr, excluding Reverb from the prior-year period. On an as reported basis, including Reverb's fourth quarter 2024 GMS of $228.3 million, consolidated GMS was down 3.8% year-over-year.\n• Co guides to Q1 GMS of $2.38-2.43 bln, take rate of ~25.5%, adjusted EBITDA margin of ~28-30%.\n• For FY26, co currently expects slight yr/yr growth in GMS, with positive year-over-year comparisons in each quarter of 2026. Co expects take rate and adjusted EBITDA margin to be roughly consistent with Q1 guidance.\n• \"We ended the year with solid results, in-line with or better than our expectations,\" said Lanny Baker, Chief Financial Officer. \"Fourth quarter consolidated GMS was $3.6 billion, up 2.4% year-over-year excluding Reverb from the prior-year period. Etsy marketplace GMS grew slightly year-over-year, driven by the impact of our near-term priorities as well as some benefit from foreign exchange rates and competitive spending patterns in certain marketing channels. We saw stabilization and some improvement in our key customer metrics, including moderation in active buyer declines, sequential stabilization in trailing twelve month GMS per active buyer, growth in total gross buyer additions, and sequential growth alongside higher retention of active sellers. Fourth quarter Adjusted EBITDA was $222 million, representing a consolidated Adjusted EBITDA margin of 25.2%, with the core Etsy marketplace hitting our highest Adjusted EBITDA margin level of 2025, at approximately 30%.\""},{"time":"07:11","ticker":"BRC","headline":"Brady reports EPS in-line, beats on revs; guides FY26 EPS in-line","body":"• Reports Q2 (Jan) earnings of $1.09 per share, excluding non-recurring items, in-line with the two analyst estimate of $1.09; revenues rose 7.7% year/year to $384.14 mln vs the $378.69 mln two analyst estimate.\n• Co narrows guidance for FY26, sees EPS of $4.95 to $5.15 from $4.90 to $5.15, excluding non-recurring items, vs. $5.04 two analyst estimate."},{"time":"07:10","ticker":"SII","headline":"Sprott announces year ended 2025 results","body":"TORONTO, Feb. 19, 2026 (GLOBE NEWSWIRE) -- Sprott Inc. (NYSE/TSX: SII) (\"Sprott\" or the \"Company\") today announced its financial results for the year ended December 31, 2025.Click here for full release."},{"time":"07:10","ticker":"WMT","headline":"Walmart beats by $0.01, reports revs in-line; guides Q1 EPS below consensus; guides FY27 EPS below consensus; $30 bln share repurchase authorization","body":"• Reports Q4 (Jan) earnings of $0.74 per share, excluding non-recurring items, $0.01 better than the FactSet Consensus of $0.73; revenues rose 5.6% year/year to $190.66 bln vs the $190.49 bln FactSet Consensus.Walmart U.S. comp sales grew 4.6%.\n• Walmart U.S. comp sales grew 4.6%.\n• Co issues downside guidance for Q1, sees EPS of $0.63-0.65, excluding non-recurring items, vs. $0.68 FactSet Consensus.Net sales increase 3.5% to 4.5% on constant currency basis.\n• Net sales increase 3.5% to 4.5% on constant currency basis.\n• Co issues downside guidance for FY27, sees EPS of $2.75-2.85, excluding non-recurring items, vs. $2.97 FactSet Consensus.Net sales increase 3.5% to 4.5% on constant currency basis.\n• Net sales increase 3.5% to 4.5% on constant currency basis.\n• Company announces new $30 billion share repurchase authorization"},{"time":"07:10","ticker":"NABL","headline":"N-able misses by $0.04, beats on revs; guides Q1 revs above consensus; guides FY26 revs above consensus","body":"• Reports Q4 (Dec) earnings of $0.06 per share, excluding non-recurring items, $0.04 worse than the FactSet Consensus of $0.10; revenues rose 11.8% year/year to $130.27 mln vs the $127.06 mln FactSet Consensus.\n• Total ARR of $539.7 million, representing 11.9% year-over-year growth, or 7.7% year-over-year growth on a constant currency basis.\n• Co issues upside guidance for Q1, sees Q1 revs of $131-$132 mln vs. $128.78 mln FactSet Consensus. Adjusted EBITDA in the range of $35.5 to $36.5 million, representing approximately 27% to 28% of total revenue.\n• Co issues upside guidance for FY26, sees FY26 revs of $554-$559 mln vs. $553.11 mln FactSet Consensus. Sees Total ARR in the range of $581 to $586 million, representing approximately 8% to 9% year-over-year growth on a reported and constant currency basis."},{"time":"07:10","ticker":"INSM","headline":"Insmed misses by $0.47, beats on revs","body":"• Reports Q4 (Dec) loss of $1.54 per share, $0.47 worse than the FactSet Consensus of ($1.07); revenues rose 152.6% year/year to $263.84 mln vs the $231.25 mln FactSet Consensus.\n• Co anticipates full-year 2026 BRINSUPRI revenues of at least $1 billion and continues to anticipate full-year 2026 ARIKAYCE revenues in the range of $450 million to $470 million.\n• \"Throughout 2026, we will continue to bring BRINSUPRI to patients with bronchiectasis, expand our Phase 3 clinical programs for TPIP, and advance our early-stage pipeline, fueling the research engine that we hope will power the next wave of potentially life-transforming therapies for patients.\""},{"time":"07:09","ticker":"APPN","headline":"Appian beats by $0.08, beats on revs; guides Q1 EPS above consensus, revs above consensus; guides FY26 EPS above consensus, revs above consensus","body":"• Reports Q4 (Dec) earnings of $0.15 per share, excluding non-recurring items, $0.08 better than the FactSet Consensus of $0.07; revenues rose 21.7% year/year to $202.9 mln vs the $189.26 mln FactSet Consensus.\n• Adjusted EBITDA: Adjusted EBITDA was $19.7 million, compared to adjusted EBITDA of $21.2 million for the fourth quarter of 2024.\n• Co issues upside guidance for Q1, sees EPS of $0.16-0.20, excluding non-recurring items, vs. $0.15 FactSet Consensus; sees Q1 revs of $189-193 mln vs. $188.09 mln FactSet Consensus.\n• Co issues upside guidance for FY26, sees EPS of $0.82-0.96, excluding non-recurring items, vs. $0.77 FactSet Consensus; sees FY26 revs of $502-510 mln vs. $796.31 mln FactSet Consensus."},{"time":"07:09","ticker":"CWK","headline":"Cushman &amp; Wakefield reports EPS in-line, beats on revs","body":"• Reports Q4 (Dec) earnings of $0.54 per share, excluding non-recurring items, in-line with the FactSet Consensus of $0.54; revenues rose 10.8% year/year to $2.91 bln vs the $2.01 bln FactSet Consensus."},{"time":"07:09","ticker":"MDGL","headline":"Madrigal Pharmaceuticals misses by $1.57, beats on revs","body":"• Reports Q4 (Dec) loss of $2.57 per share, $1.57 worse than the FactSet Consensus of ($1.00); revenues rose 210.8% year/year to $321.1 mln vs the $312.67 mln FactSet Consensus."},{"time":"07:08","ticker":"ATAI","headline":"AtaiBeckley announces the appointment of Michael Faerm as Chief Financial Officer, effective March 9, 2026","body":"• Mr. Faerm is a seasoned financial executive with more than 25 years of experience across life sciences companies, equity research, and investment banking. As Chief Financial Officer at AtaiBeckley, he will lead the Company's financial strategy, capital markets activities, and overall financial operations.\n• Anne Johnson, who has served as Chief Financial Officer since 2024, will transition to the role of Chief Accounting Officer upon the effective date of Mr. Faerm's appointment. In this position, she will continue to lead accounting and financial operations, working closely with Mr. Faerm to ensure continuity and operational consistency.\n• Mr. Faerm most recently served as Chief Financial Officer at Viracta Therapeutics, Inc."},{"time":"07:06","ticker":"POOL","headline":"Pool misses by $0.15, misses on revs; guides FY26 EPS below consensus","body":"• Reports Q4 (Dec) earnings of $0.84 per share, excluding non-recurring items, $0.15 worse than the FactSet Consensus of $0.99; revenues fell 0.5% year/year to $982.2 mln vs the $1 bln FactSet Consensus.\n• Co issues downside guidance for FY26, sees EPS of $10.85-$11.15, excluding non-recurring items, vs. $11.56 FactSet Consensus."},{"time":"07:06","ticker":"LKQ","headline":"LKQ misses by $0.06, beats on revs; guides FY26 EPS below consensus","body":"• Reports Q4 (Dec) earnings of $0.59 per share, excluding non-recurring items, $0.06 worse than the FactSet Consensus of $0.65; revenues rose 2.7% year/year to $3.31 bln vs the $3.25 bln FactSet Consensus.\n• Co issues downside guidance for FY26, sees EPS of $2.90-3.20, excluding non-recurring items, vs. $3.29 FactSet Consensus.Sees organic revenue growth for parts and services of (0.5%) to 1.5%.\n• Sees organic revenue growth for parts and services of (0.5%) to 1.5%.\n• Further supporting its strategic initiatives, co recently approved a restructuring plan intended to better position our cost structure to more efficiently serve our strategic markets and enhance the company's long-term performance. The plan is expected to result in restructuring charges of approximately $60 to $70 million and generate more than $50 million in annualized cost savings, with more than half of these savings anticipated to be realized in 2026."},{"time":"07:06","ticker":"REGN","headline":"Regeneron Pharma announces that the U.S. Food and Drug Administration has accepted for Priority Review the Biologics License Application for garetosmab for the treatment of adults with fibrodysplasia ossificans progressiva","body":"• Garetosmab is a monoclonal antibody that blocks Activin A, a protein that Regeneron scientists discovered to be critical in the development of heterotopic ossification lesions in people with FOP. The target action date for the FDA decision is August 2026.\n• FOP is an ultra-rare genetic disorder characterized by abnormal bone formation that infiltrates muscles, tendons, ligaments and other connective tissues, resulting in significant disability.\n• If approved, garetosmab would be the first and only available treatment shown to reduce the number and volume of new heterotopic bone lesions in adults with FOP."},{"time":"07:05","ticker":"BTDR","headline":"Bitdeer Technologies announces proposed registered direct offering of Class A Ordinary Shares","body":"• Bitdeer intends to use the net proceeds from the registered direct offering, together with a portion of the net proceeds from Bitdeer's separately announced private offering of Convertible Senior Notes due 2032, if consummated, to pay the cost of the capped call transactions that Bitdeer will enter into with one or more of the initial purchasers or affiliates thereof and/or other financial institutions and to pay the cash consideration for its repurchase of a portion of the November 2029 notes for cash in privately negotiated transactions effected through its agent.\n• Bitdeer intends to use the remaining net proceeds from the registered direct offering and the notes offering for datacenter expansion, HPC and AI cloud business expansion, ASIC based mining rig development and manufacture, as well as working capital and other general corporate purposes. If the initial purchasers in the notes offering exercise their option to purchase additional notes, Bitdeer intends to use net proceeds from the sale of the additional notes to enter into additional capped call transactions with the option counterparties and the remaining net proceeds for datacenter expansion, HPC and AI cloud business expansion, ASIC based mining rig development and manufacture, as well as working capital and other general corporate purposes as described above."},{"time":"07:05","ticker":"ULS","headline":"UL Solutions Inc. beats by $0.08, reports revs in-line","body":"• Reports Q4 (Dec) earnings of $0.53 per share, excluding non-recurring items, $0.08 better than the FactSet Consensus of $0.45; revenues rose 6.8% year/year to $789 mln vs the $782.36 mln FactSet Consensus.\n• Outlook: The Company's 2026 outlook includes: Mid-single digit constant currency organic revenue growth. Inclusive of approximately 1% revenue reduction from business exits announced in the Restructuring Plan. Adjusted EBITDA margin improvement to between 26.5% and 27.0%. Effective tax rate of approximately 26%. Capital expenditures between 7% and 8% of revenue. Continuing to pursue acquisitions and portfolio refinements.\n• The Company's board of directors has increased the quarterly dividend by 11.5% to $0.145 per share for the first quarter of 2026. The dividend will be paid on March 12, 2026 to stockholders of record as of the close of business on March 2, 2026.\n• On February 12, 2026, the Company signed a definitive agreement to sell its Employee Health and Safety software business that was previously accounted for in the Company's Software and Advisory segment. The transaction is expected to close in the second quarter of 2026 and will allow the Company to focus on its core ULTRUSTM software portfolio, which provides customers with risk and compliance software solutions that drive product safety and innovation, supply chain transparency and enterprise sustainability."},{"time":"07:04","ticker":"W","headline":"Wayfair beats by $0.16, beats on revs","body":"• Reports Q4 (Dec) earnings of $0.85 per share, excluding non-recurring items, $0.16 better than the FactSet Consensus of $0.69; revenues rose 6.9% year/year to $3.34 bln vs the $3.30 bln FactSet Consensus.U.S. revenue of $2.9 bln, increased 7.4% yr/yr.International revenue of $395 mln, increased 3.7% (+1.3% CC) yr/yr.\n• U.S. revenue of $2.9 bln, increased 7.4% yr/yr.\n• International revenue of $395 mln, increased 3.7% (+1.3% CC) yr/yr.\n• Note: Wayfair typically provides guidance on the call, which starts at 8am ET."},{"time":"07:04","ticker":"UPBD","headline":"Upbound Group beats by $0.04, beats on revs; guides Q1 EPS in-line, revs in-line; guides FY26 EPS below consensus, revs below consensus","body":"• Reports Q4 (Dec) earnings of $1.01 per share, excluding non-recurring items, $0.04 better than the FactSet Consensus of $0.97; revenues rose 10.8% year/year to $1.2 bln vs the $1.17 bln FactSet Consensus.\n• Adjusted EBITDA increased 2.6% year-over-year to $125.9 million, due primarily to the addition of the Brigit segment and an increase in Adjusted EBITDA in the Acima segment, partially offset by a decrease in Adjusted EBITDA in the Rent-A-Center segment.\n• Co issues in-line guidance for Q1, sees EPS of $1.05-$1.15, excluding non-recurring items, vs. $1.05 FactSet Consensus; sees Q1 revs of $1.16-$1.26 bln vs. $1.25 bln FactSet Consensus.\n• Co issues downside guidance for FY26, sees EPS of $4.00-$4.35 vs. $4.62 FactSet Consensus; sees FY26 revs of $4.70-$4.95 bln vs. $5.02 bln FactSet Consensus."},{"time":"07:03","ticker":"OWL","headline":"Blue Owl Capital: Certain Blue Owl BDCs to sell $1.4 bln of assets to institutional investors","body":"• Certain Blue Owl BDCs today announced that they have entered into separate definitive agreements with four leading North American public pension and insurance investors to opportunistically sell $1.4 bln of direct lending investments at 99.7% of par value as of February 12, 2026.\n• Transaction Details: These sales include debt investment commitments of $600 mln from Blue Owl Capital Corporation II (\"OBDC II\"), $400 mln from Blue Owl Technology Income Corp. (\"OTIC\") and $400 mln from Blue Owl Capital Corporation (\"OBDC\" and together with OBDC II and OTIC, the \"Blue Owl BDCs\"), representing approximately 34%, 6% and 2% of total investment commitments, including unfunded commitments, at each BDC respectively. Each investment to be sold represents a partial amount of each Blue Owl BDC's exposure to the respective portfolio company. These sales consist of 97% senior secured debt investments with an average size of $5 mln and include investments in 128 distinct portfolio companies across 27 industries. The largest industry represented is internet software and services at 13%, generally consistent with the industry composition of Blue Owl's overall direct lending strategy and reflecting continued confidence in the quality and valuations of these software investments.\n• The investments will be sold at fair value, which is equivalent to 99.7% of par value as of February 12, 2026. OBDC II intends to use the proceeds to pay a return of capital distribution ratably to all shareholders, subject to Board approval, and to pay down debt. OTIC and OBDC also intend to use the proceeds from the sales to pay down debt. This transaction positions OBDC II to provide substantial liquidity to its shareholders. It also provides OTIC and OBDC with greater flexibility to deploy capital into what we believe will be an attractive direct lending environment and modestly increases portfolio diversification. Pro forma for the transaction, OTIC is expected to have cash, undrawn debt capacity and liquid loans in excess of $1.6 bln as of January 31, 2026."},{"time":"07:03","ticker":"BTDR","headline":"Bitdeer Technologies intends to offer, subject to market conditions and other factors, US$300.0 mln principal amount of Convertible Senior Notes due 2032","body":"• The notes will be general, senior unsecured obligations of Bitdeer and will accrue interest payable semiannually in arrears. Upon conversion, Bitdeer will pay or deliver, as the case may be, cash, Class A ordinary shares, par value US$0.0000001 per share, of Bitdeer or a combination of cash and Class A ordinary shares, at its election. The interest rate, initial conversion rate, repurchase or redemption rights and certain other terms of the notes will be determined at the time of pricing of the notes offering.\n• Bitdeer intends to use a portion of the net proceeds from the notes offering, together with the net proceeds from the registered direct offering described below, if consummated, to pay the cost of the capped call transactions that Bitdeer will enter into with one or more of the initial purchasers or affiliates thereof and/or other financial institutions (the \"option counterparties\") and to pay the cash consideration for the concurrent note repurchase transactions, each as described below. Bitdeer intends to use the remaining net proceeds from the notes offering for datacenter expansion, HPC and AI cloud business expansion, ASIC based mining rig development and manufacture, as well as working capital and other general corporate purposes. If the initial purchasers exercise their option to purchase additional notes, Bitdeer expects to use the net proceeds from the sale of the additional notes to enter into additional capped call transactions with the option counterparties and the remaining net proceeds for datacenter expansion, HPC and AI cloud business expansion, ASIC based mining rig development and manufacture, as well as working capital and other general corporate purposes as described above."},{"time":"07:02","ticker":"PWR","headline":"Quanta Services beats by $0.11, beats on revs; guides FY26 EPS in-line, revs above consensus","body":"• Reports Q4 (Dec) earnings of $3.16 per share, excluding non-recurring items, $0.11 better than the FactSet Consensus of $3.05; revenues rose 19.7% year/year to $7.84 bln vs the $7.39 bln FactSet Consensus.\n• Co issues guidance for FY26, sees EPS of $12.65 to $13.35, excluding non-recurring items, vs. $12.51 FactSet Consensus; sees FY26 revs of $33.25 bln to $33.75 bln vs. $31.57 bln FactSet Consensus.Co expects that recent acquisitions will contribute $0.40 to $0.50 to adjusted EPS in 2026.\n• Co expects that recent acquisitions will contribute $0.40 to $0.50 to adjusted EPS in 2026."},{"time":"07:00","ticker":"MORN","headline":"Morningstar announces a strategic collaboration with Alta Trust Company and a group of leading asset managers to launch the Foundation Series Collective Investment Trusts","body":"• Foundation Series Collective Investment Trusts (CITs), a set of six multi-manager portfolios designed to broaden access to institutional-quality investment services for retirement plans of all sizes.\n• Built on Morningstar's managed accounts portfolio framework, the Foundation Series CITs are designed to simplify implementation for recordkeepers by eliminating the need for additional build work. The standardized approach also supports a recordkeeper's existing stable value fund, enabling plan sponsors to offer more complete and customizable investment lineups without added operational demands."},{"time":"07:00","ticker":"SUMRX","headline":"Asian Markets Close: Nikkei +0.6%, Hang Seng CLOSED, Shanghai CLOSED","body":"• In economic data: Japan's December Core Machinery Orders 19.1% m/m (expected 5.1%; last -11.0%); 16.8% yr/yr (expected 3.9%; last -6.4%) South Korea's January trade surplus $8.72 bln (expected surplus of $8.74 bln; last surplus of $12.17 bln). January Imports 11.6% yr/yr (expected 11.7%; last 4.6%) and Exports 33.8% yr/yr (expected 33.9%; last 13.3%) Australia's January Employment Change 17,800 (expected 20,000; last 68,500) and full employment change 50,500 (last 56,900). January Unemployment Rate 4.1% (expected 4.2%; last 4.1%) and Participation Rate 66.7% (expected 66.8%; last 68.5%)\n• Japan's December Core Machinery Orders 19.1% m/m (expected 5.1%; last -11.0%); 16.8% yr/yr (expected 3.9%; last -6.4%)\n• South Korea's January trade surplus $8.72 bln (expected surplus of $8.74 bln; last surplus of $12.17 bln). January Imports 11.6% yr/yr (expected 11.7%; last 4.6%) and Exports 33.8% yr/yr (expected 33.9%; last 13.3%)\n• Australia's January Employment Change 17,800 (expected 20,000; last 68,500) and full employment change 50,500 (last 56,900). January Unemployment Rate 4.1% (expected 4.2%; last 4.1%) and Participation Rate 66.7% (expected 66.8%; last 68.5%)\n• Japan's Nikkei: +0.6%\n• Hong Kong's Hang Seng: CLOSED\n• China's Shanghai Composite: CLOSED\n• India's Sensex: -1.5%\n• South Korea's Kospi: +3.1%\n• Australia's ASX All Ordinaries: +0.8%\n• USD/JPY: -0.1% to 154.63\n• USD/CNH: +0.2% to 6.9005\n• USD/INR: +0.4% to 91.11"},{"time":"06:59","ticker":"LAC","headline":"Lithium Americas provides a project update and 2026 Capex guidance for Thacker Pass","body":"Lithium Americas Corp. (TSX: LAC) (NYSE: LAC) (\"Lithium Americas\" or the \"Company\") provides a project update for the year ended December 31, 2025, 2026 capital expenditure (\"Capex\") guidance and 2026 project development milestones for its Thacker Pass project in Humboldt County, Nevada (\"Thacker Pass\" or the \"Project\").Click here for full release."},{"time":"06:58","ticker":"AGI","headline":"Alamos Gold announces refiling of 2025 financial statements due to administrative error","body":"TORONTO, Feb. 19, 2026 (GLOBE NEWSWIRE) -- Alamos Gold Inc. (TSX:AGI; NYSE:AGI) (\"Alamos\" or the \"Company\") announces that it has refiled its consolidated financial statements for the year-ended December 31, 2025 and 2024 on SEDAR+ and EDGAR, to correct administrative errors contained within the audit opinion attached to the consolidated financial statements. There are no changes to the Company's reported results for the year-ended December 31, 2025.Click here for full release."},{"time":"06:58","ticker":"VC","headline":"Visteon beats by $0.87, beats on revs; guides FY26 revs below consensus; raises dividend","body":"• Reports Q4 (Dec) earnings of $2.96 per share, excluding non-recurring items, $0.87 better than the FactSet Consensus of $2.09; revenues rose 1.0% year/year to $948 mln vs the $920.14 mln FactSet Consensus.\n• Co issues downside guidance for FY26, sees FY26 revs of $3.63-3.83 bln vs. $3.86 bln FactSet Consensus.Co sees FY26 adjusted EBITDA in the range of $455 million to $495 million, and adjusted free cash flow in the range of $170 million to $210 million.\n• Co sees FY26 adjusted EBITDA in the range of $455 million to $495 million, and adjusted free cash flow in the range of $170 million to $210 million.\n• Increasing quarterly dividend in Q1 2026 by 36% to $0.375 per shareCompany's Board of Directors increased the quarterly dividend to $0.375 per share on its common stock. The dividend is payable on March 16, 2026, to shareholders of record as of the close of business on March 2, 2026.\n• Company's Board of Directors increased the quarterly dividend to $0.375 per share on its common stock. The dividend is payable on March 16, 2026, to shareholders of record as of the close of business on March 2, 2026."},{"time":"06:58","ticker":"GTX","headline":"Garrett Motion beats by $0.06, beats on revs; guides FY26 revs in-line","body":"• Reports Q4 (Dec) earnings of $0.42 per share, $0.06 better than the FactSet Consensus of $0.36; revenues rose 5.6% year/year to $891 mln vs the $875.16 mln FactSet Consensus.\n• Adjusted EBIT totaled $122 million; Adjusted EBIT margin 13.7%.\n• Co issues in-line guidance for FY26, sees FY26 revs of $3.6-$3.8 bln vs. $3.69 bln FactSet Consensus. Sees adjusted EBIT of $520-$570 mln."},{"time":"06:52","ticker":"FTI","headline":"TechnipFMC beats by $0.19, reports revs in-line; raises Subsea revenue outlook","body":"• Reports Q4 (Dec) earnings of $0.70 per share, excluding non-recurring items, $0.19 better than the FactSet Consensus of $0.51; revenues rose 6.3% year/year to $2.52 bln vs the $2.53 bln FactSet Consensus.\n• Guidance: Subsea revenue in a range of $9.2 - 9.6 billion, which increased from the previous guidance range of $9.1 - 9.5 billion.Subsea adjusted EBITDA margin in a range of 21 - 22%, which increased from the previous guidance range of 20.5 - 22%.\n• Subsea revenue in a range of $9.2 - 9.6 billion, which increased from the previous guidance range of $9.1 - 9.5 billion.\n• Subsea adjusted EBITDA margin in a range of 21 - 22%, which increased from the previous guidance range of 20.5 - 22%."},{"time":"06:48","ticker":"COLD","headline":"Americold Realty Trust beats by $0.02, reports revs in-line; guides FY26 FFO in-line","body":"• Reports Q4 (Dec) funds from operations of $0.38 per share, excluding non-recurring items, $0.02 better than the FactSet Consensus of $0.36; revenues fell 1.2% year/year to $658.5 mln vs the $654.55 mln FactSet Consensus.\n• Global Warehouse segment same store revenues decreased 1.1% on an actual basis and decreased 1.5% on a constant currency basis as compared to Q4 2024.\n• Global Warehouse same store services margin increased to 13.9% from 12.7% in Q4 2024.\n• Co issues in-line guidance for FY26, sees FFO of $1.20-$1.30, excluding non-recurring items, vs. $1.23 FactSet Consensus. Sees Warehouse segment same store revenues (constant currency) of $2.20-$2.27 bln."},{"time":"06:36","ticker":"IDA","headline":"IdaCorp beats by $0.05; guides FY26 EPS in-line","body":"• Reports Q4 (Dec) earnings of $0.78 per share, excluding non-recurring items, $0.05 better than the FactSet Consensus of $0.73.\n• Co issues in-line guidance for FY26, sees EPS of $6.25 to $6.45, excluding non-recurring items, vs. $6.37 FactSet Consensus."},{"time":"06:34","ticker":"CHH","headline":"Choice Hotels beats by $0.06, beats on revs; guides FY26 EPS below consensus","body":"• Reports Q4 (Dec) earnings of $1.60 per share, excluding non-recurring items, $0.06 better than the FactSet Consensus of $1.54; revenues were unchanged year/year at $390 mln vs the $369.6 mln FactSet Consensus.U.S. RevPAR declined 2.2% in fourth quarter 2025 compared to the prior year period, adjusted to exclude a 540-basis-point hurricane-related benefit in the fourth quarter of 2024, primarily reflecting softer government and international inbound demand. International RevPAR increased 3.2% on a currency-neutral basis in fourth quarter 2025, compared to the same period of 2024.\n• U.S. RevPAR declined 2.2% in fourth quarter 2025 compared to the prior year period, adjusted to exclude a 540-basis-point hurricane-related benefit in the fourth quarter of 2024, primarily reflecting softer government and international inbound demand.\n• International RevPAR increased 3.2% on a currency-neutral basis in fourth quarter 2025, compared to the same period of 2024.\n• Co issues downside guidance for FY26, sees EPS of $6.92-7.14, excluding non-recurring items, vs. $7.15 FactSet Consensus.Full-year 2026, net income is expected to range between $265 to $275 million, and adjusted EBITDA is expected to range between $632 and $647 million.Global RevPAR growth -2% to 1%; U.S. RevPAR growth -2% to 1%\n• Full-year 2026, net income is expected to range between $265 to $275 million, and adjusted EBITDA is expected to range between $632 and $647 million.\n• Global RevPAR growth -2% to 1%; U.S. RevPAR growth -2% to 1%"},{"time":"06:32","ticker":"PRMB","headline":"Primo Brands Corporation Board of Directors declares increased dividend of $0.12 per share, prior $0.10 per share","body":""},{"time":"06:31","ticker":"GIB","headline":"CGI Group and Schneider Electric are further expanding their strategic partnership to support energy suppliers in the DACH region with sustainable end-to-end solutions","body":"• The transition to renewable energy, the digitization of networks and growing regulatory complexity are creating both challenges and new opportunities for the energy market. CGI's deep industry expertise, combined with Schneider Electric's solutions, supports energy suppliers in responding to these evolving demands.\n• Building on decades of successful collaboration, CGI and Schneider Electric are extending their trusted partnership to German-speaking countries. Under the agreement, Schneider Electric provides solutions for grid operations and planning, including Advanced Distribution Management systems (ADMS) and Geographic Information Systems (GIS). CGI brings established energy sector expertise, leading software implementation and system integration, and supports energy suppliers as a managed services partner.\n• AI will play a critical role in future transformation projects at energy suppliers. In the energy sector, the growing adoption of AI-based solutions is creating additional value through process optimization, cost efficiencies and improved sustainability."},{"time":"06:26","ticker":"SCANX","headline":"Early premarket gappers","body":"• Gapping up: RELY +21%, LMND +16.6%, HLF +13.7%, FIG +13.4%, DASH +12%, NP +10.6%, CDNL +9.9%, NICE +9.9%, EBAY +9.3%, CMPS +4.9%, OXY +4.6%, TROX +4.4%, FPI +4.3%, MTLS +4.3%, LILA +4%, DE +4%, PAAS +3.7%, TS +3.5%, OBDC +3.5%, DEI +2.8%, ADAM +2.7%, HIMS +2.5%, JXN +2.5%, ECO +2.4%, SPNT +2.2%, AGI +2.1%, MD +2.1%, HST +2%, OMC +1.8%, ATEX +1.7%, TGB +1.6%, THRM +1.4%, ARR +1.2%, KAI +1.1%, CWAN +1%\n• RELY +21%, LMND +16.6%, HLF +13.7%, FIG +13.4%, DASH +12%, NP +10.6%, CDNL +9.9%, NICE +9.9%, EBAY +9.3%, CMPS +4.9%, OXY +4.6%, TROX +4.4%, FPI +4.3%, MTLS +4.3%, LILA +4%, DE +4%, PAAS +3.7%, TS +3.5%, OBDC +3.5%, DEI +2.8%, ADAM +2.7%, HIMS +2.5%, JXN +2.5%, ECO +2.4%, SPNT +2.2%, AGI +2.1%, MD +2.1%, HST +2%, OMC +1.8%, ATEX +1.7%, TGB +1.6%, THRM +1.4%, ARR +1.2%, KAI +1.1%, CWAN +1%\n• Gapping down: TBI -30.3%, CVNA -16.2%, CAR -12.6%, BTG -11.3%, EPRX -9.3%, CAKE -8.1%, EPAM -7.7%, ESOA -7.5%, KALU -5.7%, TAP -5.5%, AEG -5.5%, OGS -5.3%, BNC -4.2%, CYH -4.2%, AMPL -3.8%, BHC -3.7%, BKD -3.4%, YETI -3.3%, BNL -3.1%, RIO -3%, SB -2.8%, LYV -2.7%, TECK -2.6%, JACK -2.5%, CNP -2.2%, WES -2.1%, CRH -2.1%, OII -1.9%, MAC -1.7%, AMRZ -1.5%, UDR -1.3%, OR -1.2%\n• TBI -30.3%, CVNA -16.2%, CAR -12.6%, BTG -11.3%, EPRX -9.3%, CAKE -8.1%, EPAM -7.7%, ESOA -7.5%, KALU -5.7%, TAP -5.5%, AEG -5.5%, OGS -5.3%, BNC -4.2%, CYH -4.2%, AMPL -3.8%, BHC -3.7%, BKD -3.4%, YETI -3.3%, BNL -3.1%, RIO -3%, SB -2.8%, LYV -2.7%, TECK -2.6%, JACK -2.5%, CNP -2.2%, WES -2.1%, CRH -2.1%, OII -1.9%, MAC -1.7%, AMRZ -1.5%, UDR -1.3%, OR -1.2%"},{"time":"06:19","ticker":"HIMS","headline":"Hims &amp; Hers Health has entered into a definitive agreement to acquire Eucalyptus","body":"• As its US business continues to grow, Hims & Hers will be well-positioned, upon closing of the acquisition, to expand into Australia and Japan and deepen its presence in the UK, Germany, and Canada. The terms of the transaction have been structured to preserve the financial flexibility of the company, ensuring continued control over balance sheet management and capital allocation.\n• With this acquisition, Hims & Hers plans to expand its bench of local expertise and scale its infrastructure, making it possible for the company to reach millions more people globally with the model it has successfully built -- and continues to maintain -- in the US. Hims & Hers is committed to partnering with regional experts to enter new markets in a way that meets each region's needs and supports customer access and choice. Together with Hims & Hers' other recent acquisitions, the addition of Eucalyptus will create a diversified international platform that expands the range of offerings available to customers around the world, from simple online pharmacy fulfillment to advanced, concierge-style service.\n• Following the completion of the acquisition, Tim Doyle, current CEO of Eucalyptus, will become the SVP of International at Hims & Hers, overseeing the company's international business. As more biotech innovators, diagnostic companies, and leading drugmakers look for partners to support scaled distribution of innovative new treatments, this deal is expected to strengthen the company's commercial relationships and create new opportunities for future collaborations.\n• The transaction is valued at up to $1.15 billion USD, subject to customary purchase price adjustments. Approximately $240 million5 USD will be payable in cash upon closing of the acquisition. The remaining consideration consists of guaranteed deferred payments over the 18 months following closing, and additional earnout payments tied to the attainment of specified financial targets through early 2029.\n• The acquisition is subject to customary closing conditions, including regulatory approvals, and is expected to close during the middle of calendar year 2026."},{"time":"06:17","ticker":"CNP","headline":"CenterPoint beats by $0.01; reaffirms FY26 EPS guidance","body":"• Reports Q4 (Dec) earnings of $0.45 per share, excluding non-recurring items, $0.01 better than the FactSet Consensus of $0.44.\n• Co reaffirms guidance for FY26, sees EPS of \"at least the midpoint\" of $1.89-$1.91, excluding non-recurring items, vs. $1.91 FactSet Consensus.\n• Increases 10-year capital investment plan by $500 mln to total over $65 bln of planned investment from 2026-2035."},{"time":"06:17","ticker":"YETI","headline":"YETI Holdings announces that Scott Bomar has been appointed Senior Vice President, Chief Financial Officer and Treasurer, effective February 23, 2026","body":"• Mr. Bomar succeeds Mike McMullen, who will cease to serve as YETI's Chief Financial Officer as of the Effective Date. Mr. McMullen will serve in an advisory capacity from the Effective Date until May 31, 2026 to facilitate a smooth transition.\n• Mr. Bomar joins YETI from The Home Depot, Inc. (HD), where he served in positions of increasing responsibility over nearly two decades, most recently serving as Senior Vice President of Finance."},{"time":"06:16","ticker":"OGI","headline":"Organigram Global has entered into a subscription agreement with BT DE Investments Inc., a wholly-owned subsidiary of British American Tobacco p.l.c (BTI), in connection with its previously announced proposed acquisition of Sanity Group GmbH","body":"• The terms of the Subscription Agreement provide for the subscription by BAT for 14,027,074 Shares (as defined below) of Organigram at a price of C$3.00 per Share, for gross proceeds of C$42.08 million, and also the exercise of certain existing top-up rights to subscribe for 9,897,356 Shares at a price of C$2.335854 per Share, for gross proceeds of C$23.12 million and for total gross proceeds of C$65.2 million.\n• The proceeds from the Private Placement Investment, along with cash on hand and the proceeds from the previously announced up to $60 million senior secured credit facilities for which the Company entered into a fully underwritten commitment letter with ATB Financial (the \"Credit Facility\"), who is acting as sole lead arranger and bookrunner, shall be used to fund the cash portion of the Acquisition, related transaction expenses and general working capital purposes."},{"time":"06:13","ticker":"DE","headline":"Deere beats by $0.40, beats on revs","body":"• Reports Q1 (Jan) earnings of $2.42 per share, excluding non-recurring items, $0.40 better than the FactSet Consensus of $2.02; revenues rose 17.5% year/year to $8 bln vs the $7.59 bln FactSet Consensus.\n• FY26 net income expected between $4.5 bln and $5.0 bln."},{"time":"06:09","ticker":"LMND","headline":"Lemonade beats by $0.10, beats on revs; guides Q1 revs above consensus; guides FY26 revs above consensus","body":"• Reports Q4 (Dec) loss of $0.29 per share, $0.10 better than the FactSet Consensus of ($0.39); revenues rose 53.3% year/year to $228.1 mln vs the $217.89 mln FactSet Consensus.\n• IFP, defined as the aggregate annualized premium for customers as of the period end date, increased by 31% to $1.24 billion as compared to the fourth quarter of 2024.\n• Co issues upside guidance for Q1, sees Q1 revs of $246-$251 mln vs. $243.02 mln FactSet Consensus. Sees In force premium (IFP) of $1.321-$1.326 bln.\n• Co issues upside guidance for FY26, sees FY26 revs of $1.187-$1.192 bln vs. $1.16 bln FactSet Consensus. Sees In force premium (IFP) of $1.625-$1630 bln."},{"time":"06:07","ticker":"YETI","headline":"YETI Holdings beats by $0.04, reports revs in-line; guides FY26 EPS below consensus, revs in-line","body":"• Reports Q4 (Dec) earnings of $0.92 per share, excluding non-recurring items, $0.04 better than the FactSet Consensus of $0.88; revenues rose 6.8% year/year to $583.7 mln vs the $581.95 mln FactSet Consensus.\n• Co issues guidance for FY26, sees EPS of $2.77-2.83, excluding non-recurring items, vs. $2.92 FactSet Consensus; sees FY26 revs of +6-8% yr/yr to $1.98-2.01 bln vs. $1.99 bln FactSet Consensus.\n• Mr. Reintjes concluded, \"Building on our fourth quarter momentum, as we look ahead to 2026, we expect full-year sales growth between 6% and 8%, supported by balanced contributions from both Drinkware and Coolers & Equipment, continued international strength, and a robust innovation cycle. When we look at our long-range plan and the progress we're making across geographies and product categories we see an even broader runway and a clear path to high-single to low-double digit growth. We enter 2026 with a strong, diverse multi-year innovation pipeline, backed by a global product engine. Our innovation capabilities allow us to accelerate category expansion and bring new products to market faster than ever before. While tariff pressures will remain a headwind in 2026, the structural actions we have taken, across both supply chain diversification and ongoing cost optimization, give us confidence in our ability to enhance profitability while continuing to invest in growth. Our financial strength is a strategic advantage, enabling us to invest behind innovation, brand demand creation, international expansion, and technology, while maintaining strong free cash flow and delivering value to shareholders. With disciplined execution and a clear focus on our strategic priorities, we remain confident in our ability to deliver long-term growth, enhance profitability, and unlock the full global potential of YETI.\""},{"time":"06:05","ticker":"MD","headline":"Pediatrix Medical Group misses by $0.04, beats on revs","body":"• Reports Q4 (Dec) earnings of $0.50 per share, excluding non-recurring items, $0.04 worse than the FactSet Consensus of $0.54; revenues fell 1.7% year/year to $493.77 mln vs the $486.23 mln FactSet Consensus.\n• FY26 adjusted EBITDA expected between $280 mln and $300 mln."},{"time":"06:04","ticker":"THRM","headline":"Gentherm misses by $0.07, beats on revs; guides FY26 revs in-line","body":"• Reports Q4 (Dec) earnings of $0.49 per share, excluding non-recurring items, $0.07 worse than the FactSet Consensus of $0.56; revenues rose 8.5% year/year to $382.79 mln vs the $371.91 mln FactSet Consensus.\n• Gross margin was 23.7%, compared to 24.4% in the prior year. The decrease was primarily driven by higher material costs, including mix, as well as expenses related to our footprint realignment, partially offset by operating leverage.\n• Co issues in-line guidance for FY26, sees FY26 revs of $1.50-$1.60 bln vs. $1.52 bln FactSet Consensus. Sees adj EBITDA of $175-$195 mln."},{"time":"06:04","ticker":"EPAM","headline":"EPAM Systems beats by $0.11, beats on revs; guides Q1 EPS in-line, revs in-line; guides FY26 EPS in-line, revs in-line","body":"• Reports Q4 (Dec) earnings of $3.26 per share, excluding non-recurring items, $0.11 better than the FactSet Consensus of $3.15; revenues rose 12.8% year/year to $1.41 bln vs the $1.39 bln FactSet Consensus.\n• Co issues in-line guidance for Q1, sees EPS of $2.70-2.78, excluding non-recurring items, vs. $2.71 FactSet Consensus; sees Q1 revs of $1.385-1.40 bln vs. $1.39 bln FactSet Consensus.\n• Co issues in-line guidance for FY26, sees EPS of $12.60-12.90, excluding non-recurring items, vs. $12.54 FactSet Consensus; sees FY26 revs of 4.5-7.5% yr/yr to $5.7-5.86 bln vs. $5.82 bln FactSet Consensus."},{"time":"06:03","ticker":"TSEM","headline":"Tower Semi and Xanadu expamd collaboration in developing advanced silicon photonics for fault tolerant quantum computers based on Tower's high-volume silicon photonics platform","body":"These developments build on prior collaborative technical achievements, including a series of successful joint tapeouts to test and refine Xanadu's designs on Tower Semiconductor process flows. In addition, as the quantum computing industry advances toward commercial scale systems, this collaboration is set to meet the manufacturability requirements of large-scale photonic quantum computing."},{"time":"06:00","ticker":"SUMRX","headline":"Overnight Summary -- Global markets mixed as Japan rallies, Europe stumbles, and geopolitics simmer","body":"• U.S. futures drift lower as investors digest a divided Federal Reserve and brace for Walmart earnings to gauge the resilience of the American consumer. Fed minutes revealed sharp debate over the rate path, yet expectations for two cuts this year remain largely intact even as inflation concerns linger. The S&P is down about 23 points, trading around 6872. The market traded in a consolidative range, peaking at 6912.50 shortly after Europe opened. Sellers quickly took control and easily slid through 6900, and the market currently sits just off the low of 6866.25.\n• Asian markets closed mostly higher on Thursday, supported by easing AI-related concerns and stronger U.S. economic data. However, trading volumes remained light as China, Hong Kong, and Taiwan were shut for the Lunar New Year holidays. Japan outperformed, with the Nikkei 225 rising 0.57% to 57,467.83 after record growth in December machinery orders, a softer yen, and renewed optimism around AI-chip demand lifted technology shares. SoftBank and Tokyo Electron led gains, while Advantest fell after disclosing a ransomware incident. In the broader backdrop, a firm dollar, gold above $5,000 on geopolitical tensions with Iran, and stronger oil prices added to cross-asset volatility.\n• European markets trade lower as mixed earnings and escalating geopolitical tensions weigh on sentiment, with reports suggesting the U.S. military could strike Iran as soon as this weekend. Germany's DAX falls around 0.9%, pressured by a sharp drop in Airbus after it cut production targets, while autos and industrial names broadly decline; Vonovia and Fresenius names provide limited support. In Paris, the CAC 40 faces volatility, with Air France-KLM soaring on record 2025 operating profit and Orange rising on a quarterly beat, offset by weakness in Airbus and Accor. The FTSE 100 also softens as CRH slips on a Q4 earnings miss and Zurich Insurance retreats despite record results, while Nestle and Repsol post gains on strategic updates and shareholder returns.\n• S&P Futures vs Fair Value: -24.0\n• 10 yr Note: 4.097%\n• USD/JPY: 154.85 +0.02\n• EUR/USD: 1.1792 +0.0009\n• Europe: FTSE: -0.6% DAX: -0.9% CAC: -0.9%\n• Asia: Hang Seng: CLOSED Shanghai: CLOSED Nikkei: +0.6%\n• Gold (5010.40 +0.90) Silver (78.365 +0.767) Crude (66.07 +0.88)"},{"time":"05:58","ticker":"","headline":"S&P futures vs fair value: -24.00. Nasdaq futures vs fair value: -112.00.","body":""},{"time":"05:58","ticker":"","headline":"European Markets","body":"FTSE...10612.28...-73.90...-0.70%. DAX...25057.84...-220.40...-0.90%."},{"time":"05:58","ticker":"","headline":"Asian Markets","body":"Nikkei...57467.83...+324.00...+0.60%. Hang Seng...Holiday........."},{"time":"05:56","ticker":"WIRES","headline":"On The Wires","body":"• Vonage, part of Ericsson (ERIC) announced a number of new initiatives, to further expand and enable its global developer community. By growing its developer community and tools, giving developers and enterprises access to new mobile network insights and capabilities that can be embedded into existing applications and workflows, Vonage is accelerating its strategy to transform mobile networks into a programmable platform.\n• IHG Hotels & Resorts (IHG) has signed a management agreement with JADEER GROUP for Hotel Indigo Cairo New Administrative Capital, further expanding the company's Luxury & Lifestyle portfolio in Egypt. The 140-key hotel will be located within a mixed-use development in the New Capital in the east of Cairo and is scheduled to open in 2033."},{"time":"05:54","ticker":"NEXA","headline":"Nexa Resources announced that operations at the Atacocha San Gerardo open pit mine began gradually resuming on Feb 16 and are progressing toward normal capacity utilization levels","body":"• As a result of the temporary disruption, the Company estimates a production loss of approximately 0.9kt of zinc. This minimal impact is expected to be fully recovered in the upcoming months, and Nexa's 2026 production guidance remains unchanged.\n• Nexa remains committed to the social development of its host communities and will continue to pursue active dialogue and constructive engagement with local stakeholders. The safety and well-being of our employees and contractors remain our highest priority, and all operational activities are being conducted in accordance with established safety protocols."},{"time":"05:50","ticker":"NSRGY","headline":"Nestle reports FY25 EPS of CHF 4.42 vs. CHF 4.77 last year; sales -2.0% yr/yr to CHF -2.0% yr/yr to CHF 89.5 bln","body":"• \"Outlook: OG expected to be in the range of around 3% up to 4%, with RIG accelerating versus 2025, driven by our focused growth plans; this includes the expected impact of sales returns and stock shortages of approximately -20 bps from the infant formula recall; additional impact is uncertain and could drive OG towards the lower end of the range. UTOP margin expected to improve versus 2025, strengthening in the second half of the year. Free cash flow expected to be above CHF 9 billion\n• With the formation of the newly integrated Nutrition business, the Globally Managed Business structure of Nestl Health Science will be removed. Anna Mohl, CEO of Nestl Health Science, will step down from the Executive Board on 28 February 2026 and has chosen to pursue opportunities outside Nestl. The Board of Directors warmly thanks Anna Mohl for her leadership and significant contributions to Nestl and wishes her every success in her future endeavors.\n• Our Coffee and Petcare businesses are global powerhouses backed by leading brands: including Nescaf, Nespresso and Starbucks in Coffee, and Pro Plan, Purina ONE and Friskies in Petcare. For these two businesses, it is all about executing on our opportunities. In Nutrition, we are creating a third global powerhouse by integrating our nutrition and Nestl Health Science units. This will drive focus, simplification and synergies that allow us to accelerate growth. In Food & Snacks, we continue our disciplined portfolio management through targeted brand rationalization. This includes advanced negotiations to sell our remaining ice cream businesses to Froneri. For Nestl Waters & Premium Beverages, we began the formal engagement process with potential partners in Q1 2026 and expect the business to be deconsolidated from 2027.\""},{"time":"05:34","ticker":"NICE","headline":"NICE beats by $0.03, reports revs in-line; guides Q1 EPS below consensus, revs in-line; guides FY26 EPS in-line, revs in-line; announces new $600 million share repurchase program","body":"• Reports Q4 (Dec) earnings of $3.24 per share, excluding non-recurring items, $0.03 better than the FactSet Consensus of $3.21; revenues rose 9.0% year/year to $786.5 mln vs the $779.97 mln FactSet Consensus.\n• Co issues guidance for Q1, sees EPS of $2.45-2.55, excluding non-recurring items, vs. $2.61 FactSet Consensus; sees Q1 revs of $755-765 mln vs. $760.51 mln FactSet Consensus.\n• Co issues in-line guidance for FY26, sees EPS of $10.85-10.05, excluding non-recurring items, vs. $10.90 FactSet Consensus; sees FY26 revs of $3.17-3.19 bln vs. $3.18 bln FactSet Consensus.\n• Balance Sheet and Capital Return Update:On February 18, 2026, NiCE entered into a secured Credit Agreement with certain lenders and JPMorgan Chase Bank, N.A., as administrative agent. The Credit Agreement provides for a $300 millionrevolving credit facility, and is subject to customary closing conditions. Unless terminated earlier, the commitments under the revolving credit facility will expire on February 17, 2029. The facility provides additional liquidity and optionality while maintaining a strong balance sheet.On February 18, 2026, NiCE's Board of Directors authorized a new $600 million share repurchase program. The execution of this program is subject to the issuance of the Company's audited annual financial report for the year 2025. This authorization reflects the company's conviction in its long-term growth opportunity and durability of its cash flow generation. Following this authorization, NiCE currently has approximately $1 billion of total remaining share repurchase capacity (including previously authorized share repurchased programs which were not fully exhausted).\n• On February 18, 2026, NiCE entered into a secured Credit Agreement with certain lenders and JPMorgan Chase Bank, N.A., as administrative agent. The Credit Agreement provides for a $300 millionrevolving credit facility, and is subject to customary closing conditions. Unless terminated earlier, the commitments under the revolving credit facility will expire on February 17, 2029. The facility provides additional liquidity and optionality while maintaining a strong balance sheet.\n• On February 18, 2026, NiCE's Board of Directors authorized a new $600 million share repurchase program. The execution of this program is subject to the issuance of the Company's audited annual financial report for the year 2025. This authorization reflects the company's conviction in its long-term growth opportunity and durability of its cash flow generation. Following this authorization, NiCE currently has approximately $1 billion of total remaining share repurchase capacity (including previously authorized share repurchased programs which were not fully exhausted)."},{"time":"05:19","ticker":"MRK","headline":"Merck reports new data for ENFLONSIA (clesrovimab) for infants and children under 2 years of age at increased risk for severe Respiratory Syncytial Virus (RSV) Disease over two RSV seasons","body":"Second season results from the Phase 3 SMART trial were presented at the 9th RSVVW Conference and will be shared with the U.S. FDA and other regulatory authoritiesClick here for full release."},{"time":"05:01","ticker":"FSM","headline":"Fortuna Silver Mines expands Indicated Mineral Resource by 73% to 1.25 million gold ounces, Diamba Sud Project, Senegal","body":"VANCOUVER, British Columbia, Feb. 19, 2026 (GLOBE NEWSWIRE) -- Fortuna Mining Corp. (NYSE: FSM | TSX: FVI) is pleased to announce an updated Mineral Resource estimate for the Diamba Sud Gold Project, effective January 16, 2026. Indicated Mineral Resources total 1.25 million ounces of gold, reflecting an increase of 530,000 ounces from the prior estimate and demonstrating open resource growth potential.Click here for full release."},{"time":"04:49","ticker":"WIRES","headline":"On The Wires","body":"• Employers Holdings (EIG) announced the launch of its new Excess Workers' Compensation insurance product, marking a strategic expansion of EMPLOYERS' portfolio to serve large self-insured employers, groups, pools, and joint powers authorities from coast to coast.\n• SmartStop Self Storage REIT, Inc. (SMA) announced that it has completed an amended and restated senior unsecured credit facility in the initial amount of $500 million with a syndicate of banks led by KeyBank National Association, Bank of Montreal, JPMorgan Chase Bank, N.A., M&T Bank, The Bank of Nova Scotia, Truist Bank and Wells Fargo Bank, N.A. The financing will provide SmartStop with additional flexibility to support its continued growth across the United States and Canada.\n• Kyndryl (KD) launched its first Cyber Defense Operations Center, a next-generation command hub that unifies network operations and security operations into a single, integrated operating model. The new Center is located in Bengaluru, India, providing global customers with deep cybersecurity and network operations expertise to accelerate incident response, resilience, and overall IT performance.\n• Agilysys, Inc. (AGYS) announced that Rudding Park - an award-winning hotel, spa, and golf resort in Harrogate - has appointed Agilysys hospitality software solutions to support a large-scale technology transformation across its growing, multi-amenity luxury hotel business."},{"time":"04:48","ticker":"AZN","headline":"AstraZeneca ENHERTU EU filing accepted in early HER2+ breast cancer","body":"• AstraZeneca said the EMA validated a Type II variation application for ENHERTU as post-neoadjuvant monotherapy in adults with HER2-positive early breast cancer with residual invasive disease.\n• Filing is based on the Phase III DESTINY-Breast05 trial, where ENHERTU reduced the risk of invasive disease recurrence or death by 53% versus T-DM1.\n• Validation triggers CHMP scientific review and marks a step toward potential approval in an earlier-stage setting.\n• Additional EU submissions are ongoing, including ENHERTU combinations in first-line metastatic HER2+ breast cancer and in previously treated HER2+ solid tumors."},{"time":"04:45","ticker":"SAP","headline":"SAP SE proposes 2.50 dividend for FY25, up 6.4%","body":"• SAP recommended a FY25 dividend of 2.50 per share, up 0.15 or 6.4% from the prior year.\n• Total distribution would be ~2.919 bln, implying a 40.7% payout ratio versus 52.0% in FY24, assuming unchanged treasury shares.\n• SAP reiterated its policy to distribute 40% or more of Non-IFRS profit after tax."},{"time":"04:42","ticker":"TECK","headline":"Teck Resources beats by CAD0.37, misses on revs","body":"• Reports Q4 (Dec) earnings of CAD1.37 per share, CAD0.37 better than the FactSet Consensus of CAD1.00; revenues rose 9.8% year/year to CAD3.06 bln vs the CAD3.17 bln FactSet Consensus.\n• 2026 Guidance SummaryProduction guidance (2026)Copper: 455--530 thousand tonnesZinc (mine production): 410--460 thousand tonnesRefined zinc: 190--230 thousand tonnesSales guidance -- Q1 2026Red Dog zinc in concentrate sales: 40--50 thousand tonnesUnit cost guidance (2026)Copper net cash unit costs: $1.85--2.20 per lbZinc net cash unit costs: $0.65--0.75 per lb\n• Production guidance (2026)Copper: 455--530 thousand tonnesZinc (mine production): 410--460 thousand tonnesRefined zinc: 190--230 thousand tonnes\n• Copper: 455--530 thousand tonnes\n• Zinc (mine production): 410--460 thousand tonnes\n• Refined zinc: 190--230 thousand tonnes\n• Sales guidance -- Q1 2026Red Dog zinc in concentrate sales: 40--50 thousand tonnes\n• Red Dog zinc in concentrate sales: 40--50 thousand tonnes\n• Unit cost guidance (2026)Copper net cash unit costs: $1.85--2.20 per lbZinc net cash unit costs: $0.65--0.75 per lb\n• Copper net cash unit costs: $1.85--2.20 per lb\n• Zinc net cash unit costs: $0.65--0.75 per lb"},{"time":"04:18","ticker":"FCX","headline":"Freeport-McMoRan signs MOU with Indonesia for Grasberg life-of-resource extension","body":"• Freeport said it entered into an MOU with the Indonesia government to amend PT Freeport Indonesia's IUPK and extend operating rights in the Grasberg minerals district for the life of the resource.PTFI will increase community support in Papua, boost exploration spending and continue prioritizing domestic downstreaming, with flexibility to expand refined copper sales to the U.S. if needed.Freeport will transfer a 12% interest in PTFI to government interests in 2041 at no cost (with reimbursement for certain post-2041 investments), reducing its stake from 48.76% through 2041 to ~37% beginning in 2042.The extension remains subject to issuance of an amended IUPK by the Indonesia government.\n• PTFI will increase community support in Papua, boost exploration spending and continue prioritizing domestic downstreaming, with flexibility to expand refined copper sales to the U.S. if needed.\n• Freeport will transfer a 12% interest in PTFI to government interests in 2041 at no cost (with reimbursement for certain post-2041 investments), reducing its stake from 48.76% through 2041 to ~37% beginning in 2042.\n• The extension remains subject to issuance of an amended IUPK by the Indonesia government."},{"time":"04:17","ticker":"BA","headline":"Boeing secures up to 40 Dreamliner order from Sun PhuQuoc Airway","body":"• Boeing said Sun PhuQuoc Airways placed an order for up to 40 787 Dreamliner aircraft to anchor the carrier's widebody fleet.\n• The 787-9 jets, with a range of approximately 7,565 nautical miles, are expected to support long-haul service linking Phu Quoc with Asia, Europe and North America.\n• The order represents the largest Boeing widebody purchase in Vietnam's history and marks the airline's first direct aircraft acquisition."},{"time":"04:14","ticker":"BA","headline":"Boeing secures 50-aircraft 737 MAX order from Vietnam Airlines","body":"• Boeing said Vietnam Airlines finalized an order for 50 737-8 MAX aircraft, marking the carrier's first Boeing single-aisle purchase.The 737-8 jets are intended to support domestic and regional route expansion as Southeast Asia air travel demand is projected to rise.The aircraft can seat up to 200 passengers with a range of approximately 3,500 nautical miles, supporting short- and medium-haul growth.The order strengthens Boeing's backlog and deepens its commercial relationship with Vietnam Airlines amid expected passenger growth in Vietnam.\n• The 737-8 jets are intended to support domestic and regional route expansion as Southeast Asia air travel demand is projected to rise.\n• The aircraft can seat up to 200 passengers with a range of approximately 3,500 nautical miles, supporting short- and medium-haul growth.\n• The order strengthens Boeing's backlog and deepens its commercial relationship with Vietnam Airlines amid expected passenger growth in Vietnam."},{"time":"04:12","ticker":"CMPS","headline":"COMPASS Pathways prices offering consisting of ADSs and warrants","body":"• Co announces the pricing of 17,500,000 American Depositary Shares at a public offering price of $8.00 per ADS, each representing one ordinary share, and in lieu of ADSs, to certain institutional investors, pre-funded warrants to purchase up to 1,250,000 ADSs at a public offering price of $7.9999 per pre-funded warrant."},{"time":"04:06","ticker":"EPRX","headline":"Eupraxia Pharmaceuticals prices offering consisting of common stock and warrants","body":"• Co prices offering of 6,428,574 common shares of the Company at a price to the public of US$7.00 per Common Share and pre-funded warrants to purchase up to 1,428,571 Common Shares in lieu thereof at a price of $6.99999 per Pre-Funded Warrant, which equals the public offering price per Common Share less the C$0.00001 per share exercise price of each Pre-Funded Warrant, for gross proceeds of ~$55 million."}],"fetchedAt":1771513094975},"savedAt":1771513094976}