{"data":{"updated":"2/13/2026, 6:04:16 AM","entries":[{"time":"05:09","ticker":"MGA","headline":"Magna beats by $0.38, beats on revs; guides FY26 EPS above consensus, revs in-line; raises dividend","body":"• Reports Q4 (Dec) earnings of $2.18 per share, excluding non-recurring items, $0.38 better than the FactSet Consensus of $1.80; revenues rose 2.1% year/year to $10.85 bln vs the $10.56 bln FactSet Consensus.\n• Co issues guidance for FY26, sees EPS of $6.25-7.25, excluding non-recurring items, vs. $5.98 FactSet Consensus; sees FY26 revs of $41.9-43.5 bln vs. $42.13 bln FactSet Consensus.\n• Co's Board of Directors declared a fourth quarter dividend of $0.495 per Common Share. This represents a 2% higher dividend, and our 16th consecutive year of fourth quarter dividend increases. The dividend is payable on March 13, 2026 to shareholders of record as of the close of business on February 27, 2026."},{"time":"04:57","ticker":"SBSW","headline":"Sibanye-Stillwater signs 138 MW renewable PPA, expanding contracted clean energy portfolio","body":"• Sibanye-Stillwater Ltd. entered into a 138 MW renewable energy power purchase agreement with NOA Group, lifting its total contracted renewable capacity to approximately 765 MW.The 10-year agreement will supply 138 MW per annum from aggregated solar and wind facilities via the Eskom grid under South Africa's national wheeling framework, with supplemental short-term take-and-pay supply.The Co expects the additional capacity to reduce greenhouse gas emissions by approximately 433,080 tCO2e per year from 2028 onward.The agreement strengthens Sibanye-Stillwater's position as the largest contracted private renewable energy off-taker in South Africa's mining sector and supports its decarbonization strategy.\n• The 10-year agreement will supply 138 MW per annum from aggregated solar and wind facilities via the Eskom grid under South Africa's national wheeling framework, with supplemental short-term take-and-pay supply.\n• The Co expects the additional capacity to reduce greenhouse gas emissions by approximately 433,080 tCO2e per year from 2028 onward.\n• The agreement strengthens Sibanye-Stillwater's position as the largest contracted private renewable energy off-taker in South Africa's mining sector and supports its decarbonization strategy."},{"time":"04:46","ticker":"AZN","headline":"AstraZeneca reports Phase III data showing Breztri improved lung function in uncontrolled asthma","body":"• AstraZeneca PLC reported Phase III KALOS and LOGOS results published in The Lancet Respiratory Medicine showing Breztri (budesonide/glycopyrronium/formoterol) delivered statistically significant improvements in lung function versus dual ICS/LABA therapies in patients with uncontrolled asthma.In pooled primary endpoint analyses, Breztri improved morning pre-dose trough FEV1 by 76 mL and FEV1 AUC0-3 by 90 mL over 24 weeks versus combined dual-therapy groups (p<0.001).Breztri also reduced the annualised rate of severe asthma exacerbations compared with ICS/LABA treatments, with no new safety or tolerability signals identified.Regulatory filings for Breztri in asthma are under review in major regions, expanding its potential beyond its existing COPD approvals in more than 80 countries.\n• In pooled primary endpoint analyses, Breztri improved morning pre-dose trough FEV1 by 76 mL and FEV1 AUC0-3 by 90 mL over 24 weeks versus combined dual-therapy groups (p<0.001).\n• Breztri also reduced the annualised rate of severe asthma exacerbations compared with ICS/LABA treatments, with no new safety or tolerability signals identified.\n• Regulatory filings for Breztri in asthma are under review in major regions, expanding its potential beyond its existing COPD approvals in more than 80 countries."},{"time":"04:44","ticker":"HIVE","headline":"HIVE Digital Technologies signs $30 mln AI cloud contracts to expand BUZZ HPC platform","body":"• HIVE Digital Technologies Ltd. announced its BUZZ HPC unit signed customer agreements totaling approximately $30 mln in contract value over two-year fixed terms, subject to performance and deployment milestones.The contracts support the initial phase of BUZZ's AI-optimized GPU deployment at its Canada West site in Manitoba, with 504 liquid-cooled Dell server-based GPUs expected online by March 31, 2026.Management expects the initial phase to generate roughly $15 mln in annual recurring revenue once fully operational, with total annualized HPC segment revenue projected to increase from about $20 mln to approximately $35 mln upon full deployment.HIVE anticipates capital expenditures for GPUs, electrical and cooling infrastructure, and working capital, alongside operating costs including power, hosting, maintenance, staffing, and network expenses.\n• The contracts support the initial phase of BUZZ's AI-optimized GPU deployment at its Canada West site in Manitoba, with 504 liquid-cooled Dell server-based GPUs expected online by March 31, 2026.\n• Management expects the initial phase to generate roughly $15 mln in annual recurring revenue once fully operational, with total annualized HPC segment revenue projected to increase from about $20 mln to approximately $35 mln upon full deployment.\n• HIVE anticipates capital expenditures for GPUs, electrical and cooling infrastructure, and working capital, alongside operating costs including power, hosting, maintenance, staffing, and network expenses."},{"time":"04:36","ticker":"TPH","headline":"TRI Pointe Homes to be acquired by Sumitomo Forestry in $4.5 bln cash deal","body":"• Tri Pointe Homes agreed to be acquired by Sumitomo Forestry for $47.00 per share in cash, valuing the transaction at approximately $4.5 bln.The offer represents a 29% premium to Feb. 12 closing price and a 42% premium to the 90-day VWAP, and exceeds the prior all-time high closing price.TPH will continue operating under its existing brand and management team, maintaining its Irvine headquarters and 17 divisions, but will become a wholly owned subsidiary and delist from the NYSE upon closing.The deal, unanimously approved by both boards, is expected to close in Q2 2026, subject to shareholder approval and customary conditions, and is not subject to financing.\n• The offer represents a 29% premium to Feb. 12 closing price and a 42% premium to the 90-day VWAP, and exceeds the prior all-time high closing price.\n• TPH will continue operating under its existing brand and management team, maintaining its Irvine headquarters and 17 divisions, but will become a wholly owned subsidiary and delist from the NYSE upon closing.\n• The deal, unanimously approved by both boards, is expected to close in Q2 2026, subject to shareholder approval and customary conditions, and is not subject to financing.\n• TPH reiterated its Q4 and FY25 outlook and will report results on Feb. 25, 2026.For the fourth quarter, the Company anticipates delivering between 1,200 and 1,400 homes at an average sales price between $690,000 and $700,000. The Company expects homebuilding gross margin percentage to be in the range of 19.5% to 20.5% for the fourth quarter and anticipates its SG&A expense as a percentage of home sales revenue will be in the range of 10.5% to 11.5%. Finally, the Company expects its effective tax rate for the fourth quarter to be approximately 27.0%.For the full year, the Company anticipates delivering between 4,800 and 5,000 homes at an average sales price of approximately $680,000. The Company expects homebuilding gross margin percentage to be approximately 21.8%, excluding $19.3 million of inventory-related charges for the nine months ended September 30, 2025.\n• For the fourth quarter, the Company anticipates delivering between 1,200 and 1,400 homes at an average sales price between $690,000 and $700,000. The Company expects homebuilding gross margin percentage to be in the range of 19.5% to 20.5% for the fourth quarter and anticipates its SG&A expense as a percentage of home sales revenue will be in the range of 10.5% to 11.5%. Finally, the Company expects its effective tax rate for the fourth quarter to be approximately 27.0%.\n• For the full year, the Company anticipates delivering between 4,800 and 5,000 homes at an average sales price of approximately $680,000. The Company expects homebuilding gross margin percentage to be approximately 21.8%, excluding $19.3 million of inventory-related charges for the nine months ended September 30, 2025."},{"time":"04:30","ticker":"CPAC","headline":"Cementos Pacasmayo S.A.A. reports Q4 results","body":"Cementos Pacasmayo S.A.A. and subsidiaries (NYSE: CPAC; BVL: CPACASC1) (\"the Company\" or \"Pacasmayo\") a leading cement company serving the Peruvian construction industry, announced today its consolidated results for the fourth quarter (\"4Q25\") and for the year (\"2025\") ended December 31, 2025. These results have been prepared in accordance with International Financial Reporting Standards (\"IFRS\") and are stated in Soles (S/).Click here for full release."},{"time":"04:29","ticker":"AMKR","headline":"Amkor prices secondary offering of 10.0 mln shares of common stock at $48.75 per share","body":""},{"time":"04:27","ticker":"CHRS","headline":"Coherus BioSciences prices offering of 28.6 mln shares of common stock at $1.75 per share","body":""},{"time":"04:26","ticker":"AMH","headline":"American Homes 4 Rent raises quarterly dividend by 10%","body":"• Co announced that the Board of Trustees declared a dividend of $0.33 per share on the Company's common shares for the first quarter of 2026.\n• This represents an increase of 10% versus the prior quarterly dividend rate of $0.30 per share.\n• The distribution will be payable in cash on March 31, 2026 to shareholders of record on March 13, 2026."},{"time":"04:25","ticker":"EVMN","headline":"Evommune prices offering of 4,494,279 shares of its common stock at $27.88 per share","body":""},{"time":"04:20","ticker":"NAMM","headline":"Namib Minerals egins dewatering at Redwing to advance restart plans","body":"• Namib Minerals commenced dewatering activities at its Redwing Mine in Zimbabwe on Jan. 29, 2026, as part of its restart project.Dewatering is intended to enable underground access for feasibility work, including condition assessments and detailed engineering studies.The work aligns with the plan outlined in the November 2025 business update and marks progress on enabling activities.Co indicates execution remains consistent with its staged restart strategy focused on safety and disciplined capital deployment.\n• Dewatering is intended to enable underground access for feasibility work, including condition assessments and detailed engineering studies.\n• The work aligns with the plan outlined in the November 2025 business update and marks progress on enabling activities.\n• Co indicates execution remains consistent with its staged restart strategy focused on safety and disciplined capital deployment."},{"time":"04:16","ticker":"NVS","headline":"Novartis reports Phase III data for Vanrafia in IgA nephropathy","body":"• Novartis reported Phase III ALIGN data showing Vanrafia (atrasentan) reduced kidney function decline vs. placebo in IgA nephropathy, with a 2.39 ml/min/1.73m difference in eGFR at Week 136 (p=0.057).At end of treatment (Week 132), eGFR difference vs. placebo was 2.59 ml/min/1.73m (nominal p=0.039), with results favoring Vanrafia across multiple timepoints and in patients also receiving SGLT2 inhibitors.Vanrafia received accelerated approval in the U.S. and China in 2025 for reduction of proteinuria in adults with IgAN; Co plans to seek traditional approval in 2026.Safety profile was consistent with prior findings; ALIGN represents the longest follow-up period among pivotal Phase III IgAN studies.\n• At end of treatment (Week 132), eGFR difference vs. placebo was 2.59 ml/min/1.73m (nominal p=0.039), with results favoring Vanrafia across multiple timepoints and in patients also receiving SGLT2 inhibitors.\n• Vanrafia received accelerated approval in the U.S. and China in 2025 for reduction of proteinuria in adults with IgAN; Co plans to seek traditional approval in 2026.\n• Safety profile was consistent with prior findings; ALIGN represents the longest follow-up period among pivotal Phase III IgAN studies."}],"fetchedAt":1770980656154},"savedAt":1770980656154}