{"data":{"updated":"2/16/2026, 8:03:07 AM","entries":[{"time":"17:56","ticker":"SPY","headline":"REMINDER: MARKETS ARE CLOSED ON MONDAY FEBRUARY 16 FOR PRESIDENTS DAY","body":""},{"time":"17:56","ticker":"WRAPX","headline":"This week's biggest % gainers/losers","body":"• Healthcare: NKTR (72.26 +96.31%), KPTI (8.57 +36.82%), ACHC (16.76 +25.36%)\n• Materials: EGO (47.22 +21%)\n• Industrials: NCI (2.46 +113.88%), GNRC (225.46 +22.85%)\n• Consumer Discretionary: CPS (45.67 +31.9%), TPH (46.36 +30.72%), MGA (69.07 +27.86%), BWA (62.94 +20.5%)\n• Information Technology: ICHR (46.54 +44.75%), IPGP (153.81 +40.32%), CGNX (58.81 +38.79%), TDC (33.57 +22.19%), AKAM (111.5 +17.27%), DIOD (71.11 +16.88%)\n• Financials: RWT (6.62 +16.96%)\n• Energy: RIG (6.49 +20.32%), NE (46.13 +17.68%)\n• Healthcare: ICLR (95.71 -36.44%), CHRS (1.61 -25%), RGNX (7.99 -22.65%)\n• Materials: CLF (10.40 -29.39%)\n• Industrials: NSP (25.65 -34.11%), UPWK (13.27 -29.93%), TNET (39.74 -28.98%), CBZ (27.84 -27.25%), JELD (2.27 -22.53%)\n• Consumer Discretionary: CHGG (0.56 -28.81%), MAT (16.44 -23.5%), MPAA (10.13 -22.91%), BFAM (66.76 -22.45%)\n• Information Technology: RPD (7.11 -34.23%)\n• Financials: GSHD (48.76 -26.31%), EHTH (1.71 -23.11%)"},{"time":"17:56","ticker":"CME","headline":"CME Group announces its event contracts reached a new milestone of 100 mln contracts traded since launch in December","body":""},{"time":"17:16","ticker":"FE","headline":"FirstEnergy selects site for new natural gas power plant","body":"• Mon Power and Potomac Edison, subsidiaries of FirstEnergy, have selected a 35-acre site next to the companies' Fort Martin Power Station in Maidsville, WV, as the home of a new 1,200-megawatt natural gas power plant that will help keep electricity reliable and affordable for West Virginia families and businesses for years to come.\n• Once complete, the plant is expected to generate enough energy to power roughly half a million homes, strengthening the region's energy supply as demand continues to grow.\n• If approved by the Public Service Commission of West Virginia (PSC), site work would begin as early as 2027, with the plant coming online in late 2031. Cos expect a decision from the commission within the next year."},{"time":"17:14","ticker":"LAD","headline":"Lithia Motors implements shift to align its IT and technology teams more closely","body":"• Co is implementing a focused shift to align its IT and technology teams more closely with the businesses, customers, and products they support.\n• As part of this alignment, George Hines will transition from his role as SVP, Chief Innovation and Technology Officer, effective as of March 1, 2026.\n• Going forward, the core technology functions will now report under Tina Miller, Chief Financial Officer, and Dianna du Preez, Chief Customer Officer. To support an orderly transition, Mr. Hines will remain with the company in a non-executive role."},{"time":"17:11","ticker":"OCUL","headline":"Ocular Therapeutix to Announce Topline Data for SOL-1 Phase 3 Superiority Trial in Wet AMD on Tuesday, February 17, 2026","body":"BEDFORD, Mass., Feb. 13, 2026 (GLOBE NEWSWIRE) -- Ocular Therapeutix, Inc. (NASDAQ: OCUL, \"Ocular\"), an integrated biopharmaceutical company committed to redefining the retina experience, today announced that the Company will host a webcast to review the topline results of the SOL-1 Phase 3 superiority clinical trial of AXPAXLI (also known as OTX-TKI), for the treatment of wet age-related macular degeneration (wet AMD), on Tuesday, February 17, 2026. Detailed data will be presented at the 49th Macula Society Annual Meeting between February 25 -- 28, 2026.Click here for full release."},{"time":"17:06","ticker":"SOBO","headline":"South Bow Shares Findings of Root Cause Analysis of Milepost 171 Incident","body":"CALGARY, Alberta, Feb. 13, 2026 (GLOBE NEWSWIRE) -- South Bow Corp. (TSX & NYSE: SOBO) (South Bow or the Company) and the Pipeline and Hazardous Materials Safety Administration (PHMSA) have received the independent third-party root cause analysis (RCA) of the incident that occurred at Milepost 171 (MP-171) of the Keystone Pipeline on April 8, 2025, near Fort Ransom, N.D.Click here for full release."},{"time":"17:04","ticker":"WHG","headline":"Westwood Holdings Group Reports Fourth Quarter and Full Year 2025 Results","body":"DALLAS, Feb. 13, 2026 (GLOBE NEWSWIRE) -- Westwood Holdings Group, Inc. (NYSE: WHG) today reported fourth quarter and fiscal year 2025 earnings. Significant items include:Click here for full release."},{"time":"17:00","ticker":"UBER","headline":"Uber files mixed securities shelf offering","body":""},{"time":"17:00","ticker":"OTIS","headline":"Otis Worldwide files mixed securities shelf offering","body":""},{"time":"16:56","ticker":"BMI","headline":"Badger Meter increases its share repurchase authorization by $75 mln bringing the total share repurchase authorization to $150 mln","body":""},{"time":"16:51","ticker":"AMGN","headline":"Amgen files mixed securities shelf offering; also files for common stock offering by selling shareholders","body":""},{"time":"16:34","ticker":"BNC","headline":"CEA Industries issues statement refuting YZi Labs' latest claims; Confirms BNC is fully compliant with Nasdaq rules for holding the annual meeting","body":"• \"BNC is in full compliance with Nasdaq Rule 5620(a). Nasdaq rules also allow the Company to submit a plan to regain compliance if the Annual Meeting has not been held by the fiscal year end. Given that our fiscal year does not even end for two more months, YZi Labs' reckless claim that the Company is at risk of delisting is self-evidently false. Furthermore, contrary to YZi Labs' implication that the change to the Company's fiscal year end was intended to disadvantage or thwart YZi Labs, the Company transitioned its fiscal year end on June 29, 2025 - well before YZi Labs had acquired a single share of BNC stock - to align with the fiscal year end of the Company's then-largest operating business.\n• This change was approved in accordance with applicable law and was properly disclosed to all stockholders on a Form 8-K filed on July 3, 2025. We are disappointed that YZi Labs would resort to promoting baseless conspiracy theories that it knows, or should know, are false.\n• The Company will not be drawn into inflammatory public exchanges and remains focused on disciplined governance, long-term value creation and acting in the best interests of all stockholders.\""},{"time":"16:33","ticker":"NPO","headline":"Enpro Inc. increases quarterly cash dividend 3.2% to $0.32/share from $0.31/share","body":""},{"time":"16:31","ticker":"VMC","headline":"Vulcan Materials increases quarterly cash dividend to $0.52/share from $0.49/share","body":""},{"time":"16:24","ticker":"WRAPX","headline":"Closing Market Summary: Choppy trade ends mixed on mega-cap drag","body":"• S&P Mid Cap 400: +7.8% YTD\n• Russell 2000: +6.6% YTD\n• DJIA: +3.0% YTD\n• S&P 500: -0.1% YTD\n• Nasdaq Composite: -3.0% YTD\n• January CPI 0.2% (Briefing.com consensus 0.3%); Prior 0.3%, January Core CPI 0.3% (Briefing.com consensus 0.3%); Prior 0.2%The key takeaway from the report is that it showed some encouraging disinflation on a year-over-year basis, which the market will perceive as an opening for the Fed to consider additional rate cuts even with GDP growth running above potential.\n• The key takeaway from the report is that it showed some encouraging disinflation on a year-over-year basis, which the market will perceive as an opening for the Fed to consider additional rate cuts even with GDP growth running above potential."},{"time":"16:22","ticker":"AXON","headline":"Axon discloses that it redeemed $840,000 aggregate principal amount of Convertible Notes on February 10, 2026, with cash","body":""},{"time":"16:21","ticker":"JNJ","headline":"Johnson &amp; Johnson confirms that a jury in the Philadelphia Court of Common Pleas has found the company responsible for the company's baby powder products contributing to the death of a Pennsylvania woman","body":"• The jury deliberated for more than three days before returning a verdict totaling $250,000 on behalf of the estate of York, Pennsylvania, resident Gayle Emerson, who died as a result of ovarian cancer in November of 2019 after filing her lawsuit six months earlier. The verdict included $50,000 in compensatory damages to Ms. Emerson's family and $200,000 in punitive damages against the company on claims of product liability, failure to warn about the products' dangers, and negligence.\n• According to court testimony, Ms. Emerson used J&J's talc-based body powders for feminine hygiene for more than 45 years and was diagnosed with ovarian cancer in 2015 at the age of 64."},{"time":"16:19","ticker":"MSFT","headline":"Microsoft: OpenAi introduces Lockdown Mode and Elevated Risk labels in ChatGPT","body":"• The two new protections are designed to help users and organizations mitigate prompt injection attacks, with clearer visibility into risk and stronger controls:\n• Lockdown Mode in ChatGPT, an advanced, optional security setting for higher-risk users.\n• \"Elevated Risk\" labels for certain capabilities in ChatGPT, ChatGPT Atlas, and Codex that may introduce additional risk These additions build on our existing protections across the model, product, and system levels.\n• This includes sandboxing, protections against URL-based data exfiltration?, monitoring and enforcement, and enterprise controls? like role-based access and audit logs."},{"time":"16:19","ticker":"BWA","headline":"BorgWarner files mixed securities shelf offering","body":""},{"time":"16:17","ticker":"HUM","headline":"Humana's CenterWell announces completion of its acquisition of MaxHealth from Arsenal Capital Partners","body":"• CenterWell, the healthcare services division of Humana (HUM), announces the successful completion of its acquisition of MaxHealth from Arsenal Capital Partners, a private equity investment firm that specializes in building market-leading industrial growth and healthcare companies, and MaxHealth's founder-shareholders.\n• MaxHealth currently maintains a network of 54 owned primary care clinics, 4 owned specialty/ancillary clinics and 24 downstream affiliate clinics throughout West and South Florida that together provide high-quality, integrated care to more than 120,000 patients, including more than 80,000 patients in value-based care programs."},{"time":"16:14","ticker":"ELF","headline":"e.l.f. Beauty appoints Matthew Farrell, former CEO of Church &amp; Dwight (CHD), to its Board of Directors","body":"• Co appointed Matthew Farrell to the Board as a Class I director, effective as of February 12, 2026.\n• Mr. Farrell served as the Chief Executive Officer of Church & Dwight (CHD), a global consumer products company, from January 2016 until April 2025 and as Chairman from 2019 until September 2025."},{"time":"16:12","ticker":"NEE","headline":"NextEra Energy Transmission subsidiary and Exelon Corporation (EXC) welcome the PJM Board of Directors' approval of their proposed ~220-mile, 765-kV transmission line","body":"• Advancing this project is a key step in addressing reliability risks and ensuring long-term grid stability. This investment will benefit customers and unlock new generation opportunities across the region, reinforcing the grid as electricity supply struggles to keep pace with rising demand.\n• As the regional grid operator for 13 states and D.C., PJM Board's decision reflects their determination that these reliability challenges cannot be solved with small or localized upgrades alone-extraordinary demand growth requires a suite of solutions."},{"time":"16:11","ticker":"EXAS","headline":"Exact Sciences misses by $0.34, beats on revs; note: co previously announced it's being acquired","body":"• Reports Q4 (Dec) loss of $(0.45) per share, $0.34 worse than the FactSet Consensus of ($0.11); revenues rose 23.1% year/year to $878.38 mln vs the $860.9 mln FactSet Consensus.\n• Pending merger: As previously announced, co agreed to be acquired by Abbott Labs (ABT). On February 20, 2026, co will hold a special meeting of stockholders to adopt the Merger Agreement. Cos are working toward closing in 2Q26, subject to obtaining required regulatory approvals and satisfaction or waiver of other customary closing conditions."},{"time":"16:08","ticker":"NOC","headline":"Northrop Grumman elects Admiral Christopher Grady, former vice chairman of the Joint Chiefs of Staff, to its board of directors","body":"• Grady served as the 12th vice chairman of the Joint Chiefs of Staff, the second highest-ranking military officer in the United States, from 2021 until his retirement as a four-star admiral in 2025.\n• His previous assignments include serving as the Commander of the U.S. Fleet Forces Command, the Commander of the U.S. Sixth Fleet and Naval Striking and Support Forces NATO and the Commander of the Carrier Strike Group 1."},{"time":"16:07","ticker":"SB","headline":"Safe Bulkers enters into an agreement for the sale of MV Michalis H, a 2012 Chinese-built, Capesize class, dry-bulk vessel, at a gross sale price of $35.2 million and a forward delivery date within the first quarter of 2026","body":""},{"time":"16:06","ticker":"NVCT","headline":"Nuvectis Pharma files for $150 mln mixed securities shelf offering","body":""},{"time":"16:04","ticker":"RYI","headline":"Ryerson and Olympic Steel announce successful closing of merger","body":"• As of February 24th, the company will trade on the New York Stock Exchange as Ryerson Holding Corporation under the ticker \"RYZ,\" which will honor both companies' former tickers and reflect the unification of their respective legacies and go-forward mission."}],"fetchedAt":1771246987356},"savedAt":1771246987356}